{
    "id": "anushmutyala",
    "name": "Anush Mutyala",
    "profile_pic": "https://static.licdn.com/aero-v1/sc/h/9c8pery4andzj6ohjkjp54ma2",
    "links": [
        "https://twitter.com/anushmutyala",
        "https://github.com/anushmutyala",
        "https://medium.com/@anushmutyala",
        "https://anushmutyala.com",
        "https://www.linkedin.com/in/anushmutyala/"
    ],
    "short_description": "Anush Mutyala is a biomedical engineering student at UBC and multifaceted researcher working at the intersection of neuroscience, robotics, and hardware engineering. Currently developing calibration-free robotics at NC4 Lab while building electronics for STEM cell factories at General Cybernetics, he's also passionate about DIY semiconductor fabrication and neuromorphic computing.",
    "long_description": "Anush Mutyala is a biomedical engineering student at the University of British Columbia, attending on a prestigious $120,000 Schulich Leader Scholarship. His research interests span multiple cutting-edge domains, with a particular focus on neuromorphic computing, robotics, and hardware engineering.\n\nCurrently, Anush works as a Robotics Researcher at NC4 Lab, where he's developing neural manifold approaches to eliminate sensor calibration in robotics systems. His work involves building ROS/Gazebo simulations to generate rich LIDAR datasets. Simultaneously, he serves as an Electrical Engineering Intern at General Cybernetics, designing PCBs for bioelectric cell reprogramming experiments using LTSpice and Altium/Kicad.\n\nAnush's research background is impressively diverse. At York University's LCRAIN lab, he led a cross-institutional team developing bio-plausible spiking neural network training algorithms using EEG-fMRI data. At the University of Toronto's Intelligent Sensory Microsystems Lab, he integrated spiking neural networks into low-power neural implants, reducing latency by 5x through algorithmic optimizations while enabling wearable form factors. He also designed gate-level implementations on FPGA to support future ASIC/tape-out efforts.\n\nHis entrepreneurial spirit is evident in his co-founding of NeuraDAO, which aimed to create a democratized funding ecosystem for neuroscience and technology research. The project raised over $6,000 in Gitcoin Round 15 and involved developing a decentralized marketplace for neuroimaging datasets built on Web3 protocols.\n\nAnush has also contributed to consumer neurotechnology at Divergence Neuro, where he helped build an EEG-based neurofeedback therapy platform, working on visualization modules and event-related potential experiments.\n\nHis innovation in neural implant technology has gained recognition, winning a bronze excellence award at the Canada-Wide Science Fair in 2023 for his project \"Enerspike.\" This algorithm dramatically improves battery life in neural implants by optimizing power usage, potentially extending battery lifespan by up to 70 times and eliminating the need for surgical replacement every few years. The project was inspired by both Elon Musk's Neuralink and Stephen Hawking's vision of brain-computer interfaces as the future of communication.\n\nBeyond his formal roles, Anush is passionate about DIY semiconductor fabrication, having received an Emergent Ventures Fellowship grant to build a maskless photolithography stepper for Hacker Fab at UBC. His team was also a finalist at Hack The North 2022 with the project \"ConnexSci,\" which used Graph Neural Networks to optimize drug discovery.\n\nAnush represents a new generation of interdisciplinary researchers working at the convergence of neuroscience, electrical engineering, and artificial intelligence, with a particular focus on developing energy-efficient, brain-inspired computing systems and their applications in healthcare and robotics."
}