{
    "id": "armaangupt",
    "name": "Armaan Gupta",
    "profile_pic": "https://media.licdn.com/dms/image/v2/D4E03AQEbNPdqhQJsmg/profile-displayphoto-shrink_200_200/profile-displayphoto-shrink_200_200/0/1727674102340?e=2147483647&v=beta&t=F6sVTkS-DDwaChDVPeUalTERJh84gkr9k3-rOdSsoT4",
    "links": [
        "https://www.linkedin.com/in/armaangupt"
    ],
    "short_description": "Armaan Gupta is an AI student at the University of Pennsylvania with a strong background in robotics and entrepreneurship. He has developed advanced motion control systems for robotics competitions, interned at Ghost Robotics, and founded multiple ventures including Little Mentors, a 501(c)(3) organization that has hosted conversations with industry leaders like Mark Cuban.",
    "long_description": "Armaan Gupta is a freshman studying Artificial Intelligence at the University of Pennsylvania, where he's already making his mark as a member of Penn Electric Racing. His technical expertise is particularly strong in robotics and control systems, demonstrated through his work with Cherry Hill High School East Robotics where he helped the team rank in the top 25 out of 10,000 teams globally. There, he developed a C++ library for trajectory generation using Quintic Beziér Splines and non-linear feedback (RAMSETE) for optimized robotic motion control.\n\nArmaan's professional experience includes an internship at Ghost Robotics in Philadelphia, where he analyzed control systems and gait mechanics to enhance robot stability, efficiency, and agility in dynamic environments. He collaborated with engineers to refine robotic locomotion algorithms and gained hands-on experience with advanced robotics technologies.\n\nBeyond his technical pursuits, Armaan has shown remarkable entrepreneurial initiative. As President and Co-Founder of Little Mentors, a 501(c)(3) organization, he directed \"Teddy Talks\" featuring notable guests like Mark Cuban, Anne Wojcicki, and Amanda Zuckerman, focusing on inspiring and educating youth through constructive discourse. He also founded Apollo, a platform for youth entrepreneurship, where he led a team of 5 developers and implemented SwiftUI and Firebase technologies. His work on Apollo culminated in winning the Congressional App Challenge for 2023.\n\nAt Penn, Armaan is actively engaged in the university's vibrant AI and computational research community. The University of Pennsylvania hosts several prestigious research centers including the Computational Social Science Lab and the ASSET (Artificial Intelligence, Safety, and Societal Engagement and Trust) center, which bring together faculty and students from various disciplines to advance AI research and applications. While not directly affiliated with these specific research groups based on the available information, Armaan is positioned to benefit from Penn's rich ecosystem of AI research and innovation as he continues his studies.\n\nArmaan graduated from Cherry Hill High School East in 2024 before beginning his studies at Penn. His combination of technical skills in AI and robotics, coupled with his entrepreneurial experience and leadership abilities, positions him as a promising innovator at the intersection of artificial intelligence and practical applications."
}