{
    "id": "ben-n-cullen",
    "name": "Ben Cullen",
    "profile_pic": "https://media.licdn.com/dms/image/v2/C5603AQGA5gfwqyhRrQ/profile-displayphoto-shrink_200_200/profile-displayphoto-shrink_200_200/0/1643682348888?e=2147483647&v=beta&t=6T28F4ttZo4w4o-NKN5R32mkqvHeTp00yo3e7p4aETs",
    "links": [
        "https://github.com/bencullenn",
        "https://www.instagram.com/the_bakeking",
        "https://www.facebook.com/TheBakeking",
        "https://www.tiktok.com/@thebakeking",
        "https://www.youtube.com/channel/UC3pGl-grkrg5rOBOpb7kJDg"
    ],
    "short_description": "Full stack engineer with expertise in AI/ML, currently working as an ML Engineer Intern at Spot Parking. Ben combines technical skills in machine learning, computer vision, and software development with business strategy acumen, having published research at AAAI and contributed to multiple startups. He is also known as \"The Bake King,\" a renowned cake artist who creates hyper-realistic edible sculptures.",
    "long_description": "Ben Cullen is a versatile full stack engineer with specialized expertise in AI/ML, currently serving as an ML Engineer Intern at Spot Parking where he's working on freeing up parking spaces through machine learning applications. He's pursuing a Computer Science degree with a Data Science emphasis at Brigham Young University, complemented by a minor in Business Strategy.\n\nBen's professional journey showcases a remarkable breadth of experience across AI and software development. At nCino, he developed features for their AI Assistant to enhance banker efficiency. His work at NEXU involved creating I.A.N., an AI phone platform that reduced referral verification time by 80%. As a Computer Vision Software Engineer at BYU, he achieved 99% accuracy in document layout analysis using image transformers, processing documents 64x faster and generating significant cost savings.\n\nHis technical versatility extends to full stack development, demonstrated through his work at ChoiceGuard Insurance Services where he built a HIPAA-compliant onboarding platform, and at Calisto Inc as a Founding Software Engineer, taking the company from zero software to a pilot with a major pest control company in just 5 months.\n\nBen's academic achievements are equally impressive, maintaining a 3.98 GPA and making the Dean's List four times. He co-authored a research paper published at the prestigious AAAI Conference on enhancing story comprehension for large language models through dynamic document-based knowledge graphs, which improved the quality of AI-generated text by up to 1.9x.\n\nBeyond his tech career, Ben has an entirely separate professional identity as \"The Bake King,\" one of the UK's most celebrated cake artists. He began his artistic journey as a graphic designer after studying Art & Design at Chester University, then worked as a tattoo artist before discovering his passion for creating hyper-realistic cakes. His transition to cake art began in 2014 when he made his first cake for his father, inspired by a design shown to him by a tattoo client's mother.\n\nAs The Bake King, Ben has won multiple gold awards at Cake International in 2015, 2016, 2017, 2018, and 2019, and was named one of the UK's Top 10 Cake Artists at Cakemasters in 2019. His extraordinary talent for creating life-like edible sculptures has earned him celebrity clients like Rita Ora, appearances on Channel 4's \"Extreme Cake Makers,\" and hundreds of thousands of followers across social media platforms. His work is particularly notable for making objects so realistic that they're often indistinguishable from the real items they represent.\n\nThroughout both of his careers, Ben has demonstrated an exceptional ability to bridge technical innovation with artistic creativity and practical business applications, making him a uniquely versatile professional who excels in both technology and artistic fields."
}