{
    "id": "chunjin-william-gao",
    "name": "William Gao",
    "profile_pic": "https://static.licdn.com/aero-v1/sc/h/9c8pery4andzj6ohjkjp54ma2",
    "links": [
        "https://github.com/Barneybean",
        "https://www.linkedin.com/in/chunjin-william-gao",
        "https://www.societyforscience.org/regeneron-sts/2024-student-finalists/"
    ],
    "short_description": "Data Analyst at TikTok with expertise in AI and medical technology research. William combines his accounting background with advanced data science skills, having earned multiple technical certifications and recognition for his innovative work in AI-driven diagnostic systems for breast cancer detection.",
    "long_description": "William Gao is a multifaceted professional currently working as a Data Analyst at TikTok, with an educational background from the University of California, Davis. He has developed a unique skill set that bridges accounting and data science, holding a CPA certification from the Washington State Board of Accountancy alongside numerous technical credentials.\n\nWilliam has built expertise in data analysis tools and programming languages, demonstrated by his impressive collection of certifications including AWS Certified Cloud Practitioner, Tableau Desktop Certified Associate, and various programming credentials in Java, Python, SQL, and data structures. His technical portfolio showcases his versatility across data visualization, cloud computing, and programming.\n\nBeyond his professional work at TikTok, William has made significant contributions to scientific research. He developed an AI-driven diagnostic support and image analysis tool for metastatic breast cancer detection, which was recognized in the Regeneron Science Talent Search. His innovative system uses federated learning to analyze patient images without compromising privacy, making it particularly valuable for regions with limited access to skilled pathologists. This groundbreaking work was published in Cancer Informatics, where William served as first author.\n\nDuring his time at Harvard University, William was affiliated with the Department of Molecular and Cell Biology, where he contributed to research on RNA structures. He was part of the Rivas Lab as an undergraduate researcher before pursuing MD/PhD studies at the University of Pennsylvania. His academic pursuits included work on Beta vulgaris mitovirus 1, demonstrating his versatility across different scientific domains.\n\nWilliam's professional approach is characterized by colleagues as elevating team performance. One recommendation notes that William \"is one of those truly exceptional people that take your own abilities to another level by working with him,\" highlighting his mentorship abilities and technical coding skills. Another colleague praised his \"rare mix of productivity, ambitions, and intellect\" along with his unique and effective management style that fostered collaboration.\n\nBeyond his academic and professional achievements, William is passionate about educational equity, having joined local board of education policy advisory committees to advocate for removing institutional barriers for underserved students. He is also a nationally ranked fencer who volunteers as an assistant youth coach. As a bilingual professional with fluency in English, Chinese, and Fuzhou Dialect, William brings a multicultural perspective to his work in data science, healthcare technology, and community service."
}