{
    "id": "cterdam",
    "name": "Liangze Li",
    "profile_pic": "https://media.licdn.com/dms/image/v2/D5603AQFniucXAPif2w/profile-displayphoto-shrink_200_200/profile-displayphoto-shrink_200_200/0/1724899314595?e=2147483647&v=beta&t=dMnEw9T_BPNCv1xHcRO4nriwbfaN1y2iECgJH2j9E58",
    "links": [
        "https://uk.linkedin.com/company/googledeepmind",
        "https://www.linkedin.com/school/cmuscs/",
        "https://www.cs.cmu.edu/~leili/",
        "https://scholar.google.com/citations?user=Vt1yhosAAAAJ",
        "https://www.linkedin.com/in/liangzel/"
    ],
    "short_description": "Liangze Li is an AI researcher at Google DeepMind with a background from Carnegie Mellon University's School of Computer Science. His research focuses on natural language processing and AI detection, with publications on distinguishing human from AI-generated content. He has demonstrated leadership through founding multiple organizations at CMU and is multilingual with proficiency in Mandarin, English, Cantonese, and Russian.",
    "long_description": "Liangze Li is an AI researcher currently working at Google DeepMind, one of the world's leading artificial intelligence research labs. He joined DeepMind in 2024 after completing his education at Carnegie Mellon University's School of Computer Science, where he earned his Master's degree in Language Technologies. His academic journey at CMU began in 2017 as an undergraduate student before continuing with graduate studies from 2022 to 2024.\n\nLiangze's research focuses primarily on natural language processing and AI detection systems. He has published several notable papers in this field, including \"GPT-Sentinel: Distinguishing Human and ChatGPT Generated Content\" and \"Token Prediction as Implicit Classification to Identify LLM-Generated Text,\" both published in 2023. These works have received significant attention in the academic community, with his GPT-Sentinel paper garnering over 70 citations. He has also contributed to research on referential games in NLP with his paper \"Listener Model for the PhotoBook Referential Game with CLIPScores as Implicit Reference Chain.\"\n\nDuring his time at Carnegie Mellon, Liangze demonstrated exceptional leadership and initiative by founding and presiding over several organizations. He was the Founder and President of the CMU Blackjack Society, as well as the Founder and Lecturer of the Carnegie Mellon University Student College. He also served as President of the Student College Executive Committee and as a Representative in the Graduate Student Assembly.\n\nBefore focusing on AI and natural language processing, Liangze had research interests in cryptography, with several publications between 2012-2014 on topics such as pairing computation on Edwards curves and Jacobi quartic curves with high-degree twists. This demonstrates his versatility and depth of knowledge across different areas of computer science.\n\nBeyond his academic and professional pursuits, Liangze has diverse interests in music, having played Alto Saxophone in both the Carnegie Mellon University Kiltie Band and the Pinghe Chamber Orchestra. His intellectual curiosity extends to philosophy as well, as evidenced by his founding of the Pinghe School Philosophy Club and his connection to CMU's Department of Philosophy.\n\nLiangze is impressively multilingual, with native or bilingual proficiency in both Mandarin and English, full professional proficiency in Cantonese, and limited working proficiency in Russian. This linguistic versatility enhances his ability to collaborate in international research settings.\n\nIn his own words, Liangze describes himself as being \"involved in AI research and startups,\" indicating his dual interests in both the theoretical advancement of AI and its practical applications in entrepreneurial contexts. His engagement with posts related to machine learning, AI development, and technology startups on LinkedIn further reflects his professional focus and interests in the field of artificial intelligence."
}