{
    "id": "d-gautam",
    "name": "Dhruv Gautam",
    "profile_pic": "https://media.licdn.com/dms/image/v2/D5603AQHMMEKvDU1JPg/profile-displayphoto-shrink_200_200/profile-displayphoto-shrink_200_200/0/1682291633129?e=2147483647&v=beta&t=2Xe1Y2PLeOWA96vsYsPAF4Na5Q_gsDvQZzL4JS9-Z5Q",
    "links": [
        "https://dhruvji.github.io",
        "https://scholar.google.com/citations?user=UzDpwXwAAAAJ&hl=en",
        "https://twitter.com/dhrvji",
        "https://github.com/dhruvji"
    ],
    "short_description": "Dhruv Gautam is a Computer Science student at UC Berkeley specializing in AI research with a focus on interpretability, safety, reinforcement learning, and code generation. Currently a researcher at Berkeley Artificial Intelligence Research (BAIR) and a former research intern at Microsoft, he combines academic excellence with practical experience in developing advanced AI systems.",
    "long_description": "Dhruv Gautam is a Computer Science undergraduate at UC Berkeley (2022-2025) who has established himself as a promising researcher in the field of artificial intelligence. His research interests center on neural network interpretability, reinforcement learning, code generation, and AI safety - areas critical to the responsible development of advanced AI systems.\n\nCurrently, Dhruv works as a researcher at Berkeley Artificial Intelligence Research (BAIR), focusing on interpretability and safety challenges in AI systems. He previously completed a research internship at Microsoft Research, where he worked on post-training techniques, code generation, and agents, contributing to research that is being presented at prestigious conferences including ICLR 2025 and NeurIPS 2024.\n\nHis research publications include \"RefactorBench: Evaluating Stateful Reasoning In Language Agents Through Code\" (ICLR 2025, OWA @ NeurIPS 2024), where he was a lead author alongside collaborators from Microsoft. He's also working on papers currently under review, including \"WebGauntlet: Measuring Instruction Following and Robustness for Web Agents\" and \"SSEAL: Self-Supervised Explorative Agent Learning,\" the latter of which won 1st Place in the UC Berkeley LLM Agents Hackathon.\n\nBefore joining BAIR, Dhruv worked at Berkeley's SkyLab on consensus and distributed systems research. He has also contributed to academic life at Berkeley as a Course Staff member for CS70 in the Electrical Engineering & Computer Sciences department.\n\nBeyond his formal research roles, Dhruv is actively involved in student organizations. He works on creative ML projects with Launchpad at UC Berkeley and explores cryptography with Blockchain at Berkeley. He has also volunteered with the Berkeley Math Tournament.\n\nDhruv's academic excellence is highlighted by multiple achievements, including four-time qualification for the American Invitational Mathematics Examination (AIME), the ASDRP Award for Excellence in Research, and The Leadership Award from the Cal Alumni Association.\n\nMultilingual and multifaceted, Dhruv is fluent in English and Hindi with professional working proficiency in Spanish, reflecting his global perspective and communication skills that complement his technical expertise in AI research.\n\nFor professional inquiries, he can be reached at dhruvgautam@berkeley.edu."
}