{
    "id": "david-bai",
    "name": "David Bai",
    "profile_pic": "https://media.licdn.com/dms/image/v2/D5603AQGo5S4m9--2yA/profile-displayphoto-shrink_200_200/profile-displayphoto-shrink_200_200/0/1670384000084?e=2147483647&v=beta&t=Kb0zpokA9GZizAQdbKyDozEk_Nz-bdKPJgvaBn3wpAg",
    "links": [
        "https://www.jargonlearn.com",
        "https://www.linkedin.com/in/david-bai",
        "https://github.com/dav1dbai"
    ],
    "short_description": "David Bai is a Computer Engineering & Computer Science student at USC with diverse research experience in AI alignment, multi-agent robotic planning, and reinforcement learning for legged robots. As a co-founder of Jargon, he's developing language learning tools while also working on innovative projects like brain-controlled drones and GPS-denied navigation systems.",
    "long_description": "David Bai is a Computer Engineering & Computer Science student at the University of Southern California (2023-2027), where he serves as a USC Presidential Scholar. His academic journey is marked by a deep commitment to artificial intelligence research across multiple domains.\n\nCurrently, David is a Research Fellow at the Supervised Program for Alignment Research, where he investigates reasoning and AI agents from capabilities and security perspectives. Simultaneously, he works as a Research Assistant at USC Viterbi School of Engineering's GLAMOR Lab through the CURVE Fellowship, focusing on multi-agent robotic planning at the intersection of LLMs and symbolic planners.\n\nDavid's entrepreneurial spirit is evident in his co-founding of Jargon, where he's building a language learning Chrome extension. His technical versatility extends to his work with USC Makers, where he manages projects involving brain-controlled drones using electroencephalography, having previously contributed to an autonomous greenhouse with computer vision.\n\nHis professional experience includes a Machine Learning & Computer Vision Internship at Rhoman Aerospace, enabling GPS-denied navigation through VIO and building simulation/SLAM pipelines. David has also served as a Research Assistant at the Dynamic Robotics and Control Laboratory, where he augmented model predictive control for legged robots with reinforcement learning.\n\nIn the academic community, David is active with USC's Center for AI in Society's Student Branch (CAIS++), where he contributes to research and projects in artificial intelligence with social impact applications. He is part of the Fall 2024 cohort, demonstrating his commitment to applying AI for societal benefit.\n\nDavid is also involved with the USC Computational Aerospace Lab, where he works on projects related to BCD (Binary Collision Detection), showcasing his interdisciplinary approach to engineering challenges. This involvement highlights his ability to apply computational methods to aerospace applications.\n\nPrior to USC, David demonstrated academic excellence at Cambridge University, where he compiled comprehensive lecture notes across various mathematical disciplines, indicating his strong foundation in theoretical concepts that underpin his current technical work.\n\nDavid's commitment to social impact is demonstrated through his volunteer work with the Cheyenne River Youth Project and Friends of Children with Special Needs, where he developed educational courses. His multidisciplinary approach to AI research, combined with his technical skills and social consciousness, positions him as a promising innovator in the field of artificial intelligence."
}