{
    "id": "dhruvdiddi",
    "name": "Dhruv Diddi",
    "profile_pic": "https://media.licdn.com/dms/image/v2/D5603AQG32xXTruCu5w/profile-displayphoto-shrink_200_200/profile-displayphoto-shrink_200_200/0/1729802131992?e=2147483647&v=beta&t=_0GKft9JcQDVrsd0gkbAZ5C7puo7eo5tyDivms-Z_XQ",
    "links": [
        "https://getsolo.tech/",
        "http://www.ddiddi.me/projects/portfolio/kaggle-titanic-challenge/",
        "http://www.ddiddi.me/projects/ivo",
        "http://www.ddiddi.me/projects/rise-for-nepal",
        "http://www.ddiddi.me/projects/flare",
        "http://www.ddiddi.me/projects/anthem",
        "http://www.ddiddi.me/projects/dwolla",
        "https://getsolotech.substack.com"
    ],
    "short_description": "Dhruv Diddi is the founder of Solo, a revolutionary platform bringing on-device AI solutions with a focus on privacy and accessibility. Based in the San Francisco Bay Area, he specializes in Applied Machine Learning and has experience as an instructor at General Assembly. A graduate of the University of Illinois Urbana-Champaign, Dhruv combines technical expertise with entrepreneurial vision, particularly in healthcare AI applications.",
    "long_description": "Dhruv Diddi is an engineer and entrepreneur based in the San Francisco Bay Area with specialized experience in Applied Machine Learning. He is the founder of Solo, a revolutionary platform that brings AI directly to users' devices, ensuring data privacy, personalized experiences, and accessibility without reliance on cloud infrastructure. Solo has particularly focused on healthcare applications, addressing challenges around data privacy (HIPAA compliance), accessibility in low-connectivity environments, and customization for specific healthcare scenarios.\n\nDhruv actively promotes Solo through his newsletter \"Get Solo Tech\" on Substack, where he discusses innovations like Solo Health, which aims to transform patient care through on-device AI that protects sensitive patient data while providing robust performance for diagnostics, patient monitoring, and workflow optimization.\n\nAs a tech community participant, Dhruv has been featured as a speaker and host at San Francisco tech events, including a panel discussion on \"AI + Human Intelligence\" where he presented Solo alongside other founders. He's also participated in hackathons, with his profile showing attendance at AI hackathon events.\n\nDhruv brings a strong educational foundation from the University of Illinois Urbana-Champaign where he was recognized as a James Scholar and made the Dean's List. His technical expertise spans multiple domains, including Machine Learning, Algorithms, Computer Architecture (Honors), Data Structures (Honors), Interactive Computer Graphics, and R Programming. His multilingual abilities include native proficiency in English, Hindi, and Punjabi, along with working knowledge of French and Mandarin Chinese.\n\nAs an educator, Dhruv has received glowing recommendations for his work as an instructor at General Assembly's boot camp program. Former students praise his patience, extensive knowledge, and ability to break down complex concepts in accessible ways. His teaching style is described as easy-going yet effective, making him a favorite resource for students struggling with difficult concepts.\n\nDhruv maintains an active presence in the AI and tech community, regularly publishing his newsletter \"So Essentially Weekly\" that covers developments in the field. His project portfolio demonstrates versatility and practical application of his skills, including work with Illini Hyperloop, a Kaggle Challenge on Titanic Prediction, and various web and mobile applications like Flare, Anthem Web App, and a Dwolla Pebble App.\n\nDhruv's professional focus appears to be at the intersection of privacy-first AI applications and healthcare innovation, with an emphasis on bringing powerful machine learning capabilities directly to devices while protecting user data and ensuring accessibility regardless of internet connectivity."
}