{
    "id": "dylan-nguyenn",
    "name": "Dylan Nguyen",
    "profile_pic": "https://media.licdn.com/dms/image/v2/D4E03AQH8DI05LKFVKQ/profile-displayphoto-shrink_200_200/profile-displayphoto-shrink_200_200/0/1688671690268?e=2147483647&v=beta&t=wP3yz7whq8xRJo9rZTrfsWglKvqD8xVQbQUJNRSewok",
    "links": [
        "https://github.com/SpotDylan/TFNeuronClassification",
        "https://github.com/SpotDylan/SocialMediaTradeBotV1",
        "https://www.linkedin.com/in/dylan-nguyen-098b2b236/"
    ],
    "short_description": "MIT '28 undergraduate researcher integrating control systems and Bayesian optimization for mRNA lipid nanoparticle manufacturing. Amazon Future Engineer Scholar with extensive experience in computational biology, neuroscience, and machine learning applications, having won multiple prestigious awards including 3rd Place at the International Science & Engineering Fair.",
    "long_description": "Dylan Nguyen is a first-year undergraduate student at MIT (Class of 2028) with a remarkable background in computational biology, neuroscience, and AI research. Currently working as an Undergraduate Research Assistant at MIT Chemical Engineering, he's integrating control systems and Bayesian optimization for manufacturing mRNA lipid nanoparticles in the Myerson Research Group.\n\nDylan's research experience is impressive for his age. He has worked as a Scientific Programming Intern at the Max Planck Florida Institute for Neuroscience and has completed several significant research projects, including modeling the Drosophila Melanogaster nerve cord using spiking neural networks, applying deep learning to predict cytokines in Sickle Cell Anemia patients, and exploring machine learning for morphological neuron classification in the neocortex.\n\nHis academic achievements are equally notable. Dylan is an Amazon Future Engineer Scholarship recipient, which provides $40,000 towards college tuition and a guaranteed paid internship at Amazon. He's also a Kovner Opportunity Scholarship recipient, supporting talented public high school students to attend selective universities.\n\nIn competitive programming, Dylan has reached the Gold Division in the USA Computing Olympiad (USACO). His scientific research has earned him prestigious recognitions, including 3rd Place Grand Award in Biomedical and Health Sciences at the 2023 Regeneron International Science and Engineering Fair, the Regeneron Biomedical Science Award, and finalist status at the National Junior Science and Humanities Symposium.\n\nCurrently, Dylan is also an AMP Scholar at Jane Street, where he's learning mathematics, computer programming, data analysis, and game theory. Previously, he participated in MIT's Introduction to Technology, Engineering, and Science (MITES) program, taking classes in Science Writing Communications and Regenerative Stem Cell Biology.\n\nBeyond his academic pursuits, Dylan has ventured into entrepreneurship as a co-founder of Tally.AI, a startup that empowers researchers with AI-driven aggregation and analysis of scientific papers. Working alongside fellow MIT students and graduate students from other prestigious institutions, Tally.AI aims to prevent duplicative research efforts, enhance collaboration between research groups, and help researchers stay up-to-date with the latest works in their fields through features like similarity scoring, knowledge graphs, and real-time alerts.\n\nDylan's diverse projects demonstrate his versatility in applying computational methods across different domains, from neuroscience to financial trading, showcasing his ability to leverage AI and machine learning for solving complex problems in both research and entrepreneurial contexts."
}