{
    "id": "dylan-allen",
    "name": "Dylan B Allen",
    "profile_pic": "https://static.licdn.com/aero-v1/sc/h/9c8pery4andzj6ohjkjp54ma2",
    "links": [
        "https://www.linkedin.com/company/cheers-software",
        "https://www.linkedin.com/school/y-combinator",
        "https://cheers.tech",
        "https://www.ycombinator.com/launches/LbZ-cheers-the-super-app-for-in-person-employees"
    ],
    "short_description": "CEO & Co-Founder of Cheers (YC S24), a frontline experience management platform that transforms in-person business interactions using NFC technology. Dylan has a background in product management and software engineering, with experience at Microsoft Azure and Utah-based B2B tech companies.",
    "long_description": "Dylan B Allen is the CEO and Co-Founder of Cheers, a startup that was accepted into Y Combinator's Summer 2024 batch (YC S24). Founded in 2024 and based in San Francisco (after relocating from Utah), Cheers is building the first Frontline Experience Management platform that transforms in-person service interactions through NFC-enabled employee badges.\n\nCheers' technology unifies onsite payments, digital tips, real-time reviews, and new-customer referrals in one frictionless flow, helping companies increase their online 5-star ratings, reduce churn, and drive more revenue. The platform is particularly valuable for businesses in home services, field sales, healthcare, and other industries where employees work primarily outside a specific place of business.\n\nUnder Dylan's leadership, Cheers has shown impressive early traction, growing from approximately $1,400 MRR in July 2024 to around $4,000 shortly after, with 25 customers including small businesses and one enterprise-level client. The company has processed over 3,000 reviews for customers, with the average client seeing a 5-10x increase in monthly 5-star Google Reviews.\n\nPrior to founding Cheers, Dylan interned at Microsoft Azure and worked at other Utah-based B2B tech companies as a product manager and software engineer. His technical background in frontend engineering has been praised by colleagues, with Adnan Chowdhury describing him as a \"well-rounded engineer who also has product management\" experience and commending his \"can-do attitude and eagerness to learn to solve complex problems.\"\n\nDylan graduated from Brigham Young University (BYU) with a degree in computer science and was named to the Marriott School Dean's List in April 2021. During his academic career, he placed in the top 20 of the Student Innovator of the Year competition in Utah, where he pitched his startup idea to a panel of tech investors.\n\nOriginally from Dallas, Texas, Dylan is multilingual with professional working proficiency in Spanish, elementary proficiency in Swedish, and native proficiency in English. He earned the Eagle Scout rank from the Boy Scouts of America in 2016, demonstrating his leadership abilities and commitment to community service from an early age.\n\nDylan's entrepreneurial journey reflects his persistence and dedication, as he himself noted that \"seriously crazy that if you're persistent, things work out.\" His combination of technical skills, entrepreneurial drive, and leadership qualities position him as a promising founder in the startup ecosystem."
}