{
    "id": "fengrui-zuo-92243b179",
    "name": "Fengrui Zuo",
    "profile_pic": "https://media.licdn.com/dms/image/v2/D5603AQEou-Ihv3LQug/profile-displayphoto-shrink_200_200/B56ZSWtQhrGoAg-/0/1737695234895?e=2147483647&v=beta&t=I2_6gj6H8L_jpPLi1d_QljI88J0e6_X4oWHdomcSuD8",
    "links": [
        "https://www.linkedin.com/in/fengrui-zuo-92243b179",
        "https://profiles.stanford.edu/fengrui-zuo"
    ],
    "short_description": "Fengrui Zuo is a hardware specialist focusing on Analog, RF, High Speed Design, and Edge AI at SLAC National Accelerator Laboratory. With a Master's degree in Electrical Engineering from Stanford University, he brings specialized expertise in hardware acceleration for AI applications and serves as an Analog Design Co-Lead and Industry Outreach Officer at Open Source Silicon @ Stanford.",
    "long_description": "Fengrui Zuo is a hardware engineer specializing in Analog, RF, High Speed Design, and Edge AI at SLAC National Accelerator Laboratory, which is operated by Stanford University. He currently holds dual positions as a Staff Engineer at SLAC and is pursuing his Master's degree in Electrical Engineering (MSEE) at Stanford University, which he began in Autumn 2023.\n\nFengrui has established himself as a leader in the open-source silicon community at Stanford, where he serves in multiple leadership roles. He is the Industry Outreach Officer for Open Source Silicon @ Stanford (OS3), helping to bridge academic research with industry applications. Additionally, he co-leads the Analog Design Subteam at OS3, where he focuses on designing and verifying analog components such as amplifiers, voltage references, and Power Management ICs (PMICs). His work involves device simulations, schematic generation and routing using both open-source and proprietary software, and conducting bench testing and verification.\n\nHis technical expertise spans across several domains including CUDA kernel optimization, autonomous systems, and chip design. Fengrui demonstrates particular interest in cutting-edge hardware developments such as NVIDIA's Jetson Orin Nano platform for edge AI applications, open-source chip design, and specialized motherboards with timing synchronization capabilities. His work at SLAC National Accelerator Laboratory likely involves specialized hardware systems for scientific research and experimentation, integrating AI capabilities into high-performance computing environments for physics research.\n\nFengrui's professional address is at SLAC National Accelerator Laboratory, located at 2575 Sand Hill Rd, Menlo Park, California. His dual role as both a graduate student and staff engineer positions him uniquely at the intersection of academic research and practical engineering applications, particularly in the field of analog design for advanced computing systems."
}