{
    "id": "htfan",
    "name": "Alex Fan",
    "profile_pic": "https://media.licdn.com/dms/image/v2/D4E03AQE4T-2Dko6RAg/profile-displayphoto-shrink_200_200/profile-displayphoto-shrink_200_200/0/1695314259263?e=2147483647&v=beta&t=IgEGNwDRv-Ez-CRexnJRbCbHlGgUVDvdV5CkpGAjwgo",
    "links": [
        "https://codetiger.me"
    ],
    "short_description": "Alex Fan is a talented undergraduate at MIT studying Mathematics and Computer Science with a focus on AI research. A USACO Finalist in 2021 and 2022, he's currently working as a Research Engineer at Pika, tackling challenges in generative video and image models.",
    "long_description": "Alex Fan is a promising talent in the AI field, currently pursuing a Bachelor's degree in Mathematics and Computer Science at the Massachusetts Institute of Technology (2023-2026). His academic journey includes rigorous coursework in graduate-level Machine Learning, Advanced Algorithms, Advances in Computer Vision, and Computational Cognitive Science, demonstrating his commitment to mastering both the theoretical foundations and cutting-edge applications of AI.\n\nAlex's technical prowess was evident early on, as he was a USACO (USA Computing Olympiad) Finalist in both 2021 and 2022 during his time at Lexington High School. This competitive programming background has provided him with strong algorithmic thinking skills that complement his AI research interests.\n\nCurrently, Alex is working as a Research Engineer at Pika, where he focuses on solving engineering and research challenges related to generative video/image models and data curation. This practical experience in the rapidly evolving field of generative AI is giving him hands-on exposure to state-of-the-art techniques and real-world applications.\n\nDuring his time at MIT, Alex has been involved in various research projects. In 2022, he participated in the PRIMES program where he collaborated on research leveraging statistical distributions for RNA sequencing across time, working with Prof. Gil Alterovitz. This experience demonstrates his interest in applying computational methods to biological data.\n\nBeyond his academic and professional pursuits, Alex is an active member of the MIT community. He lives in La Maison Française (MIT French House) where he embraces French culture and language. He's also involved in the performing arts, having performed in the MIT Musical Theatre Guild's Cabaret Night in Fall 2023 and cast as John Hinckley Jr. in their production of \"Assassins\" for Fall 2024.\n\nAlex has diverse personal interests including cooking, baking, fermentation, Broadway musicals, and playing piano. He describes himself as a francophile who dreams of returning to Parisian cafes. In his spare time, he enjoys working on programming projects and writing blog posts, showcasing his passion for both technical and creative pursuits.\n\nHis engagement with the AI community is evident through his LinkedIn activity, where he follows developments in AI research, particularly in generative models and applications in various domains. Alex represents the next generation of AI researchers and engineers who are combining strong mathematical foundations with practical implementation skills to push the boundaries of what's possible in artificial intelligence."
}