{
    "id": "ianclim",
    "name": "Ian Lim",
    "profile_pic": "https://static.licdn.com/aero-v1/sc/h/9c8pery4andzj6ohjkjp54ma2",
    "links": [
        "https://ianlim.com/",
        "https://twitter.com/ianclim"
    ],
    "short_description": "Ian Lim is a Stanford University student studying computer science and neuroscience, currently working as a product intern at Tesla. He co-founded Stanford BCI and has been recognized as one of MinneInno's 25 Under 25 rising entrepreneurs and technologists in Minnesota.",
    "long_description": "Ian Lim is a talented Stanford University student studying computer science and neuroscience, currently working as a product intern at Tesla. His technical interests focus on brain-computer interfaces (BCI), as evidenced by his co-founding of Stanford BCI, an organization dedicated to advancing cutting-edge technology that connects neural activity with computing systems.\n\nIan has been involved with TreeHacks as an organizer, Stanford's premier hackathon that brings together students to collaborate on technological solutions to real-world problems. His entrepreneurial talent was recognized early when he was named to MinneInno's 25 Under 25 List in September 2018, highlighting him as one of Minnesota's most promising young entrepreneurs and technologists. He hails from Overland Park, Kansas, as indicated by his profile at the University of Kansas School of Engineering.\n\nDespite his relatively early career stage, Ian has already built a substantial professional network with over 500 connections and 3,000 followers on LinkedIn, suggesting his influence in tech and entrepreneurial circles. His activity on LinkedIn shows engagement with content related to AI in education, talent development, and leadership, indicating his broader interests in how technology can transform learning and organizational development.\n\nIt's worth noting that there are several other professionals named Ian Lim in different fields, including a Senior Lecturer at Monash University specializing in computer science and data science, and a character portrayed by actor James Chen in the TV series \"FBI\" as an intelligence analyst. Our Ian Lim maintains a personal website at ianlim.com and is active on Twitter under the handle @ianclim, where he likely shares insights about his work and interests in technology and entrepreneurship."
}