{
    "id": "jay-khemchandani",
    "name": "Jay Khemchandani",
    "profile_pic": "https://media.licdn.com/dms/image/v2/D4E03AQE6bZrMpkGkVQ/profile-displayphoto-shrink_200_200/profile-displayphoto-shrink_200_200/0/1683936907473?e=2147483647&v=beta&t=VqLDkl5zqi-7ARKdxJTSe35eOh1gsSzFFy54yRmE4Ic",
    "links": [
        "https://www.linkedin.com/in/jay-khemchandani",
        "https://github.com/Jaybear411",
        "https://x.com/jaykhem_",
        "https://devpost.com/software/baymax-your-personal-healthcare-companion"
    ],
    "short_description": "CS(AI) and Math student at Stanford University with a passion for building innovative AI solutions. Grand Prize Winner at TreeHacks 2024 and co-founder of Intratalent AI. Skilled in multiple programming languages and design tools, with research experience in genomics and computational biology.",
    "long_description": "Jay Khemchandani is a Computer Science (AI) and Mathematics student at Stanford University (2023-2027), who has already made significant strides in the AI and computational biology fields despite being early in his academic journey. As the co-founder of Intratalent AI based in Palo Alto, he's working on optimizing talent through AI solutions.\n\nJay has demonstrated his technical prowess by winning the Grand Prize at TreeHacks 2024, one of Stanford's premier hackathons. His award-winning project \"Baymax\" is a vision-powered robotic arm designed to assist individuals with physical impairments using advanced NLP and computer vision. His project portfolio also includes \"Mosaic - Wallpapers Inspired by You, Made by AI,\" which won funding from the 1517 fund at Stanford Startup Society, and \"Lucid,\" a full-stack AI design tool developed by fine-tuning the Flux AI model for commercial projects.\n\nBeyond his entrepreneurial ventures, Jay has been engaged in serious research since 2021. He serves as a student researcher at The Bianchi Lab, working remotely with the University of Miami's Miller School of Medicine, where he gained valuable insights into cognitive disorders and brain lesions. He also participated in The Summer Science Program in 2022, focusing on genomics and computational biology during the intensive three-month research experience.\n\nJay's technical skills are diverse, including proficiency in C++, Python, Java, MatLab, HTML/CSS/JavaScript, Fusion 360, and Adobe design tools (Photoshop and Illustrator). He's also involved in extracurricular activities at Stanford, including being a member of the JKA Shotokan Karate team.\n\nJay's academic background is equally impressive, having been the valedictorian at Windermere Preparatory School where he earned his IB Diploma before joining Stanford. His multidisciplinary approach combines technical AI expertise with empathy-driven design, as he consistently emphasizes creating technology that makes a positive impact on society.\n\nWith his combination of technical skills, research experience, and entrepreneurial drive, Jay represents the new generation of AI innovators working to apply computational approaches to solve complex real-world problems. He can be contacted at jaykhem@stanford.edu and is based in Palo Alto, California."
}