{
    "id": "joelgrayson",
    "name": "Joel Grayson",
    "profile_pic": "https://media.licdn.com/dms/image/v2/D4E03AQEK9VzNXESleg/profile-displayphoto-shrink_200_200/profile-displayphoto-shrink_200_200/0/1698342347676?e=2147483647&v=beta&t=8KMIieg5JmLvcQ8YIMYIaIm7Ityz7KcNk31XgCtFZvM",
    "links": [
        "https://joelgrayson.com",
        "mailto:joelgr@stanford.edu"
    ],
    "short_description": "Joel is a Stanford University student with a passion for software development, engineering, and climate solutions. He has created multiple successful applications including Buseroo.com and Focus for Google Docs, while also building physical projects like a vending machine and Jacob's ladder. His environmental work includes bringing solar installations to his high school and researching organic solar cells at NYU's Lee Research Lab.",
    "long_description": "Joel Grayson is a student at Stanford University (2024-2028) with a multifaceted background spanning software development, engineering, and climate activism. His software portfolio includes several successful applications: Buseroo.com, which helps students find appropriate school buses; Homework Checker, used by 2,000 students for assignment management; Focus for Google Docs, a productivity tool with 1,000 users; Edit Time, which helps 4,000 users manage file modification properties; and LirongArt.com, a showcase for his mother's artwork.\n\nBeyond software, Joel demonstrates strong engineering skills through physical projects including a functional vending machine, a Jacob's ladder alarm clock, a wooden pinball machine, and a slayer exciter. His technical interests extend to quantum computing, having earned a Professional Certificate from MIT xPRO in 2023.\n\nJoel is deeply committed to environmental causes. He spearheaded a solar installation project at Riverdale Country School that reduces carbon emissions by 250 metric tons annually while providing backup power and educational data. He founded Students for Electric Buses to promote sustainable transportation and conducted research on organic solar cells at NYU's Lee Research Lab. His civic engagement includes serving on Manhattan Community Board One's Environmental Protection Committee and Youth & Education Committee (May 2023-May 2024), where he worked on climate resiliency projects for Lower Manhattan. He also collaborated with the Mayor's Office of Climate and Environmental Justice to connect street vendors to the electrical grid as an alternative to gas generators.\n\nJoel's professional experience includes a research position at NYU Lee Lab (July-August 2023) and an internship at The Stone House Group (June 2023). He graduated from Riverdale Country School (2017-2024) before beginning his studies at Stanford. At Stanford, he is an undergraduate researcher in the Mai Lab in the Chemical Engineering department (Spring 2024-present), where he contributes to research on biopolymer engineering. He maintains a YouTube channel featuring father-and-son comedy, project records, and claymation. Joel is also an accomplished violinist, performing recitals and creating his own compositions.\n\nHis technical skills include full-stack web development (Next.js/React, TypeScript, SQL, Docker, Express, PHP, Node), app development (Swift, SwiftUI, Java, React Native, Supabase), and embedded systems (Arduino, Raspberry Pi, ESP32, Python, C++). Joel gave a TEDx talk on combating climate change in 2024 and is an En-ROADS Ambassador (climate educator) since 2022."
}