{
    "id": "jujipotle",
    "name": "Justin Ji",
    "profile_pic": "https://media.licdn.com/dms/image/v2/D5603AQEaQcg5edQO1A/profile-displayphoto-shrink_200_200/profile-displayphoto-shrink_200_200/0/1705532085977?e=2147483647&v=beta&t=6KihMpTvxKcfs1lMJq4AzEuzaVBmXWryo5_3WJgOsuM",
    "links": [
        "https://justinji.com",
        "https://www.linkedin.com/in/jujipotle",
        "https://github.com/jujipotle",
        "https://www.goodreads.com/jujipotle"
    ],
    "short_description": "Junior studying Computer Science at Harvard University with a focus on AI interpretability research. Justin is active in multiple campus organizations including Harvard Undergraduate Quantitative Traders and Book Club @ Harvard, which he founded. He balances academic pursuits with interests in volleyball, reading, and community leadership.",
    "long_description": "Justin Ji (also known as Juji) is a junior studying Computer Science at Harvard University (class of 2026). His academic focus has evolved toward AI interpretability research—understanding how AI models work internally to make them safer and more trustworthy for society. During his junior year, he collaborated with the Harvard Kempner Institute on a project investigating how language models adopt \"personas\" and designing interventions to influence them.\n\nJustin's technical background includes competitive programming and mathematics in high school, where he reached USACO Platinum level and qualified for AIME. At Harvard, he has pursued a rigorous computer science curriculum including graduate-level coursework in Deep Learning (MIT 6.S898), Sensorimotor Learning (MIT 6.8200), and Training Foundation Models (CS 2281R). He has also conducted supervised research (CS 91R) and participated in the Kempner REU summer research program focused on AI interpretability.\n\nBeyond his technical pursuits, Justin is deeply involved in campus life. He founded Book Club @ Harvard and serves on the board of Startups @ Harvard. He is also the Social Chair for Harvard Men's Club Volleyball, Director of Engagement for Harvard Undergraduate Quantitative Traders, and a member of several other organizations including the Harvard AI Safety Student Team, Harvard College Christian Students, and the Taiwanese Cultural Society.\n\nBefore Harvard, Justin served as the Whitney High School Middle School Branch and Online Director for Math Matters 4 All, demonstrating his early leadership abilities. His digital creativity was previously showcased through projects like his participation in the Chipotle + David Dobrik TikTok Contest in May 2020.\n\nJustin is an avid reader with diverse literary interests. His favorite books include \"The Three-Body Problem\" by Cixin Liu, \"The Book Thief\" by Markus Zusak, and \"All the Light We Cannot See\" by Anthony Doerr. He maintains an active Goodreads profile and encourages connections through his social media channels.\n\nIn his free time, Justin enjoys playing volleyball, reading, and eating at Chipotle. He welcomes connections via LinkedIn or email and is \"always happy to meet new people,\" reflecting his collaborative and community-oriented approach to both his academic and personal pursuits."
}