{
    "id": "lockecai",
    "name": "Locke Cai",
    "profile_pic": "https://media.licdn.com/dms/image/v2/D4E03AQEbfLifK1nnwg/profile-displayphoto-shrink_200_200/profile-displayphoto-shrink_200_200/0/1698543672573?e=2147483647&v=beta&t=VPQ-gR50V2tJVlHg5IoZ_usA-WhEFFjKROc1Z-dFMig",
    "links": [
        "https://arxiv.org/abs/2410.08394",
        "https://github.com/MITIBMxGraph/RevTrack"
    ],
    "short_description": "CS & Math student at MIT with exceptional algorithmic expertise as a 2x USACO Finalist and Codeforces Grandmaster. Currently researching reinforcement learning for LLMs and graph neural networks for blockchain anti-money laundering. Incoming ML Research Intern at Together.AI.",
    "long_description": "Locke Cai is a Computer Science and Mathematics student at MIT (2023-2026) with remarkable achievements in competitive programming and mathematics. As a two-time USA Computing Olympiad (USACO) Finalist (2021 & 2022), he was among the top 26 competitors invited to the national training camp, demonstrating mastery of advanced algorithms and data structures. His programming prowess is further evidenced by his Codeforces Grandmaster status, placing him in the top 0.8% of over 100,000 active participants globally.\n\nIn mathematics, Locke was selected for the Mathematical Olympiad Program (MOP) Blue Group in 2022, reserved for approximately the top 30 USA Math Olympiad competitors, showcasing his expertise in algebra, probability, geometry, advanced combinatorics, and abstract proof techniques.\n\nHis research experience spans multiple areas of machine learning and AI. Currently, he's working as an undergraduate researcher in Professor Pulkit Agrawal's Improbable AI Lab at MIT, focusing on reinforcement learning methods for Large Language Models. He's also made significant contributions to graph neural networks research, co-authoring \"Identifying Money Laundering Subgraphs on the Blockchain\" which was presented at the International Conference on AI in Finance (ICAIF) 2024. This work introduced RevTrack, a graph-based framework that enables large-scale anti-money laundering analysis with lower cost and higher accuracy.\n\nPreviously at Stony Brook University, Locke redesigned and optimized Argus, an end-to-end framework accelerating Convolutional Neural Networks on specialized hardware (FPGAs), with his work expected to be published in ICS 2024. He also has industry experience as a Research Engineering Intern at Anysphere, where he designed and built a production-ready context retrieval system for LLM prompt generation.\n\nBeyond his technical pursuits, Locke is a member of MIT's French House (La Maison Française) where he enjoys philosophical discussions. He's also involved with Traders@MIT, having taught an \"Introduction to Trading\" class during MIT's Splash program in 2023. In his free time, he enjoys playing piano and hopes to join MIT's Chamber Music Society.\n\nLocke's diverse skill set spans competitive programming, mathematical problem-solving, machine learning research, and practical engineering, positioning him as a rising talent in the fields of computer science and artificial intelligence."
}