{
    "id": "luke-tchang",
    "name": "Luke Tchang",
    "profile_pic": "https://media.licdn.com/dms/image/v2/D5603AQHXXeSA4vmEEQ/profile-displayphoto-shrink_200_200/profile-displayphoto-shrink_200_200/0/1689993405705?e=2147483647&v=beta&t=zwwydkgDzd5GTNASGubjM1Nh51gEmu1VsfSCgQyJwLk",
    "links": [
        "https://github.com/luketchang",
        "https://github.com/ltchang2019",
        "https://twitter.com/LukeTchang"
    ],
    "short_description": "Luke Tchang is a Neo Scholar and Co-Founder of Nocturne Labs, with extensive experience in blockchain and cryptocurrency development. He has worked as a Core Engineering Lead at Nomad and has previous experience at Meta and Facebook. His work focuses on blockchain technology, privacy solutions, and AI systems.",
    "long_description": "Luke Tchang is a talented technologist and entrepreneur with deep expertise in blockchain technology, cryptocurrency, and AI systems. He currently serves as the Co-Founder of Nocturne Labs, a company focused on developing protocol for onchain private accounts, while also being a Paradigm Fellow.\n\nHis professional experience spans several notable organizations in the tech and blockchain space. Luke has worked as a Core Engineering Lead at Nomad, where he contributed to Rust work for nomad actors. He also had brief stints as a Software Engineer at Meta and Facebook (June 2021 - September 2021), and spent 8 months at cLabs (January 2021 - October 2021). Additionally, he has been involved with Stealth R&D LLC since September 2022.\n\nLuke's GitHub profile (luketchang) showcases his technical prowess, with 69 repositories and contributions to significant projects in the blockchain and AI space. His pinned repositories include work on Nomad's Rust implementation, Nocturne's protocol for onchain private accounts, a distributed MapReduce implementation in Go, an efficient reranker for AI systems, and a re-implementation of GPT-2. His GitHub achievements indicate he's an active collaborator, with badges for pair programming and pull request contributions.\n\nHis interests span across multiple domains within blockchain technology, including DeFi, Ethereum, cryptocurrency, and financial services. Luke appears to be particularly focused on privacy solutions in the blockchain space, as evidenced by his work with Nocturne Labs on protocols for private onchain accounts.\n\nLuke is also connected to \"Catapult,\" described as \"an AI agent agency,\" suggesting his involvement in AI agent systems aligns with his previously noted interest in this area. With 67 followers on GitHub and connections to prominent blockchain organizations, Luke has established himself as a respected developer and entrepreneur in the blockchain and AI communities.\n\nAs a Neo Scholar, Luke continues to be recognized for his potential and contributions to the tech and blockchain ecosystem, bridging innovative technologies with practical applications in privacy, finance, and artificial intelligence."
}