{
    "id": "matthew-law-0x251",
    "name": "Matthew Law",
    "profile_pic": "https://media.licdn.com/dms/image/v2/D5603AQEH_PGSFl34zg/profile-displayphoto-shrink_200_200/B56ZUhis_4GUAg-/0/1740024500544?e=2147483647&v=beta&t=nqU84vPku0H9MsLz_PLDlMrLSR-7Pif_bqij4_gc0-g",
    "links": [
        "https://www.linkedin.com/in/matthew-law-0x251",
        "https://www.iammattlaw.com",
        "https://www.imdb.com/name/nm6678217/"
    ],
    "short_description": "Multifaceted talent working as a researcher at Stanford HAI, backend lead at a stealth AI startup, and accomplished filmmaker/actor with roles in Abbott Elementary, Ahsoka, and other productions. Award-winning hackathon champion bridging technology, neuroscience, and creative storytelling.",
    "long_description": "Matthew Law is a uniquely versatile professional who balances multiple successful careers across technology and entertainment. As a researcher at Stanford Institute for Human-Centered Artificial Intelligence (HAI), he applies his expertise in computational neuroscience to advance human-centered AI systems. His technical prowess is further demonstrated by his impressive record of winning 16 hackathons and his role as Backend Lead at a stealth AI startup in Palo Alto.\n\nParallel to his tech career, Matthew has established himself as an accomplished filmmaker, actor, and activist. Originally from Seattle, where he attended Ballard High School, he credits the film program there for giving him his foundation in filmmaking. He later studied at Temple University in Philadelphia, an experience that helped shape his creative vision.\n\nAs an actor, Matthew has secured notable roles in popular productions including ABC's \"Abbott Elementary\" (as O'Shon, the school district IT rep), Disney+'s \"Star Wars: Ahsoka\" (as Captain Porter), and Tyler Perry's \"The Oval\" (as Kareem Richardson). He's also appeared in Jennifer Lopez's \"This Is Me... Now\" and \"Can't Get Enough\" music video, as well as recurring roles in \"Based on a True Story\" on Peacock.\n\nBehind the camera, Matthew has written and directed multiple short films in his \"True Story\" series, which explores mental health issues through a noir therapy drama format. His short film \"True Story: God Tells Bad Jokes\" won the award for best short narrative at the 2023 Pan African Film & Arts Festival, qualifying it for Academy Awards consideration. He has also created immersive cinematic experiences combining film, live theater, and music that have sold out multiple shows in Los Angeles.\n\nMatthew's activity on LinkedIn reveals his engagement with various AI communities and events, including defense hackathons, agent-based AI systems, and vector databases. He frequently collaborates with other talented individuals in both the AI and entertainment spaces.\n\nAs a cousin of actress Tamala Jones, Matthew continues to build on his family's legacy in entertainment while forging his own unique path at the intersection of technology, neuroscience, and creative storytelling. His dual careers position him as an innovative voice bridging the worlds of artificial intelligence and human expression."
}