{
    "id": "maxtli",
    "name": "Max Li",
    "profile_pic": "https://media.licdn.com/dms/image/v2/C4D03AQGIXRXhkZ8nWw/profile-displayphoto-shrink_200_200/profile-displayphoto-shrink_200_200/0/1614220571012?e=2147483647&v=beta&t=ULBnVKDwcPLFsEuVUGkivnkZ8bR0Agor-Vjfsh5kKYI",
    "links": [
        "https://www.linkedin.com/in/maxtli"
    ],
    "short_description": "Max Li is a professional at Jane Street with a background from Harvard University. He has demonstrated exceptional skills in debate, reaching the Tournament of Champions Top 16 and excelling in economics competitions, placing 2nd at the Harvard Pre-Collegiate Economics Challenge.",
    "long_description": "Max Li is currently working at Jane Street, a quantitative trading firm known for hiring top talent in mathematics, computer science, and quantitative fields. He received his education from Harvard University, bringing strong academic credentials to his professional work.\n\nMax has a distinguished background in competitive debate, achieving impressive results including Tournament of Champions Top 16 (Gold Public Forum) in April 2020, International Public Policy Forum Top 16 in March 2020, and Harvard National Forensics Tournament Top 5 and #1 seed in February 2019. His debate accomplishments also include Princeton Classic Top 5 in December 2018 and Grand Nationals Top 16 in May 2018.\n\nBeyond debate, Max demonstrated strong aptitude in economics by placing 2nd individually at the Harvard Pre-Collegiate Economics Challenge in April 2019. His academic excellence is further evidenced by his recognition as a National Merit Scholar and National AP Scholar.\n\nMax's combination of quantitative skills, debate experience, and economics knowledge suggests he has strong analytical abilities and communication skills that would be valuable in AI development and implementation contexts. His background indicates he likely brings a unique perspective that combines technical expertise with the ability to articulate complex concepts effectively."
}