{
    "id": "mohammed-zeeshaan",
    "name": "Zeeshaan Mohammed",
    "profile_pic": "https://media.licdn.com/dms/image/v2/D5603AQEt-L5gz_7CYw/profile-displayphoto-shrink_200_200/profile-displayphoto-shrink_200_200/0/1710367629193?e=2147483647&v=beta&t=qDrAzNVyzCozsU-oejJ57jDPBSV3j4wSEb4peOCCank",
    "links": [
        "https://www.udemy.com/certificate/UC-1dc1e9d7-68a9-4669-90d2-7e375d6f73bb/",
        "https://udemy-certificate.s3.amazonaws.com/pdf/UC-433a9915-6786-489b-874f-cf288d23cb15.pdf",
        "https://www.udemy.com/certificate/UC-cd78ecc3-40ca-401e-9630-0c2f3250f223/",
        "https://www.udemy.com/certificate/UC-a29f2436-97cc-443e-b2e4-aa22c057d7a2/"
    ],
    "short_description": "Computer vision specialist with extensive experience in object detection and tracking systems. Zeeshaan has worked across healthcare, fintech, and security sectors, developing AI solutions that have significantly improved operational efficiency and accuracy. Recently completed his MS in Computer Science from California State University, Los Angeles.",
    "long_description": "Zeeshaan Mohammed is a specialized Machine Learning Engineer with deep expertise in computer vision and AI systems implementation. His professional journey spans multiple industries where he has consistently delivered impactful AI solutions.\n\nAt Solo Tech, he spearheaded the development of advanced object detection and tracking systems using YOLO and Bytetrack, achieving a 30% improvement in accuracy while reducing irrelevant ID switches in challenging conditions. His optimization work reduced model inference latency by 40%, enabling effective edge-device deployment.\n\nIn the healthcare sector at Medtronic, Zeeshaan enhanced the GI Genius intelligent endoscopy AI system, achieving a 20% improvement in detecting precancerous lesions. He also developed a machine learning model for a smart insulin pen that reduced hypoglycemic events by 28% through personalized dosing recommendations.\n\nHis security-focused work at SkyLark Labs included deploying a real-time theft detection system with 90% accuracy that cut security response time in half, and designing a face recognition system achieving 95% accuracy through effective data augmentation techniques.\n\nEarlier in his career at PayPal, Zeeshaan developed a churn prediction model that reduced customer attrition by 20%, retaining over 20,000 customers. He also deployed an NLP-based chatbot system that increased ticket resolution efficiency by 25%.\n\nZeeshaan holds a Master of Science in Computer Science from California State University, Los Angeles (2022-2024) and a Bachelor of Engineering in Computer Science from Muffakham Jah College of Engineering & Technology (2016-2020). He has supplemented his formal education with certifications in Deep Learning and Computer Vision, Natural Language Processing, Time Series Data Analysis, and Data Science from Udemy.\n\nHis technical expertise spans computer vision, machine learning, deep learning frameworks (particularly YOLO, DeepSort, and LSTM architectures), and data science methodologies, with a proven track record of translating technical capabilities into measurable business outcomes across diverse industry contexts."
}