{
    "id": "nikita-mounier",
    "name": "Nikita Mounier",
    "profile_pic": "https://media.licdn.com/dms/image/v2/D4D03AQFXtoGENVvo_Q/profile-displayphoto-shrink_200_200/profile-displayphoto-shrink_200_200/0/1723798308303?e=2147483647&v=beta&t=xr4ZDu_GadEOOd8tVfBKgQ_W7ciiR6RZA01WqzRvsJM",
    "links": [
        "https://github.com/nikitamounier",
        "https://twitter.com/nikitamounier",
        "https://www.linkedin.com/in/nikita-mounier-b80539216/",
        "http://nikitamounier.github.io",
        "mailto:nikita.mounier@gmail.com"
    ],
    "short_description": "Nikita Mounier is a trilingual student in the prestigious Jerome Fisher M&T Program at UPenn, pursuing dual degrees in Computer Science and Finance. With experience as a software engineering intern at Ramp and a track record of winning hackathons, including PennApps XXIII and placing 2nd at TreeHacks 2025, Nikita demonstrates exceptional technical skills and entrepreneurial drive.",
    "long_description": "Nikita Mounier is a talented computer science and finance student in the Jerome Fisher Management & Technology Program at the University of Pennsylvania, maintaining an impressive 3.91/4.00 GPA. His technical expertise is demonstrated through his role as an App Developer at Penn Labs and as a Teaching Assistant for both undergraduate and graduate-level computer science courses, including Machine Learning (CIS 5200) and Programming Languages & Techniques (CIS 1200).\n\nNikita has a strong track record in competitive programming and hackathons, with notable achievements including 2nd place overall at TreeHacks 2025 with project \"Supernova,\" 2nd place at PennApps XXV with \"Rally AI,\" and 1st place at PennApps XXIII with \"Cointree,\" a blockchain platform promoting sustainability through carbon offsets. His project work demonstrates versatility across iOS development, web applications, blockchain technologies, and AI.\n\nProfessionally, Nikita has secured a Software Engineering Internship at Ramp, a fintech unicorn, for Summer 2024. He also contributes to Penn Undergraduate Capital Partners in a sourcing role, showing his interest in the intersection of technology and finance.\n\nNikita is exceptionally multilingual, with native or bilingual proficiency in English, French, and Russian, plus working knowledge of Spanish. His educational background includes attending the Lycée Français Charles de Gaulle in London, where he completed the French Baccalauréat with highest honors (19.33/20) in Computer Science, Mathematics, and Physics.\n\nBeyond his technical accomplishments, Nikita has developed several notable personal projects, including \"Tap It,\" an innovative iOS application that allows users to share social media details by simply placing one phone on top of another. This privacy-centric app, which has garnered 34 stars on GitHub, uses advanced technologies including SwiftUI, The Composable Architecture, Combine, Network Framework, Core Location, and Core Bluetooth. The project demonstrates his expertise in iOS development and his commitment to creating practical solutions to everyday problems.\n\nNikita is also an active contributor to the tech community, having given a talk about The Composable Architecture at NSLondon in November 2022. His GitHub profile showcases various other projects, including \"Turkey-To-Go,\" \"bridging-the-gap\" (a website for a tutoring charity where he serves as head of Computer Science), and \"swift-expression\" (a micro-library for Swift). He has also shared numerous code snippets and implementations of programming patterns through GitHub Gists, including a French translation of The Composable Architecture's documentation.\n\nHis diverse skill set spans software engineering, machine learning, blockchain technology, financial analysis, and iOS development, positioning him as a versatile talent at the intersection of technology and business with a particular strength in Swift and iOS development."
}