{
    "id": "nmovva",
    "name": "Neil Movva",
    "profile_pic": "https://static.licdn.com/aero-v1/sc/h/9c8pery4andzj6ohjkjp54ma2",
    "links": [
        "https://www.linkedin.com/in/nmovva",
        "https://www.neilmovva.com/"
    ],
    "short_description": "Neil Movva is a machine learning and computer architecture expert currently at Together AI. Previously, he co-founded Blyss, worked at Apple on the Neural Engine, and held positions at NVIDIA. He holds BS and MS degrees in Electrical Engineering from Stanford University.",
    "long_description": "Neil Movva is a technology professional specializing in the intersection of deep learning and computer architecture. He currently works at Together AI, a company focused on artificial intelligence and machine learning technologies.\n\nNeil's career has been marked by significant contributions to AI hardware and infrastructure. Before joining Together AI, he co-founded Blyss with Samir Menon in 2022, a Y Combinator-backed startup (W23 batch) focused on end-to-end encrypted AI. Blyss developed technology to run AI workloads in GPU-based secure enclaves, keeping data encrypted even during processing. The company also created an SDK for private information retrieval with strong cryptographic guarantees.\n\nPrior to Blyss, Neil worked at Apple on the Neural Engine project, contributing to on-device AI inference capabilities. He also spent two summers at NVIDIA in the Deep Learning Architecture group, optimizing CUDA implementations for training large models at maximum speed. Additionally, he interned at Built Robotics, where he helped design an autonomous vehicle's perception system.\n\nNeil holds both Bachelor's and Master's degrees in Electrical Engineering from Stanford University, where his coursework focused on AI/ML algorithms, computer vision, and graphics. His academic research included work on light fields, computational photography, and vision-based robotic autonomy. He has published research on topics such as dynamic field of view in tomographic light field displays.\n\nThroughout his education, Neil demonstrated exceptional talent in scientific research. As a high school junior at Harker School, he placed 2nd at the Northern California/Western Nevada Junior Science and Humanities Symposium (JSHS) in 2014 with his project \"A Novel Use of IR Light in Eye Tracking Systems,\" which proposed an efficient and cost-effective way to use eye movements to control computers. He was also recognized as a 2014 Siemens Research Competition Individual Semifinalist for his work on periodontal ligament morphogenesis.\n\nNeil describes himself as someone who has \"spent his whole career making computers go fast, especially for deep learning.\" He is passionate about large-scale compute and democratizing computational power. In his free time, he designs embedded electronics for robotics and manages a small-scale server farm optimized for high-performance computing."
}