{
    "id": "olsenbudanur",
    "name": "Olsen B.",
    "profile_pic": "https://media.licdn.com/dms/image/v2/C5603AQEKP---i_Qa9A/profile-displayphoto-shrink_200_200/profile-displayphoto-shrink_200_200/0/1655585020700?e=2147483647&v=beta&t=wxFSNkym8H8Nk4lkvwHjjQwn1E7bLXluX8HJJyJYAr8",
    "links": [
        "https://olsenbudanur.com",
        "https://github.com/olsenbudanur",
        "https://www.linkedin.com/in/olsenbudanur/",
        "https://devpost.com/olsenbudanur"
    ],
    "short_description": "Software Engineer at Affirm and MLH Top 50 recipient with expertise in workflow orchestration infrastructure and LLMs. Founded Hack@Davidson, Davidson College's first student-led hackathon, and has won multiple hackathon awards including 1st place at Caltech's HackTech. Currently consulting for Cognition to help improve Devin AI.",
    "long_description": "Olsen B. (Oğuzhan Budanur) is a Software Engineer at Affirm working on the Workflow Orchestration Infrastructure Team, where he manages distributed systems integrating Airflow, Luigi, Spark, and Kubernetes that handle over 1,000,000 actions monthly. He developed a high-performance gRPC server in Kotlin and built a Slack bot leveraging semantic search and LLMs for efficient triage.\n\nWith a strong entrepreneurial spirit, Olsen founded and served as President of Hack@Davidson, organizing Davidson College's first student-led hackathon that raised over $6,000 and accommodated 90+ participants. His leadership extended to founding Competitive Coding at Davidson (C-CAD), which prepares members for software engineering jobs and internships. Under his guidance, the team won 11 prizes across 7 hackathons, including 1st place at Caltech's HackTech.\n\nOlsen's professional experience includes working as a Software Consultant for Cognition AI Labs, helping to improve Devin AI, and founding Motate LLC, a boutique software contracting firm that secured multiple contracts and achieved quarterly revenue of ~$20,000. He also interned at Aptos Labs, where he created a 7,000-line open-source Python CLI for Kubernetes deployments that saved $70,000 through multithreading optimizations.\n\nHis technical expertise spans workflow orchestration, distributed systems, Kubernetes, Python, Kotlin, Java, C++, Firebase, and LLMs. Olsen is particularly passionate about building AI-powered tools, as demonstrated by his work on semantic search systems and LLM applications. He's recognized as part of the MLH Top 50 and has received multiple academic scholarships and hackathon awards, including wins for projects like WaitFree DMV, ImmiGrace, SusEats, BlockAide, and CodeViolet.\n\nOlsen grew up in the DC Metro Area and discovered his passion for coding in middle school, starting with VisualBasic's GUI-based desktop apps. His love for technology was truly ignited at his first hackathon, VTHacks 7, in 2019. He studied Computer Science at Davidson College after transferring from Virginia Tech, where he was pursuing a double major in Computer Science and Computational Modeling & Data Analytics. He maintained a perfect 4.0 GPA in his major courses and served as a Teaching Assistant for a Blockchains class at Davidson College.\n\nBeyond his technical work, Olsen enjoys exploring new technologies, participating in hackathons, and building innovative projects. His personal website at olsenbudanur.com showcases his portfolio of work and technical achievements."
}