{
    "id": "prady-saligram",
    "name": "Prady Saligram",
    "profile_pic": "https://media.licdn.com/dms/image/v2/C4E03AQEzkEEXkWvgjg/profile-displayphoto-shrink_200_200/profile-displayphoto-shrink_200_200/0/1649863888601?e=2147483647&v=beta&t=p5DtzARjiqeWK4jYSAiRFufyVpw6db2pSlQa1ossP3A",
    "links": [
        "saligram@stanford.edu",
        "https://www.linkedin.com/in/prady-saligram/",
        "https://github.com/prady-saligram"
    ],
    "short_description": "Deep learning researcher at Stanford AI Lab (SAIL) and mathematics & computer science student at Stanford University. Specializes in optimizing language models and developing financial technology applications, with experience in quantitative research, entrepreneurship, and technical leadership.",
    "long_description": "Prady Saligram is a deep learning researcher at Stanford Artificial Intelligence Laboratory (SAIL) and a mathematics and computer science student at Stanford University. His research focuses on implementing and optimizing language models, particularly working on RoBERTa in Jax and Haliax within Stanford's Levanter framework, and developing novel PoS tagging fine-tuning methods for historical languages under Professor Christopher Manning.\n\nAt Stanford's Advanced Financial Technologies Lab, Prady is developing an end-to-end pipeline for a proprietary LLM using a hybrid dense-sparse RAG framework to process 10-K filings, with a focus on enabling accurate time series forecasting of financial metrics. His work spans constructing domain-specific datasets, creating evaluation benchmarks, and optimizing embedding retrieval for deductive reasoning.\n\nBeyond his research, Prady serves as Vice President of Hackspace at the Business Association of Stanford Entrepreneurial Students (BASES), where he organizes weekly hacker hours, themed hackathons, and faculty speaker series. Under his leadership, Hackspace has become a technical hub for builders, providing mentorship opportunities and collaborating with Microsoft Founder's Hub to offer compute credits and other resources to student projects. He also helped build Founder Pact, a co-founder matching platform that gained popularity on campus.\n\nPrady was selected for the Battalion Fellow Incubator Program with a competitive acceptance rate of less than 7% and has gained industry experience through internships at Citadel Securities as a Quant Invitational Wintern and at Al-Futtaim as a System Engineering Intern. He also co-founded Voice Maths, a platform enabling users to find answers to math-related questions, managed by a team of accredited student tutors.\n\nHis academic achievements include a 4.14/4.0 GPA at Stanford, where his coursework spans theoretical statistics, applied matrix theory, PDEs, real analysis, machine learning, NLP with deep learning, and computer systems. Prior to Stanford, he earned 44/45 points in the International Baccalaureate program and was awarded the Claes Nobel Legacy Award from the National Society of High School Scholars.\n\nOutside of academics, Prady is passionate about tennis, staying active, and enjoys Stanford's large campus which necessitates long bike rides and walks. He is proficient in multiple programming languages including Python, JavaScript, React, C++, and has experience with machine learning frameworks. As a self-described \"project-oriented learner at heart,\" he continues to explore the future of LLMs, mathematical reasoning, and blockchain technology."
}