{
    "id": "rez-havaei",
    "name": "Rez Havaei",
    "profile_pic": "https://media.licdn.com/dms/image/v2/D5603AQGyYJGEL1Yusg/profile-displayphoto-shrink_200_200/B56ZTEe9TbHsAY-/0/1738463238633?e=2147483647&v=beta&t=3Orze9_MciQqEapXAkJyh8T3AwY0usTcDqgYmoI_Pss",
    "links": [
        "https://www.linkedin.com/in/rez-havaei",
        "https://generalanalysis.com",
        "https://github.com/General-Analysis/GA"
    ],
    "short_description": "Rez Havaei is the CEO & Co-Founder of General Analysis (YC S24), a startup developing automated AI safety and red-teaming tools. With expertise in AI research and quantitative trading, his career includes roles at Cohere, NVIDIA, Jane Street, and as a founding engineer at vals.ai, where he helped build an LLM evaluation platform.",
    "long_description": "Rez Havaei is an accomplished entrepreneur and AI specialist currently serving as the CEO & Co-Founder of General Analysis, a Y Combinator-backed startup (S24 batch) focused on AI safety and evaluation. The company provides a comprehensive suite of tools for identifying and addressing vulnerabilities in AI systems, including red-teaming frameworks and interpretability techniques.\n\nGeneral Analysis was founded in 2024 and is based in San Francisco. The company's mission is to address the growing risks associated with deploying increasingly capable AI systems in high-stakes environments. Their approach involves developing automated tools that systematically find model failure modes and enhance model robustness, delivering detailed safety and performance reports to customers.\n\nOne of their notable projects demonstrated how GPT-4o is susceptible to hallucinating when asked about legal cases or concepts. Their research showed they could train an attacker model that caused GPT-4o to hallucinate on more than 35% of prompts related to legal questions.\n\nBefore founding General Analysis, Rez worked as a founding engineer at vals.ai, where he helped build an LLM evaluation platform and benchmark. This startup, co-founded by Stanford AI students, aimed to create a standardized test for measuring artificial intelligence and large language models, providing an unbiased, third-party review system.\n\nRez's professional experience spans both AI research and finance. He has worked as an Applied Research Intern in Deep Learning at Snap Inc., a Machine Learning Engineering Intern at Cohere (a leading AI company developing large language models), and held an Applied Research position in Artificial Intelligence at NVIDIA. His finance background includes quantitative trading internships at prestigious firms like Jane Street and Susquehanna International Group (SIG).\n\nHis academic research experience includes positions at the USC Information Sciences Institute and as a Research Assistant at UC Davis, where he also served as a Teaching Assistant. Rez earned a Bachelor of Science in Engineering from the University of California, Davis (2018-2023), maintaining a 3.97 GPA.\n\nRez is also involved in another venture called Kart AI, which serves as an interactive search platform that simplifies research for electronic products. The platform extracts relevant recommendations from Reddit, YouTube, and trusted content creators to help users find and compare electronic products.\n\nHis technical interests and expertise span AI safety, interpretability, evaluation, deep learning, and statistical inference. Rez's career trajectory demonstrates his commitment to addressing the challenges of AI safety and evaluation while building practical tools that can help organizations deploy AI systems more responsibly."
}