{
    "id": "rishi-sadanandan",
    "name": "Rishi Sai Sadanandan",
    "profile_pic": "https://media.licdn.com/dms/image/v2/D5603AQHTBs3bDE7GJA/profile-displayphoto-shrink_200_200/profile-displayphoto-shrink_200_200/0/1701659909011?e=2147483647&v=beta&t=J1vo2OakSsrx6MuOgZqYadQtcDst6QZRPESnKixRzis",
    "links": [
        "https://www.linkedin.com/in/rishi-sadanandan",
        "mailto:rishi.sadanandan25@gmail.com"
    ],
    "short_description": "Stanford CS (AI) and Math student with a unique blend of venture capital experience, entrepreneurship, and product design. Currently a Pear VC Fellow and VC Analyst at Stanford Social Entrepreneurial Students' Association, while co-founding PocketChangeDigital. Holds three patents for an innovative underwater ear pod system and has a background in finance, data implementation, and classics research.",
    "long_description": "Rishi Sai Sadanandan is a multifaceted Stanford University student pursuing Computer Science with a focus on AI and Mathematics. His professional journey showcases a remarkable blend of venture capital, entrepreneurship, and product innovation.\n\nAs a Pear VC Fellow, Rishi works closely with leadership to identify and support high-potential early-stage founders, leading the Green Light program at Stanford to source promising startups for investment. Simultaneously, he serves as a VC Analyst at Stanford Social Entrepreneurial Students' Association, where he's part of a team raising and managing a fund while building a unique investment thesis.\n\nRishi's entrepreneurial spirit is evident in his role as Co-Founder of PocketChangeDigital, a startup focused on maximizing the use of gift cards. In September 2024, he won $50,000 in the BUC Ventures competition to further develop this venture. He also serves as President of Rem and Company, where he leads a team of strategists rejuvenating small businesses with data-driven solutions. His leadership earned him recognition as \"Best President\" for the 2024/2025 cycle from the National Chapter.\n\nPerhaps most impressively, Rishi is the Creator and Product Designer of Advanced AquaPods, an underwater ear pod system for which he holds three patents (Utility, Design, and Application). This innovative product enables audio communication and music listening underwater, featuring emergency SOS signals and waterproofing technology. The patents were granted in 2022 and 2024, with the most recent utility patent issued in March 2024.\n\nHis diverse experience extends to social impact work with the Stanford Pre-Business Association, where he consulted for an international women's non-profit, working with C-suite executives on brand development and global recognition initiatives. He's also served as a Growth Intern at Cyrano AGI, where he spearheaded Alpha and Beta testing at Stanford and worked with advanced AI algorithms, particularly in NLP and adaptive learning.\n\nBeyond his technical and business pursuits, Rishi is passionate about education and Latin language. He founded \"A Dead Language Comes Alive,\" a non-profit organization that teaches Latin to underserved students while helping them prepare for standardized tests. The program has expanded to multiple schools in the Tampa area, with a special focus on helping Latin American students connect Spanish, English, and Latin to improve their language skills.\n\nRishi's academic interests are broad, including research in Classics at the University of South Florida, where he explored similarities between origin myths across different cultures. He's also taken courses examining the ethical implications of technology through science fiction, demonstrating his interest in the societal impact of technological advancement.\n\nOriginally from Tampa, Florida, and a graduate of Berkeley Preparatory School, Rishi is also an accomplished athlete, having competed in varsity tennis and with the United States Tennis Association, achieving high rankings in Florida. He's committed to education, working as an SAT/ACT Test Preparation Specialist and volunteering as a tutor in various capacities.\n\nRishi's multidisciplinary approach, combining technical expertise in AI with business acumen and product design, positions him uniquely at the intersection of technology, innovation, and entrepreneurship. His commitment to education and social impact demonstrates his desire to use his skills to make a positive difference in the world."
}