{
    "id": "ryan-rong-313779229",
    "name": "Ryan Zhijie Rong",
    "profile_pic": "https://media.licdn.com/dms/image/v2/D4E03AQF6MD7w2N2--A/profile-displayphoto-shrink_200_200/profile-displayphoto-shrink_200_200/0/1729071897582?e=2147483647&v=beta&t=u5KDG4CBF4_gJ6YILAazXV5TV9cWw53rGr-94s7muEQ",
    "links": [
        "https://github.com/Ryan-Rong-24",
        "https://imaginecup.microsoft.com/en-US/Member/WinnerCertificate?userid=p7ofsU%252bZDAOafAG0FmRujA%253d%253d&compId=d6eyg4hwXs7WbP0sXtsOIg%253d%253d&teamId=E7hxOGdqCJBrDwnDgj8s1A%253d%253d",
        "https://profiles.stanford.edu/ryan-rong"
    ],
    "short_description": "Stanford CS '28 student with extensive research experience in machine learning, focusing on healthcare applications and AI fairness. Microsoft Imagine Cup Americas Winner and Stanford HAI Research Assistant who combines technical expertise with a passion for applying AI to solve real-world problems in healthcare, climate, and financial markets.",
    "long_description": "Ryan Zhijie Rong is a Computer Science and Mathematics student at Stanford University with impressive accomplishments in machine learning research and software development. His research portfolio spans multiple prestigious institutions, including Stanford's Institute for Human-Centered AI (HAI), where he's developing an AI writing assistant using OpenAI APIs, and Stanford's School of Medicine, where he trained machine learning models to predict Alzheimer's Disease onset with a focus on fairness across demographic groups.\n\nRyan currently serves as a Stanford Student Employee at the Stanford Digital Economy Lab (S-DEL), which is part of the Institute for Human-Centered Artificial Intelligence (HAI). This role allows him to contribute to research at the intersection of digital technology and economic systems, further broadening his experience in applying AI to real-world challenges.\n\nHis technical expertise extends beyond academia into industry applications. At UIUC's Intelligent Code Analysis and Testing lab, he developed deep learning networks for generating realistic Java bugs, demonstrating his skills in both AI and software engineering. His professional experience includes roles at Kos, where he works on bio signal processing algorithms, and previous positions at companies like Skylow, StoneWise, and MingXi Capital, where he gained experience in software development, drug discovery, and financial analysis.\n\nAs a standout achiever, Ryan has received numerous accolades, including being named a Microsoft Imagine Cup Americas World Finals Winner in 2023, winning the Stanford CS229 Machine Learning Course Best Project award (top 3 out of 400+ students), and earning the Jessica Lynn Saal Fellowship Award from Stanford's Institutes of Medicine Summer Research Program (top 5% of researchers). He's also demonstrated excellence in competitive settings, placing 1st in the 2024 Cornell Trading Challenge Systematic Equities and reaching the top 8 in Citadel's AI tower defense competition.\n\nRyan's project portfolio showcases his diverse interests in AI applications, including long-range weather forecasting with diffusion models, American Sign Language translation, reinforcement learning for race car driving, and various computer vision and classification systems. He's multilingual, speaking Chinese and English at a native level, with limited working proficiency in Spanish.\n\nBeyond his technical pursuits, Ryan is actively involved in volunteering as an Outreach Director and Tutor for Academic Advancements and has participated in fundraising for The Leukemia & Lymphoma Society. His unique combination of technical expertise, research experience, and commitment to applying AI for social good positions him as a promising innovator in the field of artificial intelligence.\n\nRyan can be contacted via his Stanford email at ryanrong@stanford.edu, and his official Stanford profile is available for academic and professional connections."
}