{
    "id": "samuel-xie-56544b202",
    "name": "Samuel Xie",
    "profile_pic": "https://static.licdn.com/aero-v1/sc/h/9c8pery4andzj6ohjkjp54ma2",
    "links": [
        "https://www.linkedin.com/in/samuel-xie-56544b202"
    ],
    "short_description": "Samuel Xie is a first-year Electrical Engineering & CS student at Caltech with a strong background in mathematics and computing. He contributes to Caltech's rocketry club by designing PWM control systems for rocket stabilization and conducts geophysics research modeling earthquakes using Python.",
    "long_description": "Samuel Xie is a promising undergraduate student pursuing a Bachelor's degree in Electrical Engineering & Computer Science at the California Institute of Technology (Caltech), class of 2028. He previously attended The Lawrenceville School from 2020 to 2024.\n\nSamuel currently serves as an Engineer for PARSEC, Caltech's Rocketry Club, where he contributes to the MARS/FAR Challenge aiming to launch a rocket to 45,000 ft with stable recovery. His technical contributions include designing and implementing PWM (Pulse Width Modulation) control systems to stabilize rockets during descent and developing control algorithms that integrate hardware/software systems for effective recovery dynamics.\n\nSimultaneously, Samuel works as an Undergraduate Researcher at Caltech's Husker Lab, focusing on geophysics modeling of earthquakes using Python. His research involves analyzing seismic data, simulating earthquake behavior, and utilizing Python-based tools for numerical simulations, signal processing, and visualization of geophysical phenomena.\n\nSamuel has demonstrated exceptional academic achievement, earning recognition as a National Merit Scholar Finalist and receiving the Hubert Alyea Award for excellence in Chemistry from the Princeton Section of the American Chemical Society. His computing skills are evidenced by his advancement to the USACO Gold Division in the USA Computing Olympiad. He has also qualified three times for the American Invitational Mathematics Exam between 2021 and 2023.\n\nBeyond academics, Samuel is a talented athlete who earned the 2023 Scholastic All-American award from USA Swimming, which recognizes students who maintain a GPA of 3.5 or higher while achieving Winter Junior National Qualifying Times. This combination of technical aptitude, research experience, and athletic achievement demonstrates Samuel's well-rounded capabilities and potential for future contributions in engineering and computer science."
}