{
    "id": "sathvik-redrouthu-28456919b",
    "name": "Sathvik Redrouthu",
    "profile_pic": "https://media.licdn.com/dms/image/v2/D4E03AQEDwlz9rJTJvg/profile-displayphoto-shrink_200_200/profile-displayphoto-shrink_200_200/0/1696690222213?e=2147483647&v=beta&t=CJOcTYdzVNXaT5K95ywwk4uX5HyvsqpZH1INaGxiSvU",
    "links": [
        "https://sathvikr.com",
        "https://www.linkedin.com/company/etched-ai",
        "https://www.linkedin.com/school/y-combinator",
        "https://github.com/sathvikr",
        "https://www.procyonphotonics.org"
    ],
    "short_description": "Sathvik Redrouthu is a tech innovator and entrepreneur who founded Procyon Photonics while in high school to develop photonic computing technology. Currently at Etched, he previously worked on chip design tooling through his startup Instachip. His research focuses on optical computing, photonic integrated circuits, and tensor algebra implementations for next-generation computing architectures.",
    "long_description": "Sathvik Redrouthu is a forward-thinking technologist, entrepreneur, and researcher at the intersection of optoelectronics, hardware acceleration, and advanced computing architectures. Currently working at Etched and previously associated with Y Combinator, Sathvik has established himself as an innovator in specialized computing hardware despite his young age.\n\nAs the founder, CEO, and CTO of Procyon Photonics, Sathvik became the world's youngest CEO in the photonic and optical computing sector. Founded in 2021 while he was still in high school at Thomas Jefferson High School for Science and Technology, Procyon develops revolutionary photon-based computing technology that aims to overcome the limitations of traditional electronic computing. The company's optical chips are designed to be significantly more energy-efficient than conventional processors, with prototypes reportedly 55,000 times more energy-efficient than the Intel i9 and over 100 times more efficient than Nvidia's A100 or Google's TPU. Procyon secured venture funding from Peter Thiel's 1517 Fund and has attracted interest from tech leaders like Sam Altman of OpenAI.\n\nBefore joining Etched, Sathvik founded Instachip, an EDA (Electronic Design Automation) startup focused on chip design tooling, and participated in Y Combinator. He is also conducting Formal Verification research with Dr. Mark Santolucito at Columbia University.\n\nHis research portfolio includes significant contributions to optical computing, with publications focused on optoelectronic hardware accelerators for tensor arithmetic. His work on \"Tachyon,\" a programmable optoelectronic hardware accelerator, demonstrates his expertise in designing systems for ultrafast tensor operations. His team at Procyon was the first to run tensor algebra on an optical chip. Additionally, he has published on tensor algebra implementations for optoelectronic microchips and the use of interferometer-based photonic integrated circuits for rapid unitary transformations.\n\nSathvik's technical focus is on leveraging optical technologies to overcome limitations in traditional electronic computing, particularly for matrix multiplication and tensor operations critical for AI and machine learning workloads. His work on implementing unitary matrix transformations through Mach-Zehnder interferometers shows a deep understanding of how to harness photonic principles for computational advantage.\n\nBeyond his professional work, Sathvik has developed numerous projects including AI chess engines, regex interpreters using Brzozowski derivatives, tensor algebra compilers with sparse tensor storage systems, and various AI applications. He is also skilled in hardware development, having created electric guitars and EMP generators from scratch.\n\nSathvik graduated high school in June 2024 but decided not to attend university, instead pursuing entrepreneurship and practical research. His vision is to someday \"power the world with light\" through photon-based computing, which he believes represents the next revolution in computing technology."
}