{
    "id": "sheryl-chen-489b892a1",
    "name": "Sheryl Chen",
    "profile_pic": "https://media.licdn.com/dms/image/v2/D5603AQF7_QG5tfr-OA/profile-displayphoto-shrink_200_200/profile-displayphoto-shrink_200_200/0/1707247264534?e=2147483647&v=beta&t=pLLl0q8_b7J7d3UeTvTjW8tT5-kVRKRwOWjNeMq120M",
    "links": [
        "https://sherylchen.com/"
    ],
    "short_description": "Computer Science student at Stanford University with diverse experience in software engineering, NLP research, and debate coaching. Passionate about applying AI and machine learning to solve real-world problems, particularly in economic policy research and agrivoltaic systems.",
    "long_description": "Sheryl Chen is a Computer Science student at Stanford University who combines technical expertise with interdisciplinary interests. Her professional experience spans multiple domains, showcasing her versatility and drive.\n\nAs a Software Engineer at rézme, she's currently applying her technical skills in a startup environment. Simultaneously, she serves as a Debate Coach at Menlo School in Atherton, California, leveraging her national debate success (ranked 2nd nationally in Parliamentary Debate) to mentor students.\n\nSheryl has demonstrated significant technical capabilities through her work at Fundusol, LLC, where she developed an internal UI for simulating agrivoltaic systems using Django, Celery, Redis, HTML, CSS, SQLite, and Chart.js. Her contributions helped secure contracts with leading international solar development companies, showing her ability to create impactful technical solutions with real business outcomes.\n\nHer research experience is equally impressive. At the Stanford Institute for Economic Policy Research, she worked as an NLP Researcher under Dr. Ashrakat Elshehawy, applying machine learning and natural language processing techniques to extract insights for social sciences research. Her work was significant enough to be presented at the 2024 Global Development Research Symposium.\n\nSheryl's commitment to community service is evident in her role as a Project Management Mentor at StreetCode Academy, where she guided 17+ adult learners through educational journeys in project management methodologies and approaches.\n\nHer technical foundation was further strengthened during her internship at Auburn University's Data Science and Engineering Laboratory, where she tested and compared state-of-the-art video analysis models within MMAction2, a PyTorch toolbox for action recognition and temporal modeling. She also conducted literature reviews on 3D CNN image classification, demonstrating her ability to engage with cutting-edge research.\n\nBeyond her academic and professional achievements, Sheryl has received notable recognition for her work, including a Perfect Score on the AP Research Exam (top 1.14% globally), being named a 2022 CA National History Day Champion, and receiving Special Congressional Recognition for co-founding Fighting for Heroes, an organization that donated over 40,800 masks to hospitals and vulnerable communities during the pandemic.\n\nAs a lifetime Girl Scout member, Sheryl embodies the values of leadership, service, and making a positive impact in her community. Her diverse experiences across software engineering, research, education, and community service position her as a multifaceted technologist with the potential to create meaningful change through her work."
}