{
    "id": "sohvasa",
    "name": "Soham Vasanawala",
    "profile_pic": "https://media.licdn.com/dms/image/v2/D5603AQEXyl3g-sHJ1w/profile-displayphoto-shrink_200_200/profile-displayphoto-shrink_200_200/0/1702666283417?e=2147483647&v=beta&t=lWQE841Q89GD6tm4CSE01oM28SAOLdtfJ-H5irJaXrw",
    "links": [
        "https://www.amazon.com/Entrepreneurial-Insights-Essays-Interviews-Entrepreneurs/dp/B0BGQ87BRX/",
        "https://www.ismrm.org/23m/"
    ],
    "short_description": "Soham Vasanawala is a Mathematics student at Stanford University with a strong focus on the intersection of AI and healthcare. He has co-founded two startups, including Intratalent AI and Gains Coach LLC, where he's developing AI-powered coaching platforms. His research experience spans medical mixed reality and algorithm development for medical procedures, with notable presentations at ISMRM 2023.",
    "long_description": "Soham Vasanawala is a Mathematics undergraduate at Stanford University with entrepreneurial drive and technical expertise in AI applications for healthcare and biotech.\n\nAs a co-founder of Intratalent AI (since November 2024) and Gains Coach LLC (since December 2021), Soham demonstrates his entrepreneurial spirit. At Gains Coach, he's developing a real-time, AI-powered coaching platform for various physical movements including physiotherapy, sports, fitness, and dance.\n\nHis research experience is impressive for his age. During his internship at Stanford University School of Medicine, he worked with the Incubator for Medical Mixed and Extended Reality, developing a real-time augmented-reality visualization of knee motion from MRI data for the HoloLens2. At Stanford University School of Engineering, he designed and conducted research that led to a time-saving algorithm for a medical procedure, which he presented at Stanford BioX 2022 and ISMRM 2023.\n\nNotably, at ISMRM 2023, he presented research on \"Predicting MR Image Quality from Breathing Patterns\" where he demonstrated that detected breathing patterns could be utilized to predict whether adequate MR image quality would be obtained. Using a K-means clustering algorithm, his work showed that 9 in 10 forty-second breathing waveforms could be correctly predicted as either resulting in high or low image quality, potentially saving time from unnecessary scans.\n\nSoham has also gained industry experience as a Software Engineer at Turboprop, a fintech startup in Menlo Park. His academic background includes a Bachelor of Science degree from Stanford University (2023-2027) and previous education at Henry M. Gunn High School.\n\nBeyond his technical work, Soham has contributed to a publication titled \"Essays and Interviews with Bay Area Entrepreneurs\" (September 2022), showing his interest in entrepreneurship. He is also a member of The International Society for Magnetic Resonance in Medicine, further demonstrating his commitment to the medical technology field.\n\nSoham is proficient in English (native) and has limited working proficiency in French. His diverse experiences in AI, healthcare technology, and entrepreneurship position him uniquely at the intersection of technology and medicine, with a particular focus on using AI to solve real-world healthcare challenges.\n\nHe appears to be related to Shreyas Vasanawala, MD/PhD, who serves as the William R. Brody Professor of Pediatric Radiology and Child Health at Stanford Medicine, suggesting a family connection that may have influenced his interest in medical technology."
}