{
    "id": "sudarshan-nambiar",
    "name": "Sudarshan Nambiar",
    "profile_pic": "https://media.licdn.com/dms/image/v2/D5603AQH3blzwJ1Wb6A/profile-displayphoto-shrink_200_200/profile-displayphoto-shrink_200_200/0/1706801192462?e=2147483647&v=beta&t=oAYdbY5iiCb4e1k4jslMTMnkxPLfLz6FHa56xZIqxZE",
    "links": [
        "https://sdrshn-nmbr.github.io/sdrshn-nmbr-portfolio/",
        "https://www.linkedin.com/in/sudarshan-nambiar/",
        "https://www.perplexity.ai/campus-strategists/sudarshan-nambiar"
    ],
    "short_description": "Junior at Purdue University pursuing Computer Engineering with a focus on AI and distributed systems. Neo Scholar, ML@Purdue member, and Software Engineer Intern at Legacy with expertise in secure ML systems and financial market analysis.",
    "long_description": "Sudarshan Nambiar is a junior at Purdue University pursuing a BS in Computer Engineering with a focus on AI and distributed systems through the accelerated BSMS 3+1 program. His technical expertise spans multiple domains, with particular strengths in secure machine learning systems and backend infrastructure development.\n\nAs a Software Engineer Intern at Legacy (Neo '24), Sudarshan is applying his skills in a professional setting. He previously interned at SignalOps, a JPMorgan Techstars '23 company, gaining valuable industry experience. His academic excellence is evidenced by consistently making the Dean's List and receiving Semester Honors at Purdue.\n\nBeyond his academic pursuits, Sudarshan is actively involved in the AI community as a member of ML@Purdue and was selected as a Neo Scholars finalist, demonstrating his recognition among ambitious students passionate about AI and technology. He also serves as a Campus Strategist for Perplexity AI, where he contributes to growth and marketing initiatives on campus.\n\nIn the financial sector, Sudarshan has demonstrated expertise as the Head of Trading at YES Bank, where he provided insightful analysis on monetary policy, noting that high leverage in the economy would likely make the Monetary Policy Committee cautious about easing monetary conditions. His economic insights have been featured in financial media, showcasing his understanding of macroeconomic factors affecting interest rates and market conditions.\n\nSudarshan's research experience includes work as a Research Assistant at Purdue SERIS Research Group, where he enhanced the security of PyTorch-based machine learning models through Trusted Execution Environments (OP-TEE) and developed encryption functions using the mbedTLS library. He's also contributed to educational technology as a Software Engineer at ECELabs, orchestrating the migration of backend infrastructure for a digital design and circuits simulator from CherryPi to Django and engineering APIs for React frontend integration.\n\nHis teaching experience as an Undergraduate Teaching Assistant for Data Structures and Algorithms and Advanced C Programming courses at Purdue demonstrates his ability to communicate complex technical concepts. Sudarshan has also worked on several projects including Agenta, Bulletant, and Tusk, showcasing his practical application of engineering skills.\n\nSudarshan aims to leverage his engineering skills and creativity to tackle real-world problems and make a meaningful impact, combining his technical expertise with a problem-solving mindset and financial market insights."
}