{
    "id": "thobonato",
    "name": "Thomaz Felipe Bonato",
    "profile_pic": "https://media.licdn.com/dms/image/v2/D5603AQGAwfxl7o_QYg/profile-displayphoto-shrink_200_200/profile-displayphoto-shrink_200_200/0/1698446882804?e=2147483647&v=beta&t=LO0xP9xZTd6S98I5e34TIKKHDF9S82q1CKJeKWiyghs",
    "links": [
        "https://foresight.gov.gr/wp-content/uploads/2024/11/Blueprint_GREECES_AI_TRANSFORMATION.pdf"
    ],
    "short_description": "Brazilian AI researcher and entrepreneur studying at USC as a Trustee Scholar. Thomaz has excelled in hackathons, winning first place at HackMIT and second place at PennApps in 2024, while conducting AI research at USC Marshall School of Business focusing on educational applications and LLMs.",
    "long_description": "Thomaz Felipe Bonato is a passionate engineer, researcher, and lifelong learner from Brazil currently pursuing a Bachelor of Science in Artificial Intelligence for Business at the University of Southern California as a prestigious Trustee Scholar with full tuition. His academic excellence is further evidenced by his National Merit Finalist status.\n\nThomaz has established himself as an exceptional hackathon competitor, securing first place at HackMIT 2024 with PalmLabs (focused on education) and second place at PennApps 2024 with Cypress MFA (addressing security and privacy challenges). He also won first place with Azalea, an eco-friendly AI model selector, demonstrating his commitment to sustainable AI solutions.\n\nHis professional experience spans multiple domains within AI and business. As an AI Research Assistant at USC Marshall School of Business since December 2023, he initially explored AI applications in education and has since expanded to researching LLMs and cluster-based probing techniques. Thomaz has entrepreneurial experience as a founder of a stealth startup focused on AI solutions for law firms, and currently serves as a Data Science Intern at Trudy and a Growth Strategist at Mercor.\n\nWithin the USC community, Thomaz has taken on leadership roles as the Director of Founder's Education at SEP (Student Entrepreneurship Program) and previously served as Director of External Relations for USC Business Technology Group. He was also a Student Founder at SEP, demonstrating his commitment to entrepreneurship education.\n\nThomaz is multilingual, with native proficiency in Portuguese and English, and professional working proficiency in Spanish. He is also a Management Leadership Tomorrow (MLT) Fellow, indicating his commitment to leadership development. His technical skills are evidenced by certifications in Linear Algebra for Machine Learning and Neural Networks and Deep Learning from DeepLearning.AI, as well as UX design skills certified by LinkedIn.\n\nHis contribution to policy is demonstrated through his publication \"A Blueprint for Greece's AI Transformation\" for the Special Secretariat for Foresight, Presidency of the Government, Hellenic Republic, showing his interest in AI governance and national strategy development.\n\nIt's important to note that there is another Thomaz Bonato who has had a distinguished career in the pharmaceutical industry, serving in various executive roles at AstraZeneca and Alexion. This Thomaz Bonato has held positions including US Chief Financial Officer and Vice President of Finance at AstraZeneca, Interim Country President of AstraZeneca Australia and New Zealand, and most recently as Global Head of Research Development & Medical Finance at Alexion. His career has included significant financial leadership roles across multiple countries including Brazil, Costa Rica, Australia, and the United States. However, this is a different individual than the USC student and AI researcher profiled here."
}