{
    "id": "unknown-linkedin-id",
    "name": "Giles Pirio",
    "profile_pic": "https://miro.medium.com/v2/resize:fill:176:176/0*99UGz6I2TiRO0pCT",
    "links": [
        "https://medium.com/@gilespirio",
        "https://firesidechat.com/gilespirio",
        "https://patents.justia.com/inventor/gilles-pirio"
    ],
    "short_description": "Technology professional with expertise in entity resolution systems and smart contracts, and an inventor with multiple patents to his name.",
    "long_description": "Giles Pirio is a technology professional with interests spanning artificial intelligence, blockchain technology, and smart contracts. He has demonstrated technical knowledge through his Medium posts where he has written about Codius, a smart contract platform, showing his understanding of blockchain technologies and distributed systems. His questions about network security and efficiency comparisons between different platforms reveal analytical thinking and technical depth.\n\nProfessionally, Giles has been involved in entity resolution technology, as evidenced by his patents with Entelo, Inc. He is listed as a co-inventor on multiple patents including \"Entity resolution techniques and systems\" (Patent number: 9734207) and \"Systems and methods for accessing third party data on websites\" (Publication number: 20150339785). These patents relate to data analysis, entity identification across datasets, and web data aggregation technologies.\n\nHe also has earlier patents related to nanotube growth processes from his work with Thales, suggesting a background in materials science or engineering before moving into data and software technologies.\n\nGiles maintains a presence on several platforms including Medium and Fireside, where his profile includes the humorous quote \"It's not a man purse. It's called a satchel. Indiana Jones wears one.\" While he has only published minimally on Medium (with just one follower), his technical interests and patent history indicate significant expertise in technology fields, particularly around data systems and entity resolution."
}