{
    "id": "yohannes-aklilu",
    "name": "Yohannes Tenagashaw Aklilu",
    "profile_pic": "https://static.licdn.com/aero-v1/sc/h/9c8pery4andzj6ohjkjp54ma2",
    "links": [
        "mailto:yaklilu@stanford.edu",
        "mailto:yaklilu@gc-fellow.com"
    ],
    "short_description": "Electrical Engineering student at Stanford University with diverse experience spanning aerospace, hardware engineering, and venture capital. Currently serving as a General Catalyst Venture Fellow while working at Amazon on ML quantization for embedded hardware and contributing to research at Stanford's PinCS Lab.",
    "long_description": "Yohannes Tenagashaw Aklilu is an Electrical Engineering student at Stanford University (2023-2027) with a remarkable breadth of technical and business experience. His technical expertise spans multiple domains, with a particular focus on the intersection of hardware and machine learning.\n\nCurrently, Yohannes serves as a General Catalyst Venture Fellow while working as a Hardware Engineer at Amazon in Sunnyvale, CA. At Amazon, he focuses on quantization of DNN models to be deployed on accelerators like NNA and MDLA for firmware applications such as Alexa. His work involves creating automated frameworks for NNA.3x aware training to avoid floating point numbers and transform to fixed point numbers, as well as extending frameworks to support TensorFlow model quantization and converting compatible audiotech models into firmware.\n\nYohannes is actively engaged in research at Stanford University's Department of Computer Science, specifically in the PinCS Lab (Pedagogy in Computer Science Lab) where he works as an Undergraduate Researcher building drones. His aerospace interests extend to his earlier work as a Student Researcher at NASA, where he tested Aerogel insulation against radiation at 70,000 feet using weather balloon capsules.\n\nHis academic involvement at Stanford includes participation in the Leland Scholars Program, where he contributed to a research project titled \"Equity in AI: Navigating Bias Through a Human-Centric Framework,\" analyzing approaches and implementing a paradigm shift for unbiased and ethical artificial intelligence.\n\nPrior to Stanford, Yohannes worked as a Software Engineer at the Regional Transportation Commission of Southern Nevada, where he developed quantitative predictive modeling for city car crash data. He also conducted research at the University of Las Vegas Nevada for the International Science Fair, publishing work on \"Analysis of Supersonic Parachutes On ReEntry\" that examined crucial aspects of parachute design for rocket capsule reentry at supersonic speeds.\n\nYohannes possesses an impressive array of technical skills including machine learning frameworks (TensorFlow, PyTorch, Keras), programming languages (Python, C++, Java), hardware tools (Raspberry Pi, PCB design), robotics, computer vision (OpenCV), and data analysis tools (NumPy, Pandas, Matplotlib, Scikit-learn). His expertise also extends to aerospace engineering, mechatronics, embedded systems, and sensor fusion.\n\nBased in both Palo Alto, CA and Las Vegas, NV, Yohannes represents a unique blend of technical depth across hardware engineering, aerospace, machine learning optimization, and venture capital experience - making him a versatile contributor to the AI and technology ecosystem."
}