{
    "id": "advaitiyer",
    "name": "Advait Iyer",
    "profile_pic": "https://static.licdn.com/aero-v1/sc/h/9c8pery4andzj6ohjkjp54ma2",
    "links": [
        "https://advaitiyer.com",
        "https://github.com/adviyer",
        "https://x.com/advaitsi",
        "https://www.linkedin.com/in/advaitiyer"
    ],
    "short_description": "Computer Engineer with expertise in computer systems, specializing in hardware and software engineering. Currently a Software Engineer at Tesla with research experience in GPU-accelerated data analytics, and a published paper on overcoming memory capacity limitations in large-scale data analytics.",
    "long_description": "Advait Iyer is a Computer Engineer with a strong focus on computer systems and hardware design. He graduated from the University of Michigan with a Bachelor of Science in Engineering in 2024. Advait has built an impressive career trajectory, currently working as a Software Engineer at Tesla while also contributing to academic research.\n\nHis technical expertise spans C/C++, Verilog/SystemVerilog, and Python, with a particular interest in computer architecture and systems design. At Tesla, Advait has worked on several significant projects including the revamped on-screen PRND gear slider for the 2024 Model 3 released in Europe and China, navigation and controls features, and a performance monitoring library for the infotainment system. He also contributed to the development of the new weather feature for the 2024 summer release.\n\nAs a Hardware Engineer at Aethero, Advait helped build space-rated edge AI computers, demonstrating his versatility across both software and hardware domains. His academic contributions include serving as an Instructional Assistant for Advanced Computer Architecture (EECS 470) and Digital Logic Design (EECS 270) at the University of Michigan. In the Computer Architecture course, he taught lab sections on hardware design using SystemVerilog and helped students design synthesizable out-of-order RISC-V processors. For the Logic Design course, he co-created and maintained the course's RTL DV platform deployed on autograder.io using Docker, which was used by approximately 300 computer engineering students per semester.\n\nAdvait's research as a Research Assistant in the CE Lab at the University of Michigan focused on GPU acceleration for heterogeneous LLM/DB workloads, resulting in a publication titled \"Vortex: Overcoming Memory Capacity Limitations in GPU-Accelerated Large-Scale Data Analytics\" accepted to VLDB 2025.\n\nHis impressive project portfolio includes a 94 MHz RISC-V CPU with P6 style renaming and N-way superscalar design, a foldable cloth piano, formal verification of a fault-tolerant cache coherence protocol, and various FPGA design projects. He has also worked on robotic planning and controls projects and numerous C/C++ projects including a RISC-V assembler, simulator, and linker.\n\nBeyond his technical pursuits, Advait has explored entrepreneurship and venture capital as a Venture Partner at Contrary for over three years. He has also worked at Marathon Digital Holdings (MARA) as an Engineering Intern optimizing merged mining protocols, and contributed to Zepto (formerly KiranaKart, YC W21) in operations, growth, and engineering roles.\n\nAdvait has also written about the intersection of data science and spirituality, exploring how machine learning concepts can provide insights into human behavior and decision-making. His writing demonstrates his ability to connect technical concepts with broader philosophical ideas.\n\nHis academic achievements include being a runner-up in the APS History of Physics Essay Contest and winning the Gold Award in the Queen's Commonwealth Essay Competition. He is multilingual, with proficiency in English, French, Hindi, and Tamil, reflecting his global perspective and communication skills."
}