{
    "id": "andrewztan",
    "name": "Andrew Tan",
    "profile_pic": "https://media.licdn.com/dms/image/v2/C5603AQGbKr_GFvC9xw/profile-displayphoto-shrink_200_200/profile-displayphoto-shrink_200_200/0/1588713934994?e=2147483647&v=beta&t=tjcRP3P0tUW_I9t-yslIvruSBoE7eHrUiK9rkmuocZ8",
    "links": [
        "https://andrewztan.com",
        "https://arxiv.org/abs/1712.05785"
    ],
    "short_description": "Andrew Tan is a Stanford University alumnus and entrepreneur focused on democratizing career growth. With a strong background in computer science and data science from UC Berkeley, he has conducted research in stock market prediction using sentiment analysis and has been recognized with numerous academic honors including Phi Beta Kappa and the EECS Honors Program.",
    "long_description": "Andrew Tan is an accomplished technologist and entrepreneur currently associated with Humans and Stanford University. He's working on democratizing access to career growth through his venture joinnova.co.\n\nAndrew has an impressive academic background, having graduated from UC Berkeley where he was part of the EECS Honors Program and was inducted into Phi Beta Kappa as a junior (top 20 students in his class). During his time at Berkeley, he excelled as a student instructor in the Data Science Department, earning recognition as an Outstanding Student Instructor.\n\nHis research interests include applying AI to financial markets, as evidenced by his publication \"Sentiment Predictability for Stocks\" where he explored stock market prediction using textual sentiment analysis tools and advanced prediction models like LSTMs and convolutional architectures.\n\nAndrew has a strong entrepreneurial spirit, having been selected for the Pear VC Summer Fellowship which provided seed investment for his early-stage startup. He was also named a Jack Larson Scholar at UC Berkeley's Haas School of Business, receiving a scholarship to pursue entrepreneurship in technology and research.\n\nHis technical talents were recognized early, being one of only 11 students nationwide awarded the Snap Research Scholarship for his academic performance, research experience, and ability to solve tough technical challenges. Before college, Andrew was the Salutatorian of his high school class and achieved success in both mathematics competitions (qualifying for AIME four times) and business competitions (placing 2nd at the DECA International Competition).\n\nAndrew is bilingual, with native English proficiency and professional working proficiency in Chinese, adding to his versatile skill set that spans technology, research, and entrepreneurship.\n\nIt's important to note that there is another prominent Andrew Tan who is a Filipino billionaire businessman. This Andrew Tan is the chairman of Alliance Global Group, Inc., a major conglomerate with interests in real estate, food and beverage, gaming, and hospitality. Born in Fujian, China, he moved to Hong Kong at age 4 and later to the Philippines as a teenager. He graduated with a degree in accounting from the University of the East in Manila and built his fortune developing large apartment complexes around Manila. His company Megaworld Corporation pioneered the \"live-work-play\" concept in township development, and he also runs Emperador, the world's largest brandy company by sales volume. As of 2024, his net worth is estimated at $1.5 billion. This is a different individual from the Andrew Tan described in the main profile."
}