{
    "id": "anirudhkotamraju",
    "name": "Anirudh Kotamraju",
    "profile_pic": "https://static.licdn.com/aero-v1/sc/h/9c8pery4andzj6ohjkjp54ma2",
    "links": [
        "https://anirudhkotamraju.com",
        "https://github.com/22anirudhk",
        "https://www.linkedin.com/in/anirudhkotamraju/",
        "https://photos.anirudhkotamraju.com"
    ],
    "short_description": "Computer Science student at UC Berkeley with a strong background in machine learning research and software engineering. Currently working on CNNs and autoencoders for Compton telescopes at the Space Sciences Laboratory while previously interning at Amazon and Lawrence Livermore National Laboratory.",
    "long_description": "Anirudh Kotamraju is a Computer Science student at UC Berkeley (2022-2026) with diverse experience spanning machine learning research, software engineering, and teaching. Since September 2022, he has been working as a Machine Learning Researcher at UC Berkeley's Space Sciences Laboratory, developing CNNs and autoencoders to approximate the image response of Compton telescopes.\n\nHis professional experience includes a Software Development Engineer internship at Amazon (Summer 2024) where he worked on full stack development for the retail division, and a Software Engineer internship at Lawrence Livermore National Laboratory (Summer 2023) focusing on cyberattack detection for TCP networks in critical U.S. infrastructure. He has also worked at One Convergence on cloud infrastructure.\n\nAnirudh has demonstrated leadership in education as a Teaching Assistant for CS61B: Data Structures at UC Berkeley since Spring 2024, and previously served as a tutor for both CS61B and CS61A courses. His academic journey also includes research in computational astrophysics at UC Santa Cruz (2021) where he built software to optimize the search for very-high-energy gamma ray bursts.\n\nHe has an impressive track record in hackathons and competitions, winning the Sustainability Grand Prize at Stanford Treehacks 2024 for developing SkySplat (drones + gaussian splatting for natural disaster response), 1st Place Eluv.io Prize at Calhacks 2022 for Artful (a physical art marketplace preventing forgery through blockchain), and being named the 2024 Bloomberg BPuzzled Challenge UC Berkeley Winner. He also developed Ember, an iOS app that predicts vivid sunsets up to nine days in advance using custom deep learning models.\n\nBeyond his technical pursuits, Anirudh founded a COVID-19 Oxygen Concentrator and Supply Fundraiser for India, showcasing his commitment to humanitarian causes. He's also a member of Launchpad, a UC Berkeley community focused on solving problems with machine learning. His comprehensive skill set spans data structures, machine learning, full-stack development, and computational research, positioning him as a versatile and accomplished technologist with both academic excellence and practical industry experience.\n\nIn his free time, Anirudh enjoys landscape photography, listening to film scores, and going on bike rides around the Bay Area."
}