{
    "id": "billqian",
    "name": "Bill Qian",
    "profile_pic": "https://media.licdn.com/dms/image/v2/D5603AQFuvpckqH_xlA/profile-displayphoto-shrink_200_200/profile-displayphoto-shrink_200_200/0/1671856178480?e=2147483647&v=beta&t=O22AHOlZfVDbUBNhxCILRBfEShje3nUY4s0sqA57KJA",
    "links": [
        "https://lilbillbiscuit.com",
        "https://www.linkedin.com/in/billqian/",
        "https://cyphercapital.com",
        "https://www.ton.org"
    ],
    "short_description": "Yale '26 computer science student in the BS/MS program with a background in competitive programming and mathematics. Currently researching LLMs and code generation, with experience in systems and machine learning. Incoming Software Engineering Intern at Citadel Securities with previous roles at The New York Times and Yale's Gerstein Laboratory. Also serves as Chairman of Cypher Capital, a prominent multi-strategy crypto investment firm.",
    "long_description": "Bill Qian is a computer science student at Yale University (Class of 2026) pursuing a combined BS/MS degree. His technical foundation stems from competitive programming (USACO/ICPC) and mathematics (USAMO/Putnam), which has evolved into expertise in systems, machine learning, and full-stack development.\n\nAt Yale's Gerstein Laboratory, Bill has established himself as a researcher in Large Language Models and code generation, publishing multiple papers in natural language processing. His research contributions include work on \"ToolLLM: Facilitating Large Language Models to Master 16000+ Real-world APIs\" and \"BioCoder: A Benchmark for Bioinformatics Code Generation with Contextual Pragmatic Knowledge.\" He has collaborated with researchers from prominent organizations including Google DeepMind.\n\nBill's professional experience spans diverse environments. He's secured an upcoming Software Engineering Internship at Citadel Securities (New York) focusing on high-performance C++. Previously, he worked at The New York Times on their Research and Development team, exploring ethical applications of AI and LLMs in journalism. At DeepMedia, he designed and optimized algorithms for heterogeneous data analysis, creating a machine translation model with 10% better performance than competitors using Transformers, Python, PyTorch, and Rust.\n\nHis technical versatility extends to infrastructure development, having designed distributed computing systems using AWS, Azure, and on-premise hardware with Docker, Kubernetes, and SQS. At Thomas Ho Company, he applied neural networks to assess mortgage loan pricing models and implemented ETL pipelines that improved data processing efficiency by 30%.\n\nBeyond his technical pursuits, Bill is actively involved in campus life as a Project Manager at the Student Technology Collaborative, where he manages knowledge base development and provides technical support across multiple operating systems. He balances his technical interests with creative outlets, singing with the Yale Glee Club and making short films.\n\nIn parallel to his academic career, Bill serves as the Chairman of Cypher Capital, a leading multi-strategy crypto investment firm based in the UAE. Before joining Cypher Capital in 2022, he was the Global Head of Fundraising, Binance Labs, and M&A for Binance, the world's largest cryptocurrency platform. Prior to that, he was Head of Investment for Fintech and Technology at JD.com, a leading Asian internet platform generating over $400 billion in annual gross merchandise volume.\n\nThroughout his career in the blockchain and cryptocurrency sectors, Bill has deployed and managed over $30 billion in investments across AI, cryptocurrency, and fintech. He has successfully invested in prominent blockchain projects including Solana, Mysten Labs (Sui), Ton, Sei, and Bouncebit. He also serves on the board of the TON Foundation and is Managing Director and Chief Investment Officer of Phoenix Group (ADX: PHX), the first cryptocurrency company to go public in the Middle East.\n\nBill holds a Bachelor of Engineering from Shanghai Jiao Tong University, an MSc in Finance from Nanyang Technological University, and an MBA from the University of Toronto. He is also an executive committee member of the Hillhouse Value Investing Institution.\n\nHis unique combination of deep technical expertise in computer science, extensive experience in blockchain investment, and leadership in the cryptocurrency industry positions him as a multifaceted contributor across both academic and professional domains."
}