[
  {
    "fullName": "Rishi Sai Sadanandan",
    "linkedin_internal_id": "1157362793",
    "first_name": "Rishi",
    "last_name": "Sai Sadanandan",
    "public_identifier": "rishi-sadanandan",
    "background_cover_image_url": "https://media.licdn.com/dms/image/v2/D4E16AQEpkoBrm9efbw/profile-displaybackgroundimage-shrink_200_800/profile-displaybackgroundimage-shrink_200_800/0/1730959526622?e=2147483647&v=beta&t=ymPllxksEpPoqaDKzqW-psMojcJXKV0ks7g5Ypd7_tA",
    "profile_photo": "https://media.licdn.com/dms/image/v2/D5603AQHTBs3bDE7GJA/profile-displayphoto-shrink_200_200/profile-displayphoto-shrink_200_200/0/1701659909011?e=2147483647&v=beta&t=J1vo2OakSsrx6MuOgZqYadQtcDst6QZRPESnKixRzis",
    "headline": "CS(AI) + Math | Stanford University",
    "location": "4K followers\n          \n          \n              500+ connections",
    "followers": "Issued Dec 2023",
    "connections": "Issued Dec 2023",
    "about": "✯ Hello there! Welcome to my LinkedIn profile! I'm thrilled to connect with like-minded individuals in the dynamic world of technology and innovation. As a passionate and aspiring college student, I am embarking on an exciting journey into the realms of Computer Science, with a focus on the AI track and Product Design. My insatiable curiosity and desire to make an impact drive me to explore the intersection of these fields and the endless possibilities they offer in shaping the future.✯ Throughout my academic pursuit, I am determined to equip myself with cutting-edge technical skills, leveraging my Computer Science education to delve into the fascinating realm of Artificial Intelligence. The potential of AI to transform industries and drive innovation is awe-inspiring, and I'm eager to be part of this transformative journey.✯ Additionally, my interest in Product Design fuels my ambition to understand user behavior and create meaningful experiences through innovative and intuitive products. I believe that combining the principles of design with technological expertise can revolutionize the way we interact with technology and solve real-world problems. I am actively seeking opportunities that align with my interests, where I can immerse myself in the world of product development and startups.✯ I have demonstrated expertise in prioritizing and managing multiple projects within specifications and budget restrictions. I am capable of building consensus among stakeholders to provide breakthrough product strategies and transform complex project initiatives into achievable goals.✯ Furthermore, I have also served as a Science, Writing Center, Berkeley Academy, and Peer Tutor to educate from 9th to 12th standards students about Physics, Chemistry, Biology, or any other science-related subjects.My broad skills include:→ Strategic Planning & Execution→ Product Lifecycle Management→ Continuous Process Improvement→ Requirements & Gathering Analysis→ Troubleshooting & Debugging→ Team Collaboration  Let's connect and explore the possibilities of collaboration, knowledge-sharing, and building a brighter future through technology and design. Whether you're a fellow enthusiast or an industry professional, I'd love to hear from you!Email: rishi.sadanandan25@gmail.com",
    "experience": [
      {
        "position": "Pear VC Fellow",
        "company_url": "https://www.linkedin.com/company/pear-vc?trk=public_profile_experience-item_profile-section-card_subtitle-click",
        "company_image": "https://media.licdn.com/dms/image/v2/D560BAQFSlreFuDK-kQ/company-logo_100_100/company-logo_100_100/0/1724194795145/pear_vc_logo?e=2147483647&v=beta&t=CaM5fddHZ-vQXtrsUTXL6cKmg-ZY2nhWPB2IepMA-Jc",
        "company_name": "Pear VC",
        "location": "Palo Alto, California, United States",
        "summary": "Working closely with Khalil Fuller (Head of Dorm & Partner at Pear VC) to identify and support high-potential early-stage founders. Leading Pear’s Green Light program at Stanford, sourcing and evaluating up to 10 promising startups for early investment, managing due diligence, and driving deal flow.",
        "starts_at": "Dec 2024",
        "ends_at": "Present",
        "duration": "4 months"
      },
      {
        "position": "VC Analyst",
        "company_url": "https://www.linkedin.com/company/stanford-social-entrepreneurial-students-association?trk=public_profile_experience-item_profile-section-card_subtitle-click",
        "company_image": "https://media.licdn.com/dms/image/v2/C4D0BAQE1p9JVw5oZyg/company-logo_100_100/company-logo_100_100/0/1631310810651?e=2147483647&v=beta&t=eq9OAeDIwS1CabsnPPEpEAxMwsm1l06BjFP9RSMzvTM",
        "company_name": "Stanford Social Entrepreneurial Students'​ Association",
        "location": null,
        "summary": "Working with a team of 12 to raise and manage a fund, meet with different VCs in the Bay each week, & build a unique thesis throughout the year.",
        "starts_at": "Oct 2024",
        "ends_at": "Present",
        "duration": "6 months"
      },
      {
        "position": "Co-Founder",
        "company_url": "https://www.linkedin.com/company/pocketchangedigital?trk=public_profile_experience-item_profile-section-card_subtitle-click",
        "company_image": "https://media.licdn.com/dms/image/v2/D4E0BAQGMzGs6d5xBKA/company-logo_100_100/company-logo_100_100/0/1696367518814?e=2147483647&v=beta&t=sc3ajheAIJ5GhdBuIG_bDqn-cIVW2n4fc4OVzGWII58",
        "company_name": "PocketChangeDigital",
        "location": null,
        "summary": "Stealth Startup",
        "starts_at": "Jun 2024",
        "ends_at": "Present",
        "duration": "10 months"
      },
      {
        "position": "President",
        "company_url": "https://www.linkedin.com/company/remandcompany?trk=public_profile_experience-item_profile-section-card_subtitle-click",
        "company_image": "https://media.licdn.com/dms/image/v2/C560BAQFcErfdt6buXA/company-logo_100_100/company-logo_100_100/0/1654720316816/remandcompany_logo?e=2147483647&v=beta&t=mbBLLva8HRh7voL2RaB2Rjt9Yk0OIk2Ef8QSR51Loz0",
        "company_name": "Rem and Company",
        "location": null,
        "summary": "In a crucial role within the national consulting club, Rem & Company - Stanford, I spearhead a team of three strategists, dedicated to rejuvenating small businesses with strategic, data-driven solutions. My leadership is defined by a commitment to quantifiable success and optimal resource management.✯ Strategic Leadership & Financial Acumen: Guided small businesses, including a sports industry platform, in reallocating their budgets to maximize efficiency and impact. For one client, we optimized a $5000 monthly budget, achieving significant cost savings while facilitating the integration of essential services like a Marketing VA and legal expertise, markedly enhancing operational capabilities.✯ Communication & Analytical Research: As the central point of contact, I ensured a 100% client awareness rate, maintaining transparent and regular communication. Utilized data analytics to drive our strategies, resulting in tailored solutions that addressed specific client needs and market dynamics.✯ Team Management & Empowerment: Led and empowered a team of strategists, creating a culture of innovation and collaborative problem-solving. Our collective efforts have resulted in the development and implementation of comprehensive strategies that have significantly boosted client market presence and operational efficiency.With a strategic approach and a focus on delivering measurable results, my role is pivotal in transforming business challenges into growth opportunities, steering clients toward sustained success and market prominence.\n            \n\n    \n    \n\n    \n        Show less",
        "starts_at": "Oct 2023",
        "ends_at": "Present",
        "duration": "1 year 6 months"
      },
      {
        "position": "Creator and Product Designer - 2 patents(Utility & Design)",
        "company_image": "https://static.licdn.com/aero-v1/sc/h/cs8pjfgyw96g44ln9r7tct85f",
        "company_name": "Advanced AquaPods- Underwater Ear Pod System",
        "location": null,
        "summary": "A revolutionary underwater ear pod system designed to enhance the aquatic experience by enabling audio communication and music listening. By integrating innovative features such as emergency SOS signals and waterproofing, it aims to create a seamless connection between underwater activities and auditory experiences. This is made possible through meticulous design, engineering, and problem-solving.As the Creator, Head, and Primary Product Designer & Engineer, I am driving the groundbreaking vision for the Advanced AquaPods, steering the path from conceptualization to realization through pioneering leadership.✯ Innovation and Conceptual Design: Leading the ideation of the multifunctional underwater ear pod system, utilizing cutting-edge design principles to create a product that balances functionality, safety, and portability.✯ Design & Engineering Development: Collaborating with team members to design and engineer the waterproof structure, envisioning and crafting the vital physical components that form the system's unique capabilities.✯ Strategic Patenting: Navigating the intellectual property landscape to secure patent rights for the Advanced AquaPods, ensuring protection and recognition of the innovative aspects of the underwater ear pod system.✯ Prototyping & Quality Assurance: Establishing rigorous prototyping and testing procedures, attracting skilled engineers, and aligning with the product's quality and performance objectives.✯ Community Outreach and Safety Considerations: Emphasizing safety and convenience in aquatic environments, manifesting not just in the product design but also in active engagement with the swimming and diving communities to understand their needs and preferences.\n            \n\n    \n    \n\n    \n        Show less",
        "starts_at": "Jun 2022",
        "ends_at": "Present",
        "duration": "2 years 10 months"
      },
      {
        "position": "Social Impact Head Associate & Client Project Strategist & SBI: Freshman 2023/2024 Cohort",
        "company_url": "https://www.linkedin.com/company/stanford-pre-business-association?trk=public_profile_experience-item_profile-section-card_subtitle-click",
        "company_image": "https://media.licdn.com/dms/image/v2/C4D0BAQE3J6ebPjuHtQ/company-logo_100_100/company-logo_100_100/0/1630514575895?e=2147483647&v=beta&t=-pBj8ALBKWqRtX5XBSv31faTyEhx1GQW3HwT7LoeaVQ",
        "company_name": "Stanford Pre-Business Association",
        "location": "Stanford, California, United States",
        "summary": "✦ Consulted for a premier international women's non-profit, chosen via rigorous competition, to work closely with the CFO & CPO on enhancing brand development, global recognition, and grant support, profoundly impacting safety and empowerment for millions of women worldwide.✦ Chosen for a highly competitive 30-person cohort, I received personalized mentorship in Consulting, Marketing, and Finance, including direct, invaluable guidance from Thomas Krueger, the former Intel Director and current CEO of Synel Americas, enriching my business acumen.\n            \n\n    \n    \n\n    \n        Show less",
        "starts_at": "Oct 2023",
        "ends_at": "Present",
        "duration": "1 year 6 months"
      },
      {
        "position": "SAT/ACT Test Preparation Specialist",
        "company_url": "https://www.linkedin.com/company/wyzant-tutoring?trk=public_profile_experience-item_profile-section-card_subtitle-click",
        "company_image": "https://media.licdn.com/dms/image/v2/C510BAQGxLgZLTHoBmw/company-logo_100_100/company-logo_100_100/0/1631383134007?e=2147483647&v=beta&t=BBIM9z8Qb1NcTG_8Mp41JuxM6mgsKtIRjf8W6hIWCk4",
        "company_name": "Wyzant",
        "location": null,
        "summary": "At Wyzant, I specialize in tailored SAT/ACT preparation for a diverse array of students. My approach is rooted in a deep understanding of both exams, and I draw upon my own academic excellence and vast tutoring experience to guide my students effectively. Highlights of my role include:✯ Personalized Curriculum Development: Craft bespoke study plans for each student, taking into account their individual strengths, areas for improvement, and learning styles.  ✯ Diagnostic Assessments: Administer diagnostic tests to gauge students' initial standings, followed by periodic assessments to measure progress and recalibrate strategies accordingly.  ✯ Strategy Implementation: Introduce proven test-taking strategies that emphasize accuracy, efficiency, and time management. This ensures that students are not only knowledgeable but also effective in navigating the intricacies of the exams.  ✯ Consistent Feedback & Improvement: Conduct regular feedback sessions post-practice tests, translating insights into actionable steps for continuous advancement.  ✯ Student Success Stories: Proud to have guided numerous students in achieving significant score improvements, bolstering their chances at gaining admission into their dream universities.My commitment goes beyond just tutoring; I am passionate about instilling confidence in my students and empowering them to perform at their academic best.\n            \n\n    \n    \n\n    \n        Show less",
        "starts_at": "Jul 2023",
        "ends_at": "Present",
        "duration": "1 year 9 months"
      },
      {
        "position": "Finance Intern",
        "company_url": "https://www.linkedin.com/company/l3harris-technologies?trk=public_profile_experience-item_profile-section-card_subtitle-click",
        "company_image": "https://media.licdn.com/dms/image/v2/C4D0BAQEB2mPDbj_TDA/company-logo_100_100/company-logo_100_100/0/1630457187752/l3harris_technologies_logo?e=2147483647&v=beta&t=99t9gMORoymfWhtG5jqAk3No-e1Iyov9PCqQ2dNm8_w",
        "company_name": "L3Harris Technologies",
        "location": "Melbourne, Florida, United States",
        "summary": "During my summer internship at L3Harris Technologies, a global aerospace and defense technology innovator, I will be engaging in a range of financial analysis and reporting tasks that support strategic decision-making across the company. Here are some key highlights of my role and what I aim to achieve:✯ Financial Analysis and Modeling: Apply quantitative techniques to analyze data and make recommendations that influence the company's strategic direction.✯ Budgeting and Forecasting: Assist in the development of budget models and financial forecasts, contributing to the financial planning efforts that support L3Harris's growth.✯ Operational Support: Work closely with finance and business unit leaders to provide analytical support for projects, improving operational efficiencies and cost control.✯ Cross-Functional Collaboration: Engage with teams across the company to gain a holistic understanding of L3Harris's operations and the aerospace and defense industry.✯ Professional Development: Learn from seasoned finance professionals and leaders within L3Harris, enhancing my financial acumen and industry knowledge.I look forward to contributing to the L3Harris team, leveraging my skills in financial analysis to support the company's mission of providing advanced defense and commercial technologies across air, land, sea, space, and cyber domains. This internship represents an incredible opportunity to grow professionally and make meaningful contributions to a leading company in the aerospace and defense sector.\n            \n\n    \n    \n\n    \n        Show less",
        "starts_at": "Jun 2024",
        "ends_at": "Aug 2024",
        "duration": "3 months"
      },
      {
        "position": "Growth Intern",
        "company_image": "https://static.licdn.com/aero-v1/sc/h/cs8pjfgyw96g44ln9r7tct85f",
        "company_name": "Cyrano AGI",
        "location": "Palo Alto, California, United States",
        "summary": "Accelerated market presence by spearheading Alpha and Beta testing at Stanford and rapidly expanding our user base. Working closely with the CEO, I deepened my understanding of advanced AI algorithms—particularly NLP and adaptive learning—and leveraged real-world data to refine Cyrano’s emotional response accuracy. Through strategic A/B testing and iterative product improvements, I drove meaningful product adoption and positioned Cyrano for sustained growth.",
        "starts_at": "Mar 2024",
        "ends_at": "Jun 2024",
        "duration": "4 months"
      },
      {
        "position": "Captain Varsity Tennis (12th)",
        "company_url": "https://www.linkedin.com/school/berkeleyprep/?trk=public_profile_experience-item_profile-section-card_subtitle-click",
        "company_image": "https://media.licdn.com/dms/image/v2/C4E0BAQGMUh7FWdSebw/company-logo_100_100/company-logo_100_100/0/1658427166811?e=2147483647&v=beta&t=N1U2iPhjkpv0-9cQ1P7b-p9Ln0moCZOwv67guw5VSaE",
        "company_name": "Berkeley Preparatory School",
        "location": null,
        "summary": "As an Athlete, I have improved my knowledge and capabilities by regularly attending practices. I have successfully competed in tournaments biweekly. Won various district and regional events. I was also a State Quarter Finalist. Maintained a near-perfect record in singles matches, leading my team to the Regional finals during my last season.",
        "starts_at": "2019",
        "ends_at": "2023",
        "duration": "4 years"
      },
      {
        "position": "Data Implementation Intern",
        "company_url": "https://www.linkedin.com/company/repfabric?trk=public_profile_experience-item_profile-section-card_subtitle-click",
        "company_image": "https://media.licdn.com/dms/image/v2/C4E0BAQFv_RGIDjHYnw/company-logo_100_100/company-logo_100_100/0/1649222536654/repfabric_logo?e=2147483647&v=beta&t=qvghzjTU-z3jKKxy5kuvMObK_UTVcL455zxbcbRPFrc",
        "company_name": "Repfabric",
        "location": null,
        "summary": "As a Data Implementation Intern, I translated data-driven insights into actionable solutions, driving organizational efficiency and informed decision-making. Furthermore, I was conceptualizing, planning, and designing user interfaces by gathering and evaluating data with a keen focus on optimizing the efficiency of sales representatives through the utilization of RepFabric interface technology.",
        "starts_at": "Aug 2022",
        "ends_at": "Dec 2022",
        "duration": "5 months"
      },
      {
        "position": "Undergraduate Classics Research",
        "company_url": "https://www.linkedin.com/school/usouthflorida/?trk=public_profile_experience-item_profile-section-card_subtitle-click",
        "company_image": "https://media.licdn.com/dms/image/v2/D4E0BAQHwsMY_NU98iw/company-logo_100_100/company-logo_100_100/0/1686165874965/usouthflorida_logo?e=2147483647&v=beta&t=DIeNfTzvcniVexjMyJX-TkELk2_5KiIZzqN8tIHgHuk",
        "company_name": "University of South Florida",
        "location": null,
        "summary": "In this role, I have conducted in-depth research with Eleni Manolaraki, USF professor of Classics on the similarities between the origin myths of Greek, Hindu, and Aztec cultures with emphasis on corruption, creation, destruction, and Gods.",
        "starts_at": "Jan 2022",
        "ends_at": "Jun 2022",
        "duration": "6 months"
      },
      {
        "position": "Intern Analyst",
        "company_url": "https://www.linkedin.com/company/ideation?trk=public_profile_experience-item_profile-section-card_subtitle-click",
        "company_image": "https://media.licdn.com/dms/image/v2/C510BAQGRACgyr1Icig/company-logo_100_100/company-logo_100_100/0/1631407426965?e=2147483647&v=beta&t=i8Vtf9O6QEv6uZDflk-jo2CME__Bum0MSUxuQHp6QiQ",
        "company_name": "Ideation Inc.",
        "location": null,
        "summary": "In this role, I have utilized Microsoft Excel for performing non-linear multivariate regression predictive analytics for FEMA flood mitigation projects. By conducting data and statistical analysis for the company, I have collected, cleaned, and organized data from various sources. Additionally, I have summarized analysis results and presented key findings to relevant teams and management, enabling evidence-based decision-making.",
        "starts_at": "Jun 2020",
        "ends_at": "Aug 2020",
        "duration": "3 months"
      },
      {
        "position": "Athlete",
        "company_url": "https://www.linkedin.com/company/usta?trk=public_profile_experience-item_profile-section-card_subtitle-click",
        "company_image": "https://media.licdn.com/dms/image/v2/D4E0BAQH9w6-PnKuXyg/company-logo_100_100/company-logo_100_100/0/1719842891125/usta_logo?e=2147483647&v=beta&t=HGOPBzUVBUP7Mtf2JYwSQ7iImifOeZIC-1KmzB6mrdI",
        "company_name": "(USTA) United States Tennis Association",
        "location": null,
        "summary": "In this role, I competed individually for state and national rankings. I have demonstrated unwavering commitment by engaging in rigorous practice sessions five days a week year-round, coupled with near-weekly tournament engagements. Following are my positions throughout my career:✯ Highest Ranking in the state of Florida: (52 in the 12 and under division) and (183 in the 14 and under division).✯ States (2014-2018) – Bobby Curtis Level 2-3 (at least 2 tournaments per year).✯ Regionals (2014-2018) - level 3-5 (at least 3-4 tournaments per year).✯ Champion and Finalist in several local tournaments in the 12’s, 14’s, and 16’s.\n            \n\n    \n    \n\n    \n        Show less",
        "starts_at": "2012",
        "ends_at": "2019",
        "duration": "7 years"
      }
    ],
    "education": [
      {
        "college_url": "https://www.linkedin.com/school/stanford-university/?trk=public_profile_school_profile-section-card_image-click",
        "college_name": "Stanford University",
        "college_image": "https://media.licdn.com/dms/image/v2/C560BAQHr9suxyJBXMw/company-logo_100_100/company-logo_100_100/0/1635534378870/stanford_university_logo?e=2147483647&v=beta&t=ZvB25L95o9w4q9drvsWxGcM49tX66Cf5LsLAxYp8rSs",
        "college_degree": "Computer Science & Economics",
        "college_degree_field": "4.053",
        "college_duration": "2023 - 2027",
        "college_activity": ""
      },
      {
        "college_url": "https://www.linkedin.com/school/berkeleyprep/?trk=public_profile_school_profile-section-card_image-click",
        "college_name": "Berkeley Preparatory School",
        "college_image": "https://media.licdn.com/dms/image/v2/C4E0BAQGMUh7FWdSebw/company-logo_100_100/company-logo_100_100/0/1658427166811?e=2147483647&v=beta&t=N1U2iPhjkpv0-9cQ1P7b-p9Ln0moCZOwv67guw5VSaE",
        "college_degree": "10 AP Classes",
        "college_degree_field": null,
        "college_duration": "2019 - 2023",
        "college_activity": "AP Calculus AB, AP Calculus BC, AP Physics 2, AP Physics C (Electricity/Magnetism), AP Physics C (Mechanics), AP Latin, AP Statistics, AP Psychology, AP English Language, and AP Macroeconomics."
      }
    ],
    "articles": [],
    "description": {
      "description1": "Pear VC",
      "description1_link": "https://www.linkedin.com/company/pear-vc?trk=public_profile_topcard-current-company",
      "description2": "Stanford University",
      "description2_link": "https://www.linkedin.com/school/stanford-university/?trk=public_profile_topcard-school",
      "description3": ""
    },
    "activities": [
      {
        "link": "https://www.linkedin.com/posts/cnbcselect_its-time-to-pull-out-those-jelly-beans-again-activity-7298384549141463043-xzZt",
        "image": "https://media.licdn.com/dms/image/v2/D4E10AQHN37ej36ZQBQ/ads-video-thumbnail_720_1280/B4EZUkRjp4GgAc-/0/1740070459662?e=2147483647&v=beta&t=TbG4-6MRUQ3RL8lquLD0zb9vSNWUbfMIPadfWnobRro",
        "title": "It's time to pull out those jelly beans again 👀 We're breaking down what your take-home pay looks like after taxes come out of your paycheck. What…",
        "activity": "Liked by Rishi Sai Sadanandan"
      },
      {
        "link": "https://www.linkedin.com/posts/anne-marie-bauer-6899692b2_i-am-excited-to-announce-that-i-have-accepted-activity-7300351538013581313-G0ER",
        "image": "https://media.licdn.com/dms/image/v2/D5622AQFiEjhk6iV90Q/feedshare-shrink_800/B56ZVAPCW0HQAg-/0/1740539439464?e=2147483647&v=beta&t=N4h6Lq8BVzheiDaKGF6WHiQTI-MsMj3P7jbk15SE8DI",
        "title": "I am excited to announce that I have accepted a Private Equity Commercial Real Estate Internship with Kennedy Investments, Inc. this summer in Tampa,…",
        "activity": "Liked by Rishi Sai Sadanandan"
      },
      {
        "link": "https://www.linkedin.com/posts/sunny-jayaram_my-5-hackathon-win-streak-ended-this-weekend-activity-7297808778014375937-ZG0T",
        "image": "https://media.licdn.com/dms/image/v2/D5622AQGidaE5ktqPwQ/feedshare-shrink_2048_1536/B56ZUcGU46GQAo-/0/1739933192872?e=2147483647&v=beta&t=E1Nzszl7FIb4QIvx6pdIajn06kkOSe_lYAzq1kNiQsI",
        "title": "My 5 hackathon win streak ended this weekend at TreeHacks, but not because I lost…\n\nAt Stanford, Sonia Bendre, Mohammad Zoraiz, and Adel Müürsepp and…",
        "activity": "Liked by Rishi Sai Sadanandan"
      },
      {
        "link": "https://www.linkedin.com/posts/ari-ramsan_at-wakoai-weve-built-nuphone-the-ai-receptionist-activity-7298922856590057472-rZov",
        "image": "https://media.licdn.com/dms/image/v2/D5605AQFFxpKwJVzvxQ/videocover-high/B56ZUr7lPyHoBs-/0/1740198810760?e=2147483647&v=beta&t=gVj2_9fD9P1kmmU-IU_l_pTnSs_nP-bzP_sKfPzVq3Y",
        "title": "At WakoAI we’ve built NuPhone, the AI Receptionist optimized for incoming calls, scheduling appointments, and customer inquiries for SMBs.\n\nWe’ve…",
        "activity": "Liked by Rishi Sai Sadanandan"
      },
      {
        "link": "https://www.linkedin.com/posts/mar-hershenson-b21395_i-am-looking-forward-to-the-march-13th-funders-activity-7298372924778979328-0aap",
        "image": "https://media.licdn.com/dms/image/v2/D5622AQHjnZ6ZbxTgRQ/feedshare-shrink_2048_1536/B56ZUkHgCdHEAs-/0/1740067701437?e=2147483647&v=beta&t=oeyq0aq1wpCrEMZsGrEcCStysQeRKCfM0B_35VwzJjo",
        "title": "I am looking forward to the March 13th Funders & Founders event at Carnegie Mellon University hosted by Meredith Meyer Grelli. A special treat to be…",
        "activity": "Liked by Rishi Sai Sadanandan"
      },
      {
        "link": "https://www.linkedin.com/posts/singhh5050_neuropilot-brainwave-computer-control-activity-7298189642225328128-Zru8",
        "image": "https://media.licdn.com/dms/image/sync/v2/D4E27AQG6S44suctGQg/articleshare-shrink_800/articleshare-shrink_800/0/1739745954907?e=2147483647&v=beta&t=-DxMQbtZOFFCZ9xyGOM-w8yMbxSjtAd0a3wd2ibbaTE",
        "title": "We're headed to Japan!! 🐹🌸\n\nThis weekend at TreeHacks 2025, Zeyneb Kaya, Nicole Ma, and I created NeuroPilot --- a tool that allows you to control…",
        "activity": "Liked by Rishi Sai Sadanandan"
      },
      {
        "link": "https://www.linkedin.com/posts/ayaannaveedmalik_excited-to-join-nvidia-to-work-on-inference-activity-7297776530552733704-msK1",
        "image": "https://static.licdn.com/aero-v1/sc/h/53n89ecoxpr1qrki1do3alazb",
        "title": "Excited to join NVIDIA to work on inference and agentic frameworks.",
        "activity": "Liked by Rishi Sai Sadanandan"
      },
      {
        "link": "https://www.linkedin.com/posts/bzuberi_cobot-ceo-and-former-scaleai-and-amazon-exec-activity-7296035320209317888-Zzea",
        "image": "https://media.licdn.com/dms/image/v2/D5622AQHegdfdGxix8Q/feedshare-shrink_1280/B56ZUC5dNOHsAs-/0/1739510372609?e=2147483647&v=beta&t=k8SJUiFOqykIpsTtVEIQ3byh2saPg2wwezQaO3xo0hQ",
        "title": "Cobot CEO and former ScaleAI and Amazon exec (Brad Porter) and I planning how to build a $1 Trillion company in robotics. It is inevitable! \n\nHim…",
        "activity": "Liked by Rishi Sai Sadanandan"
      },
      {
        "link": "https://www.linkedin.com/posts/sazzad14_techhiring-fullstack-react-activity-7295532666425094146-ZyTN",
        "image": "https://media.licdn.com/dms/image/v2/D5622AQFXeY6QSLfFSg/feedshare-shrink_800/B56ZT7wTF9GUAg-/0/1739390531281?e=2147483647&v=beta&t=UHmgPWpfEJyRTV9yxJAUEVltagw1mDPQkLG8-JE_EgA",
        "title": "💎 ⚡️ {Hiring Founding Full Stack Engineer | $15,000 Referral Bonus} ⚡️ 💎\n\nThe world’s best teams spend hundreds of hours on busywork. Delve is on a…",
        "activity": "Liked by Rishi Sai Sadanandan"
      },
      {
        "link": "https://www.linkedin.com/posts/willowvoice_willow-voice-is-now-on-linkedin-typing-activity-7294617854526533634-sLcu",
        "image": "https://static.licdn.com/aero-v1/sc/h/53n89ecoxpr1qrki1do3alazb",
        "title": "Willow Voice is now on Linkedin! \n\nTyping is outdated. We're excited to help you write 3x faster by making voice your new keyboard—and soon, your new…",
        "activity": "Liked by Rishi Sai Sadanandan"
      },
      {
        "link": "https://www.linkedin.com/posts/stanford-bases_big-news-from-the-bases-community-pablo-activity-7294604036433940480-v1xX",
        "image": "https://media.licdn.com/dms/image/v2/D4D22AQGJ8aaRlTbelg/feedshare-shrink_2048_1536/B4DZTujrlDHIAs-/0/1739169122588?e=2147483647&v=beta&t=KRmpwQCfl0AfnrfB0odWt5MkHYthTtRbt8nwCEP5scg",
        "title": "Big news from the BASES community! \n\nPablo Bermudez-Canete and Tannen Hall, former BASES Startup Development team members are now Y Combinator…",
        "activity": "Liked by Rishi Sai Sadanandan"
      },
      {
        "link": "https://www.linkedin.com/posts/pejman_the-power-of-belief-a-thank-you-to-bobby-activity-7294396644458971136-YbZc",
        "image": "https://media.licdn.com/dms/image/v2/D5622AQE4xRxG_jx4qg/feedshare-shrink_800/B56ZTrm_bYHsAg-/0/1739119681591?e=2147483647&v=beta&t=qheeBdNJLzAf855SSHynCyqA4PEDIpuU28O7n_OC2bY",
        "title": "The Power of Belief: A Thank You to Bobby Yazdani\n\n15 years ago, I was at a crossroads. I had a dream of starting my own business, but fear and…",
        "activity": "Liked by Rishi Sai Sadanandan"
      }
    ],
    "volunteering": [
      {
        "company_position": "Founder",
        "company_name": "50th Service Award Project/Non-Profit Organization - A Dead Language Comes Alive",
        "company_duration": "",
        "starts_at": "Jan 2022",
        "ends_at": "Present"
      },
      {
        "company_position": "Academy Teacher",
        "company_name": "Berkeley (Summer 2021)",
        "company_duration": "",
        "starts_at": "Jun 2021",
        "ends_at": "Jul 2021"
      },
      {
        "company_position": "Writing Center Tutor (12th), Berkeley Academy Tutor (12th), Science Tutor (10th, 11th, 12th), and Peer Tutor (10th, 11th, 12th)",
        "company_name": "Tutor",
        "company_duration": "",
        "starts_at": "2021",
        "ends_at": "2023"
      },
      {
        "company_position": "Academic Tutor",
        "company_name": "Ravenswood Reads",
        "company_duration": "",
        "starts_at": "Jan 2024",
        "ends_at": "Mar 2024"
      }
    ],
    "certification": [
      {
        "company_image": "https://media.licdn.com/dms/image/v2/D4E0BAQE2cylFXUf5Gw/company-logo_100_100/company-logo_100_100/0/1687269732756/python_dev_logo?e=2147483647&v=beta&t=8Qd5obHoFEMDcNnIgTD1NzuORl0GkZV1yM0-QqBrc9o",
        "certification": "[PCEP-30-02] PCEP – Certified Entry-Level Python Programmer",
        "company_url": "https://uk.linkedin.com/company/python-dev?trk=public_profile_profile-section-card_image-click",
        "company_name": "Python Developer",
        "issue_date": "Issued Dec 2023",
        "credential_id": "See credential",
        "credential_url": "https://www.credly.com/badges/6d022db5-9646-4ca8-a608-b17d55fbaca4/linked_in_profile?trk=public_profile_see-credential"
      }
    ],
    "people_also_viewed": [
      {
        "link": "https://www.linkedin.com/in/saifishoof?trk=public_profile_relatedPosts_face-pile-cta",
        "name": "",
        "summary": "Saif Ishoof\n        \n              \n          Miami Tech: @A16Z’s Exit - Setback or Setup for Reinvention?\n\nYes, A16Z is a titan in Venture Capital, but Miami's story isn't defined by one player.\n\n🔭 Let's zoom out & consider the real game-changers for Miami. \n\n•Commercializing university research.🔬 \n•Developing homegrown talent pipeline. 👩‍🎓\n•Supporting VCs who are committed to the long journey of Florida & Miami’s innovators.💡\n• Leveraging Miami's unique place as a testing ground for ideas, especially at pre-seed. 🌊 \n•Ensuring Miami is a place with sufficient opportunity on ramps. 📈\n\nMiami's diversity, global connections, increasing status as a hub of capital remain unmatched. This reset could be our catalyst for a more resilient, diversified tech ecosystem.\n\nJust this week we saw Miami founder, Joey Levy have a successful exit of Simplebet to DraftKings Inc.  \n\nWe win as an ecosystem when we play to our own unique strengths, not when we try to duplicate other players like SF or NYC. \n\nWe are running our own race 🚀",
        "location": "55\n              \n            \n      \n  \n                  \n                  \n                  \n                  \n                  \n                  \n                  \n            \n      \n        \n                10 Comments"
      },
      {
        "link": "https://uk.linkedin.com/in/ibrahim-uddin-934a31a2?trk=public_profile_relatedPosts_face-pile-cta",
        "name": "",
        "summary": "Ibrahim Uddin\n        \n              \n          I’m excited to share that I’ve decided to document my journey as I build FinchTech AI into a successful startup. I’ll be sharing what I’ve done so far, my weekly goals, the challenges I face, and the successes I achieve along the way; the good, the bad, and the ugly.\n\nSo far, I’ve built my initial website from scratch, established the FinchTech AI brand, and begun developing the MVP for my first AI tool, CalculAI. This tool is designed to assist engineers in selecting the best materials and manufacturing processes. It’s already functional, with a conversational interface that can handle basic material selection tasks, though there’s still work to do.\n\nWhat I’ve Accomplished:\n\n\t•\tTrained and integrated a RandomForestClassifier model for material recommendations.\n\t•\tBuilt a conversational interface for user interaction.\n\t•\tImproved the AI’s ability to handle different scenarios and make better recommendations.\n\nThis Week’s Focus:\n\n\t•\tEnhancing the AI’s decision-making with a decision tree structure.\n\t•\tImproving scenario recognition to make the AI more intuitive.\n\t•\tImplementing a hybrid approach to better guide users through complex decision-making.\n    • Start the build of website 2.0.\n\nLong-Term Goals:\nMy vision is to launch CalculAI as a valuable tool for the engineering industry, secure funding to expand my team, and develop additional AI tools to address other engineering challenges.\n\nChallenges:\nWith no technical background in software development and experience as a project manager in the engineering industry, I’ve self-taught myself web design and AI development. The journey has been filled with obstacles; many times I’ve wanted to quit, but each day I pushed a little further. Today, I’m proud to say I have a working AI tool, even if it’s just the bare minimum right now (Plan to show a demo later this week) 🚀 .\n\nI’m inviting you all to join me on this journey. If you have advice, I’m all ears, and if you have questions, I’m happy to answer. Let’s connect, share insights, and support each other as we navigate the startup world.\n\n#AI #Startup #Engineering #MachineLearning #TechInnovation #Entrepreneurship #ProductDevelopment #Resilience #Leadership #Innovation",
        "location": "4\n              \n            \n      \n  \n                  \n                  \n                  \n                  \n                  \n                  \n                  \n            \n      \n        \n                1 Comment"
      },
      {
        "link": "https://in.linkedin.com/in/avirup-sinha-b1536b145?trk=public_profile_relatedPosts_face-pile-cta",
        "name": "",
        "summary": "Avirup Sinha\n        \n              \n          🚀 Unlocking the nuances of Product Market Fit (PMF) is key to building successful ventures. It's not just about creating value; it's about capturing it effectively. In the world of startups and innovation, the VC2 framework offers a lens to understand this dynamic interplay.\n\nAt its core, PMF is about delivering a product that resonates deeply with customers while addressing a specific market need. But let's dive deeper. PMF extends beyond mere satisfaction, but also validate revenue models, ensuring your offering can be monetized successfully.\n\nHere's where the distinction between creating and capturing value becomes pivotal. To capture value, you must first create it. \nIn the realm of macroeconomics, value creation translates to enhancing customer experiences in B2C scenarios or boosting profitability for B2B entities. Pricing models play a crucial role here, as they must strike a balance between delivering value and capturing it.\n\nUltimately, the success of any product hinges on its ability to generate sustainable revenue. If a product or service fails to do so, its long-term viability comes into question. \n\nIn essence, PMF isn't just about creating buzz; it's about building a solid foundation for sustainable growth. By understanding the intricate dance between value creation and capture, entrepreneurs can steer their ventures towards lasting success. \n\nCourtesy : Harvard Kennedy School and The Lean Product Playbook.\n\n#ProductMarketFit #BusinessStrategy #Entrepreneurship #VC2",
        "location": "5"
      },
      {
        "link": "https://www.linkedin.com/in/industrialtransformationandsupplychaintechnology?trk=public_profile_relatedPosts_face-pile-cta",
        "name": "",
        "summary": "Brian Laung Aoaeh, CFA\n        \n              \n          #ObsessivelyEnthusiasticInvestor #UnreasonablyEnthusiasticInvestor #IrrationallyEnthusiasticInvestor at REFASHIOND Ventures: The Industrial Transformation Fund.\n\nWe look for the people we believe are doing the best work in Industrial Transformation & Supply Chain Technology; Attempting the impossible. \n\nThen we go all-in on them. With obsessive and unreasonable enthusiasm.\n\nJoin us.\n\n#IndustrialTransformation #SupplyChain #Innovation #Technology #Startups #VentureCapital #DemandTheImpossible #UnreasonableEnthusiasm #ObsessiveEnthusiasm #IrrationalEnthusiasm",
        "location": "4"
      },
      {
        "link": "https://www.linkedin.com/in/gabrieljarrosson/en?trk=public_profile_relatedPosts_face-pile-cta",
        "name": "",
        "summary": "Gabriel Jarrosson\n        \n              \n          New space startups are launching left and right, and college students might soon be sending their science projects into orbit! \n\nIn this clip from Lobster Talks, Daniel Driscoll, co-founder of Elodin (YC W24), dives into the exciting Space Renaissance happening right now. From plummeting launch costs to the rise of space debris cleanup companies, the space industry is booming. But every new space venture faces a critical challenge: building reliable flight software. That's where Elodin comes in.\n\nWant to learn more about how Elodin is empowering the next generation of space explorers?\n\nListen to the full episode of Lobster Talks with Daniel Driscoll for a deep dive into:\n\n-The factors driving the Space Renaissance\n-The challenges and opportunities for new space startups\n-How Elodin's platform is making space exploration more accessible than ever\n\nListen on your fave pod platform or watch now - https://lnkd.in/eHp_WWGc\n.\n.\n.\n.\n.\n#spacerenaissance #newspace #spacetech #spaceexploration #startups #podcast #lobstertalks #elodin #flightsoftware",
        "location": "2"
      },
      {
        "link": "https://www.linkedin.com/in/gabrieljarrosson/en?trk=public_profile_relatedPosts_face-pile-cta",
        "name": "",
        "summary": "Gabriel Jarrosson\n        \n              \n          What Actually Gets You Into YC?\n\nHave you read Saad Bencherif’s recent piece about his journey to YC acceptance? His insights are fascinating.\n\nMost founders get the application process completely wrong. They think it's about perfect preparation and polished pitches.\n\nBut here's what actually worked for his team-\n\nTheir failed interview = 3 days of intense prep and mock interviews…\n• They got \"destroyed\" by Michael Seibel because they were too rehearsed, too rigid.\n\nTheir successful interview = Zero preparation.\n• But backed by a year of actually running their business, understanding their market, and knowing their numbers cold.\n\nThe difference was the deep understanding that only comes from doing the work… not a better pitch.\n\nAnother counter-intuitive insight from Saad: YC partners send rejection emails that aren't always just rejections. When they suggest pivoting \"and letting them know,\" they mean it. Many successful YC founders took this path.\n\nHis data point about application time is telling too. Each reapplication took just 30 minutes - simple progress updates rather than complete rewrites.\n\nThis matches perfectly with YC's philosophy -- spend your time building, not perfecting applications.\n\nThe real secret to getting into YC is about having a real story to tell.",
        "location": "265\n              \n            \n      \n  \n                  \n                  \n                  \n                  \n                  \n                  \n                  \n            \n      \n        \n                46 Comments"
      },
      {
        "link": "https://www.linkedin.com/in/christopherjkong?trk=public_profile_relatedPosts_face-pile-cta",
        "name": "",
        "summary": "Chris Kong\n        \n              \n          🚀 Robotics: Redesigning Industries, Transforming Tomorrow 🚀\n\nIn my latest Substack post, I explore a topic that’s not just exciting but transformative: robotics. From addressing labor shortages to reimagining entire industries, robotics is moving beyond automation into a realm of exponential possibilities.\n\nHere are a few key takeaways:\n1️⃣ The “Why Now” Moment: Robotics today is where self-driving was a decade ago—poised for exponential growth, driven by breakthroughs in AI, machine learning, and Industry 4.0.\n\n2️⃣ Critical Challenges: Data scarcity and hardware costs are significant bottlenecks, as highlighted by Freda Duan (Altimeter Capital). However, with visionary founders and bold, first-principles thinking, these challenges can transform into opportunities for breakthrough innovation.\n\n3️⃣ The Right Approach: Robotics shouldn’t just optimize workflows; it should enable full-stack transformations where robots power safer, faster, and smarter systems at scale.\n\nI had the privilege of learning from and collaborating with some brilliant minds in crafting this piece. Special thanks to Daniel Theobald (MassRobotics) and Wei Ding (Under Control Robotics) for their invaluable insights that shaped many of the themes in this post. I’m also grateful for thought-provoking past conversations with Stefan Seltz-Axmacher (Polymath Robotics), David Li (BHP Ventures), Lawrence Wong (Tesla), and the Optimus team from Tesla’s Robotaxi event, which helped me think critically about where to focus and find the right voices for deeper exploration.\n\nBig shoutout to Jaireh Tecarro and Jen Liao for their incredible feedback and support—your input made this better. 🙏\n\nIf robotics fascinates you as much as it does me, check out the post and let me know your thoughts. Would also love it if you could share this with others who might find value in it. Let’s reimagine the future together.\n\n👉 [Link in the comments]",
        "location": "43\n              \n            \n      \n  \n                  \n                  \n                  \n                  \n                  \n                  \n                  \n            \n      \n        \n                8 Comments"
      },
      {
        "link": "https://www.linkedin.com/in/christopher-s-gonzales?trk=public_profile_relatedPosts_face-pile-cta",
        "name": "",
        "summary": "Chris Gonzales\n        \n              \n          Summary: The article discusses NASA's mission to Mars to collect rocks, the growing opportunity for startups in the space industry, latest venture capital news, and a breakdown of a16z's $7.2 billion worth of new funds.\n\nKey takeaways:\nNASA's mission to Mars to collect rocks was expected to cost $11 billion and take a long time, but with open input from startups, the cost and timeline may improve.\nStartups are increasingly interested in the space industry, as shown by Two Chairs' Series C funding and Quilt's recent fundraising for heat pump work.\na16z's recent announcement of $7.2 billion worth of new funds indicates their continued success and shows they are unaffected by the current venture slowdown.\n\nCounter arguments:\nSome may argue that the cost and timeline for NASA's mission to Mars is not feasible, even with support from startups.\nWhile a growth in startups in the space industry is promising, there is still a long way to go before it becomes a major player in the startup world.\n\n#venturecapital #vc #venture #startups",
        "location": "1"
      },
      {
        "link": "https://www.linkedin.com/in/taikichung?trk=public_profile_relatedPosts_face-pile-cta",
        "name": "",
        "summary": "Taiki Chung\n        \n              \n          How you can become a Venture Capitalist … without ANY money! 🤯\n\nI sat down with Alex Pattis, the King of SPVs and the General Partner of Riverside Ventures, to break down a unique way to invest in your favorite private companies. A normal VC firm pools capital together to create a fund and invests out of that fund. The syndicate system invests in startups on a deal by deal basis! If any of that is confusing to you, and you want to start VC investing without any of your own money, make sure you listen to Ep 019 of “New to Venture”!\n\nKey Takeaways:\n\n1️⃣ Provide value first. Try your best to be helpful! Don’t just say it, find ways to do it. Many VCs are ridiculed for saying “Let me know how I can be helpful” but never actually being helpful. Try to not be that person. \n\n2️⃣ VC funds follow a 2 and 20 structure, meaning that 2% of the fund is given to the firm every year to manage the money and after the firm returns the fund they get to keep 20% of the profits. An SPV structure is similar, but there are 2 main differences. For early stage investments, the management fees are negotiable, nonexistent, a one time fee, or lower than 2%. Second, SPVs don’t have to return an entire fund's worth of capital before they see a dollar of profit, just the initial investment amount. \n\n3️⃣ Signaling plays a huge role in the world of syndicates. Since a syndicate lead has to raise money from LPs on every deal, good signaling (strong co-investors) garner more interest.\n\n4️⃣ When you’re young, you tend to be aggressive about helping with everything. Ultimately, that's a trap, be realistic with what you can actually provide and over deliver on that thing. Under promise and over deliver.\n\n5️⃣ Staying top of mind is difficult. Some best practices include grabbing in-person coffee, quarterly calls, and posting content. Building an online presence is an underutilized method to staying top of mind!\n\nListen on Spotify: https://lnkd.in/drziG2Mt \n\nListen on Apple Podcasts: https://lnkd.in/d4dC6WmC \n\n#NewtoVenture #VentureCapital #Startups #VC #CEO #Business #Investing #recruiting #networking",
        "location": "60\n              \n            \n      \n  \n                  \n                  \n                  \n                  \n                  \n                  \n                  \n            \n      \n        \n                4 Comments"
      },
      {
        "link": "https://www.linkedin.com/in/gabrieljarrosson/en?trk=public_profile_relatedPosts_face-pile-cta",
        "name": "",
        "summary": "Gabriel Jarrosson\n        \n              \n          The average time to exit for acquisitions has jumped from 4.6 years in 2005 to 6.3 years (2024). \n\n6.3 years ago the YC 2018 Winter Batch was just wrapping up its demo day.\n\nFrom this YC cohort there were two major ($150M+) exits.\n\nSqreen - exited to Datadog for ~$250M. \nBear Flag (robotics) - exited to John Deere for ~$250M\n\nAs the exit landscape evolves, I am still confident YC remains one of the best sources for outsized returns.",
        "location": "28\n              \n            \n      \n  \n                  \n                  \n                  \n                  \n                  \n                  \n                  \n            \n      \n        \n                1 Comment"
      },
      {
        "link": "https://uk.linkedin.com/in/stuartrallan?trk=public_profile_relatedPosts_face-pile-cta",
        "name": "",
        "summary": "Stuart A.\n        \n              \n          I'm in two minds about this. 1 great progress raising that money can't fault that. 2. living in your office shows a work/life imbalance and time management problem. Of course there are going to be reasons behind those decision but the hustle culture like this can promote rapid growth and burn. Question is do we want to end up with Ash.",
        "location": ""
      },
      {
        "link": "https://www.linkedin.com/in/heradio?trk=public_profile_relatedPosts_face-pile-cta",
        "name": "",
        "summary": "Heradio Luces CEO Cocreator Dog Lover\n        \n              \n          CoCreator accepted by Microsoft for Startups Founders Hub\n \n Miami FL – June 7, 2024 – CoCreator, a pioneering AI-powered business mentorship platform launched in early 2024, announced today it has joined the prestigious Microsoft for Startups Founders Hub. \n\nThis program empowers startups revolutionizing industries with cutting-edge technologies.\n Empowering Entrepreneurs with AI.\n CoCreator empowers entrepreneurs with the guidance and support of a 24/7 AI business co-pilot. Through AI financial analysis, personalized business advice, and a library of educational content, CoCreator bridges the mentorship gap for entrepreneurs.\n Microsoft for Startups Founders Hub: A Boost for CoCreator's Mission\n \"At CoCreator, we're passionate about pushing the boundaries of what's possible. This acceptance by Microsoft represents a significant leap forward in our journey, and I'm thrilled to see the impact it will have for our users.\" - Heradio Luces, CEO. \"With Microsoft's support, we can empower even more entrepreneurs on their journeys to success.\"\n Unlocking the Potential of AI for Business Growth\n \"We're constantly exploring new ways to leverage technology at CoCreator. This announcement is just the beginning of what's to come for CoCreator, and I'm excited for the future.\" - Ramya Jayaraman CTO, CoCreator.\n By joining the Microsoft for Startups Founders Hub, CoCreator gains access to a comprehensive suite of tools and resources designed to accelerate its growth and development, including:\n Essential Tools and Technology\n \n Development and Collaboration: GitHub Actions, Microsoft Teams\n Security: Microsoft Sentinel\n Business Intelligence: Power BI\n Scalable Cloud Infrastructure: Azure App Service, Azure Functions, Azure Container Instances (ACI)\n AI Services: Azure Cognitive Services, Azure Machine Learning\n Expanded Ecosystem\n \n Financial Management: Stripe for secure payment processing\n Project Management: Mercury for streamlined financial management and Miro for visual collaboration\n Talent Acquisition: Toptal for connecting with top freelance talent\n Networking and Recruiting: LinkedIn for professional networking and recruitment\n Deal Management: Ansarada for secure and efficient deal execution\n Financial Planning and Forecasting: Forecastr for financial modeling and forecasting\n Business Consulting: EB Howard Consulting for strategic business consulting services\n Unparalleled AI Expertise\n \n Access to industry-leading technology, including the latest GPUs for efficient AI processing\n Technical guidance from Microsoft's AI specialists\n Opportunities to Collaborate\n \n Connections with industry leaders, allowing CoCreator to collaborate with other AI-focused companies and experts to accelerate development and broaden its reach. Ramya Jayaraman",
        "location": "22\n              \n            \n      \n  \n                  \n                  \n                  \n                  \n                  \n                  \n                  \n            \n      \n        \n                2 Comments"
      },
      {
        "link": "https://www.linkedin.com/in/jasoncalacanis?trk=public_profile_relatedPosts_face-pile-cta",
        "name": "",
        "summary": "Jason Calacanis\n        \n              \n          Silicon Valley Slackers: Myth or Reality?\n\nWe sat down with Menlo Ventures’ Deedy Das to discuss his viral tweet about underworked engineers earning $300K+ and the phenomenon’s broader implications.\n\nMouse Jigglers & Ghost Engineers: Deedy shares wild stories of remote workers gaming the system, from \"working\" in Mexico for years to productivity software catching patterns of inactivity.\n\nMisaligned Incentives: Deedy argues that middle managers prioritize headcount over productivity, creating an environment where underperformance is overlooked.\n\nMeasuring Productivity: Lines of code and git commits aren’t enough. Engineering productivity remains complex and difficult to quantify, so there’s no silver bullet.\n\nViral Backlash: Deedy’s anecdotes sparked heated debates in tech, with some engineers admitting to coasting while others criticized him for \"narking\" on the culture.\n\nShould companies rethink how they measure and incentivize performance?",
        "location": "37\n              \n            \n      \n  \n                  \n                  \n                  \n                  \n                  \n                  \n                  \n            \n      \n        \n                5 Comments"
      },
      {
        "link": "https://www.linkedin.com/in/christopherdaniels1?trk=public_profile_relatedPosts_face-pile-cta",
        "name": "",
        "summary": "Chris Daniels\n        \n              \n          A lot of investors have been asking me what the major industries are in the Venture Miami Built in Miami Startup Program. \n\nHere's the industry breakdown across 214 new South Florida startups.\n\nTLDR: The South Florida startups are pretty diverse across industries. \n\nHere's the largest categories in order:\n\n- 16.2% AI & Machine Learning\n- 14.2% EdTech\n- 12.2% Healthcare\n- 8.5% Marketing & Sales Tech\n- 8.1% FinTech\n- 7.4% Sustainability\n- 6.1% Travel & Hospitality \n- 6.1% E-Commerce\n\nThe smallest category: Cybersecurity at 1.2%\n\nThere's an additional 50 startups that didn't complete the survey in time but we'll get that info updated by Demo Day June 20th. \n\n#BuiltinMiami",
        "location": "86\n              \n            \n      \n  \n                  \n                  \n                  \n                  \n                  \n                  \n                  \n            \n      \n        \n                7 Comments"
      },
      {
        "link": "https://www.linkedin.com/in/ege-kaan-duman-445731173?trk=public_profile_relatedPosts_face-pile-cta",
        "name": "",
        "summary": "Ege Kaan Duman\n        \n              \n          This is what I learned as a Y Combinator alum\n\nComing out of YC, I've realized the real founder's life is about so much more than the intensity of a 3-month sprint. It's about the day-to-day grind, making tough decisions, and continuously finding ways to grow—both for your startup and for yourself.\n\nWe pivoted, we iterated, and we built. And now, we're in the next phase: talking to users, improving our product, and navigating the rollercoaster of early startup life. Some days are full of wins, and others are full of lessons.\n\nFor any founders out there wrapping up YC or thinking about applying: the end of the batch isn't the finish line. It's just the beginning of a long, challenging, and incredibly rewarding journey. Onward!\n\nLmk if you're navigating a similar path—I'd love to hear your thoughts.",
        "location": "51\n              \n            \n      \n  \n                  \n                  \n                  \n                  \n                  \n                  \n                  \n            \n      \n        \n                4 Comments"
      },
      {
        "link": "https://il.linkedin.com/in/tomer-niv?trk=public_profile_relatedPosts_face-pile-cta",
        "name": "",
        "summary": "Tomer Niv\n        \n              \n          Riddle: Bancor, Curv, and StarkWare have two things in common.\n\nOne is that these companies have built groundbreaking innovations that are critical to the web3 industry: Bancor created the first AMM in 2017, Curv pioneered MPC for digital asset custody in 2018, and StarkWare introduced ZKP for blockchain scalability in 2018.\n\nCan you guess what the second thing is?\n\n#web3 #crypto #blockchain #cryptography #zeroknowledge #startupnation",
        "location": "32\n              \n            \n      \n  \n                  \n                  \n                  \n                  \n                  \n                  \n                  \n            \n      \n        \n                10 Comments"
      },
      {
        "link": "https://www.linkedin.com/in/noahsheinbaum?trk=public_profile_relatedPosts_face-pile-cta",
        "name": "",
        "summary": "Noah Sheinbaum\n        \n              \n          So, about this \"founder mode\" thing...\n\nThe newest essay from YC founder Paul Graham.\n\nMy 2c: the best founders do one single thing:\n\nGet to product-market fit.\n\nFaster is better.\n\nBut getting there is what matters.\n\nThis can happen with a \"scientist\" or a \"bull.\"\n\nScientist: Steve Blank's \"lean\" methodology... Test hypotheses rigorously. Iterate rapidly. No sacred cows. This can be taught.\n\nBulls: Jobs. Bezos. Musk. Visionaries. Some people are born with taste. This cannot be taught. Even these luminaries are still often wrong. But their successes are massive and their personalities are world-shaping forces.\n\nFEW are actually bulls. Self-fashioning as a \"bull\" makes it more likely you will fail if you're not a generational talent (and let's be honest... most of us are not).\n\nLike everything else in the world, just know what game you're playing. \n\nSince this has been dominating Twitter, and not really permeating LinkedIn, I had to do it...\n\nGo off, let it rip in the comments...",
        "location": "25\n              \n            \n      \n  \n                  \n                  \n                  \n                  \n                  \n                  \n                  \n            \n      \n        \n                3 Comments"
      },
      {
        "link": "https://dk.linkedin.com/in/10xmks?trk=public_profile_relatedPosts_face-pile-cta",
        "name": "",
        "summary": "Mikkel K.\n        \n              \n          People overcomplicate startup fundraising\nListen, if you’re a first time founder:\n\nAvoid:\n- Long pitch decks to send out < (15 slides IMO) \n- Unreasonable financial projections\n- To much focus on your product/features\n- Not showing current competition \n\nInstead:\n- Focus on a simple pitch deck that can be skimmed (cause it will)\n- Reasonable financial projections with assumptions\n- Focus on the investment opportunity vs product\n- Show how you are unique vs competition\n\nDo this before you send out your pitch deck again. \n\nSent it out from there.\n\nInvestment is about multiplying money and getting someone to trust that you are the multiplier. \n\nSimple yet hard. \n\nIf you want the exact formula for building up a pitch deck that helped me raise over 4 mio usd. \nConnect with me and comment PD and I will sent it to you. \n\n-MK",
        "location": "9\n              \n            \n      \n  \n                  \n                  \n                  \n                  \n                  \n                  \n                  \n            \n      \n        \n                7 Comments"
      },
      {
        "link": "https://uk.linkedin.com/company/allchance?trk=public_profile_relatedPosts_face-pile-cta",
        "name": "",
        "summary": "All Chance\n        \n              \n          How to Raise a Seed Round by Babson College:\n\nRaising a seed round is a critical step for early-stage startups. Here are key insights to guide you:\n\n1) Define Your Needs: Raise enough for 12-18 months of runway, covering product development, team growth, and customer acquisition. A solid financial model will help outline your cost drivers and revenue potential.\n\n2) Build Your Pipeline: Target investors by considering their stage focus, industry expertise, and network connections. Prioritize introductions and build relationships over a few months.\n\n3) Craft a Compelling Pitch Deck: Keep it to 10 slides covering essentials like your problem, solution, market opportunity, team, and financial projections. Make it clear how funds will be used.\n\n4) Create FOMO: Approach multiple investors simultaneously to create urgency. An anchor investor can help drive momentum and set the terms.\n\n5) Prepare for Dilution: Understand valuation and dilution dynamics. Tools like ownyourventure.com can help model how fundraising impacts ownership.\n-----\nFollow All Chance to learn from more innovative insights",
        "location": "3"
      },
      {
        "link": "https://www.linkedin.com/in/johnferry1?trk=public_profile_relatedPosts_face-pile-cta",
        "name": "",
        "summary": "John Ferry\n        \n              \n          Two hypotheses for the coming Pentagon environment: good for VC-backed and back for VC-backed…\n\nThe first hypothesis is pretty straightforward, the sheer number of VC alums and VC adjacent, from the VP to the DepSecDef would logically lend to the idea that the building would naturally get more VC friendly. Not overtly mind you, I don’t see folks rolling in and outright steering funds into companies in which they have interest, more a matter of the folks holding the reins actually knowing how that world works on a deep level and implementing policy that really helps.\n\nThe second hypothesis goes like this: the admin has, at best, 18 months to really get changes moving, while they have all three seats of power, before midterm pressures smack an aspirational agenda with the cold fish of reelection prerogatives. Likewise, the best I think we can hope for these private sector titans to take a break from making markets to make $200k/yr as a DC-dwelling bureaucrat, is about two years. That also happens to be the going tenure of an appointee-level official. So the White House and the E Ring have 24 months to make a difference for venture backed firms before the political gravitational pull swings the building back into a regular orbit around the budgetary sun…which is…about 1 1/2 POM cycles…the frozen middle has held there breath for longer before…\n\nI’m probably wrong in bother cases, just a casual observation.",
        "location": "25\n              \n            \n      \n  \n                  \n                  \n                  \n                  \n                  \n                  \n                  \n            \n      \n        \n                9 Comments"
      }
    ],
    "similar_profiles": [],
    "recommendations": [
      {
        "link": "https://pk.linkedin.com/in/muzamil-butt?trk=public_profile_recommendations",
        "name": "Muzamil Butt",
        "summary": "“My work experience with Rishi was extraordinary and I would definitely like to work with him again in the future.\n\nLovely client with great communication skills. Looking forward to working with him again”"
      }
    ],
    "publications": [
      {
        "name": "Up Your Game In Any Job (A-Z) With Latin-2022",
        "sub_title": "Rishi Sai Sadanandan",
        "summary": "✯ Published a children's book, describing the prevalence of Latin in several occupations (A-Z), targeting elementary school children to augment their future interest in Latin.",
        "date": ""
      }
    ],
    "courses": [],
    "languages": [
      {
        "name": "English",
        "level": "-"
      }
    ],
    "organizations": [
      {
        "name": "✯ Auxiliary Treasurer (9th, 10th, ✯ 11th, 12th) – Latin Club",
        "position": "-"
      },
      {
        "name": "✯ Co-President (10th, 11th, ✯ 12th) – Physics Club",
        "position": "-"
      },
      {
        "name": "1st Place at TampaBay MUN (12th Grade) – Model United Nations Club",
        "position": "-"
      },
      {
        "name": "1st Place in BerkMUN Crisis Committee (10th Grade) – Model United Nations Club",
        "position": "-"
      },
      {
        "name": "1st Place in Statistics at the Dunbar High School Regional Competition (12th) – Math Club",
        "position": "-"
      },
      {
        "name": "2nd Place in BerkMUN Crisis Committee (9th Grade) – Model United Nations Club",
        "position": "-"
      },
      {
        "name": "9th Grade (President), 10th/12th (Male-Representative) – Student Forum",
        "position": "-"
      }
    ],
    "projects": [],
    "awards": [
      {
        "name": "Best President (Management) (2024/2025)",
        "organization": "Rem and Company - National Chapter",
        "duration": "Dec 2024",
        "summary": "Rewarded Best President for the 2024/2025 Cycle of Rem & Company by the National Chapter for my management skills, logistical intuition, and the successful mobilization of my chapter's board."
      },
      {
        "name": "Best Team Lead (2023/2024)",
        "organization": "Rem and Company",
        "duration": "Jan 2024",
        "summary": "Rewarded Best Team Lead for the 2023/2024 Cycle of Rem & Company- Stanford for my work with a small online business with the goal of bringing diversity into athletics."
      },
      {
        "name": "AP Scholar with Distinction – College Board",
        "organization": "-",
        "duration": "",
        "summary": ""
      },
      {
        "name": "Berkeley’s 50th Anniversary Service Scholar Award – Berkeley",
        "organization": "-",
        "duration": "",
        "summary": ""
      },
      {
        "name": "Book Awards",
        "organization": "-",
        "duration": "",
        "summary": ""
      },
      {
        "name": "Cum Laude Society – Berkeley",
        "organization": "-",
        "duration": "",
        "summary": ""
      },
      {
        "name": "Headmaster’s List (9th, 10th, 11th, 12th Grade)",
        "organization": "-",
        "duration": "",
        "summary": ""
      },
      {
        "name": "Headmaster’s Scholar",
        "organization": "-",
        "duration": "",
        "summary": ""
      },
      {
        "name": "Junior Classical League Awards",
        "organization": "-",
        "duration": "",
        "summary": ""
      },
      {
        "name": "National English Honor Society",
        "organization": "-",
        "duration": "",
        "summary": ""
      },
      {
        "name": "National Honor Society",
        "organization": "-",
        "duration": "",
        "summary": ""
      },
      {
        "name": "National Latin Honor Society",
        "organization": "-",
        "duration": "",
        "summary": ""
      },
      {
        "name": "National Math Honor Society (MU Alpha Theta)",
        "organization": "-",
        "duration": "",
        "summary": ""
      },
      {
        "name": "National Science Honor Society",
        "organization": "-",
        "duration": "",
        "summary": ""
      },
      {
        "name": "National Social Science Honor Society",
        "organization": "-",
        "duration": "",
        "summary": ""
      },
      {
        "name": "Xerox Innovation Award – University of Rochester",
        "organization": "-",
        "duration": "",
        "summary": ""
      }
    ],
    "score": []
  }
]