{
    "id": "aadit-juneja",
    "name": "Aadit Juneja",
    "profile_pic": "https://media.licdn.com/dms/image/v2/D5603AQG1r1EUCVZW7w/profile-displayphoto-shrink_200_200/profile-displayphoto-shrink_200_200/0/1727810515258?e=2147483647&v=beta&t=SMjOHwHIX-97dOcdr-UEizlT-bEypLChv05n7Slrvsg",
    "contacts": [
        "aadit@aaditjuneja.com"
    ],
    "links": [
        "https://aaditjuneja.com",
        "https://www.linkedin.com/in/aadit-juneja/"
    ],
    "short_description": "Aadit Juneja is a student in the Jerome Fisher M&T Program at the University of Pennsylvania, pursuing dual degrees in Finance from The Wharton School and Computer Science from Penn Engineering. He has experience as a Quantitative Trading Intern at Five Rings and has worked in private equity and research.",
    "long_description": "Aadit Juneja is currently enrolled in the prestigious Jerome Fisher Management & Technology (M&T) Program at the University of Pennsylvania, where he is pursuing a Bachelor's degree in Finance from The Wharton School and a Bachelor's degree in Computer Science from Penn Engineering. He maintains a perfect 4.0 GPA.\n\nProfessionally, Aadit is set to join Five Rings as a Quantitative Trading Intern in New York from January to February 2025. Prior to this, he served as a Fall Private Equity Analyst at Leo Legacy in Philadelphia from August to October 2024. He also worked as a Research Assistant at Penn Medicine, University of Pennsylvania Health System, where he focused on multimodal LLMs for tumor contouring from June to August 2024.\n\nAt Wharton, Aadit is actively involved in several organizations including the Wharton Investment and Trading Group, Wharton Analytics Fellows, and Wharton Undergraduate Distressed Investing Group. His academic background includes graduating from Stevenson High School in Lincolnshire, IL with a 4.0 GPA.\n\nAadit has a strong online presence with his personal website and maintains a professional network with over 500 connections and 3,000 followers on LinkedIn. His educational focus on the intersection of finance and computer science positions him well for a career in quantitative finance and technology-driven investment strategies."
}