{
    "id": "aaquib-syed",
    "name": "Aaquib Syed",
    "profile_pic": "https://media.licdn.com/dms/image/v2/D4E03AQF6WA6SN7AFbg/profile-displayphoto-shrink_200_200/profile-displayphoto-shrink_200_200/0/1694543181540?e=2147483647&v=beta&t=w0cAWKTW20MPdZGvXbgMAXcxYTSWUaDR9GV9o5xBgfU",
    "contacts": [
        "1K followers",
        "500+ connections"
    ],
    "links": [
        "https://www.github.com/Aaquib111",
        "https://arxiv.org/abs/2406.11717",
        "https://openreview.net/forum?id=tiLbFR4bJW",
        "https://openreview.net/forum?id=cKlgcx7nSZ",
        "https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0280320"
    ],
    "short_description": "Aaquib Syed is a researcher at Google with interests in AI/ML and finance. He has published several papers in machine learning, particularly focusing on language models and interpretability. He is a graduate of the University of Maryland and has received multiple prestigious awards including the USA Computing Olympiad Gold and Banneker-Key Scholarship.",
    "long_description": "Aaquib Syed is a researcher at Google who focuses on solving problems in AI/ML and finance. He graduated from the University of Maryland where he was awarded the prestigious Banneker-Key Scholarship, a full merit scholarship given to the top 0.5% of the incoming class.\n\nHis research work is primarily in the field of machine learning, with a particular focus on language models and interpretability. He has published several notable papers including \"Refusal in Language Models Is Mediated by a Single Direction\" (in review at NeurIPS), \"Attribution Patching Outperforms Automated Circuit Discovery\" (NeurIPS ATTRIB Workshop), \"Prune and Tune: Improving Efficient Pruning Techniques for Massive Language Models\" (ICLR TinyPapers Workshop), and \"Machine learning with textural analysis of longitudinal multiparametric MRI and molecular subtypes accurately predicts pathologic complete response in patients with invasive breast cancer\" (PLOS ONE).\n\nAaquib has an impressive academic background, having achieved Gold rank in the USA Computing Olympiad Competition and being a recipient of the National Merit Scholarship. During his high school years, he received multiple recognitions for his research and community service, including 2nd Place at the Long Island Science & Engineering Fair, being named a Newsday Extraordinary Senior, and receiving the Suffolk County Youth Community Service award.\n\nHe has also worked on several projects including a Personal Distance Monitor, Stress Level Manager, and FIRST Robotics Competition Scouting (FRCS). His GitHub portfolio showcases his technical skills and interests in developing practical applications.\n\nWith over 1,000 followers on LinkedIn and 500+ connections, Aaquib maintains an active professional network and regularly engages with content related to AI research, startups, and technological innovations."
}