{
    "id": "aidangollan",
    "name": "Aidan Gollan",
    "profile_pic": "https://media.licdn.com/dms/image/v2/D4E03AQEE6i7YSKlYKA/profile-displayphoto-shrink_200_200/profile-displayphoto-shrink_200_200/0/1680121037642?e=2147483647&v=beta&t=lgBeNneoVCQbVNsLpzSFwKulTEEz8a_wnGgvS24tod4",
    "contacts": [
        "4K followers",
        "500+ connections"
    ],
    "links": [
        "https://nosu.io",
        "https://weirdspotify.com",
        "https://notello.ai",
        "https://aidangollan.com"
    ],
    "short_description": "Co-founder at nosu.io and a computer science and mathematics student at Michigan State University. Passionate about turning fun ideas into shareable products with experience in software engineering and entrepreneurship.",
    "long_description": "Aidan Gollan is a tech entrepreneur and computer science/mathematics student at Michigan State University. He is currently the Co-Founder of nosu.io, where he focuses on \"hacking hackathons.\" Aidan has built an impressive portfolio of projects including Weird Spotify (weirdspotify.com) and Notello.ai.\n\nHis professional experience includes roles as a Project Director at AI Club at MSU, Fullstack Software Engineering Intern at Auto-Owners Insurance and SampleServe, and Undergraduate Researcher at Michigan State University. He has also founded multiple ventures including Lume Analytics.\n\nAidan pursued a Bachelor's degree in Computer Science and Mathematics at Michigan State University from 2022 to 2024, and briefly started a Master's program before dropping out. His academic background includes coursework in Abstract Algebra, Computer Organization and Architecture, Data Structures and Algorithms, Discrete Structures in Mathematics, Honors Analysis, Honors Proof Based Linear Algebra, and various programming languages including C++, Python, and Web Development.\n\nIn his LinkedIn bio, Aidan describes himself as someone who likes to \"turn fun ideas into things you can share with others,\" highlighting his entrepreneurial spirit and passion for creating practical, user-focused technology solutions. With 4K followers and 500+ connections, he has built a substantial network in the tech community."
}