{
    "id": "arjun-melwani",
    "name": "Arjun Melwani",
    "profile_pic": "https://media.licdn.com/dms/image/v2/C5603AQFHpGLGdJN4cg/profile-displayphoto-shrink_200_200/profile-displayphoto-shrink_200_200/0/1659050812346?e=2147483647&v=beta&t=HS7G9lzuJhJtcl7hT8LJKJ1HfBewBzmok62Aiz9I7oo",
    "contacts": [
        "1K followers",
        "500+ connections"
    ],
    "links": [
        "https://www.linkedin.com/in/arjun-melwani"
    ],
    "short_description": "Electrical Engineering, Computer Science and Physics student at MIT with research experience at MIT Media Lab. Previously worked in product development at Articulate Labs and owned Techabyte3d. Winner of HackMIT, one of the biggest hackathons in the country.",
    "long_description": "Arjun Melwani is currently pursuing a Bachelor of Science in Electrical Engineering, Computer Science, and Physics at the Massachusetts Institute of Technology (MIT), expected to graduate in 2028. He is a researcher at the MIT Media Lab, where he has been working since September 2024.\n\nPrior to his academic pursuits at MIT, Arjun gained valuable professional experience in the healthcare technology sector. He worked in Product Development at Articulate Labs in Dallas, Texas for over 2.5 years from July 2021 to January 2024. Simultaneously, he was the owner of Techabyte3d for nearly 8 years from May 2016 to January 2024, also based in Dallas.\n\nArjun's educational background includes attending Greenhill School from 2008 to 2024 before enrolling at MIT. He has demonstrated exceptional technical skills and entrepreneurial spirit, as evidenced by his professional experiences and academic achievements.\n\nIn September 2024, Arjun and his teammates won first place at HackMIT, one of the most prestigious hackathons in the country. His team also won the TerraAPI track and the overall grand prize with their project \"HarmoNIC.\" Additionally, they secured 3rd place at the MIT AI Hackathon, showcasing his talents in artificial intelligence and technology development.\n\nArjun maintains an active presence on LinkedIn, engaging with content related to entrepreneurship, technology innovation, and academic achievements. His professional interests appear to span electrical engineering, computer science, artificial intelligence, and product development, with a particular focus on innovative technologies and entrepreneurial ventures."
}