{
    "id": "armaangupt",
    "name": "Armaan Gupta",
    "profile_pic": "https://media.licdn.com/dms/image/v2/D4E03AQEbNPdqhQJsmg/profile-displayphoto-shrink_200_200/profile-displayphoto-shrink_200_200/0/1727674102340?e=2147483647&v=beta&t=F6sVTkS-DDwaChDVPeUalTERJh84gkr9k3-rOdSsoT4",
    "contacts": [
        "623 followers",
        "500+ connections"
    ],
    "links": [
        "https://www.linkedin.com/in/armaangupt"
    ],
    "short_description": "Armaan Gupta is an Artificial Intelligence student at the University of Pennsylvania with experience in robotics and entrepreneurship. He has founded multiple organizations including Little Mentors and Apollo, and has interned at Ghost Robotics while also serving as a Software Team Member at Penn Electric Racing.",
    "long_description": "Armaan Gupta is currently pursuing a Bachelor of Science in Artificial Intelligence at the University of Pennsylvania (2024-2028). He serves as a Software Team Member at Penn Electric Racing and has an impressive background in entrepreneurship and robotics.\n\nAs President and Co-Founder of Little Mentors (2019-2024), a 501(c)(3) organization, he hosted notable guests like Mark Cuban and Anne Wojcicki on Teddy Talks, directing conversations with industry leaders to inspire and educate youth through constructive discourse.\n\nDuring his time at Cherry Hill High School East (2020-2024), Armaan was an Officer and Captain of the Robotics team, which ranked in the Top 25 out of 10,000 teams globally. He developed a C++ library for trajectory generation using Quintic Beziér Splines and non-linear feedback for optimized robotic motion control.\n\nIn Summer 2023, he interned at Ghost Robotics in Philadelphia, where he analyzed control systems and gait mechanics to enhance robot stability, efficiency, and agility in dynamic environments. He collaborated with engineers to refine robotic locomotion algorithms and gained hands-on experience with advanced robotics technologies.\n\nAs Founder and CEO of Apollo (2020-2021), Armaan designed and developed a platform for youth entrepreneurship using SwiftUI and Firebase. He led a team of 5 developers and won the Congressional App Challenge for 2023.\n\nHis technical expertise spans robotics, software development, and AI, combined with leadership skills demonstrated across multiple organizations and projects."
}