{
    "id": "chandrasuda",
    "name": "Chandra Suda",
    "profile_pic": "https://media.licdn.com/dms/image/v2/D4E03AQGlREg-x__G2Q/profile-displayphoto-shrink_200_200/profile-displayphoto-shrink_200_200/0/1699998830993?e=2147483647&v=beta&t=7OGKyeL9j3jNid0fBMOI2w3xPSPCkYp_WWNSQGzLM34",
    "contacts": [
        "csuda@stanford.edu"
    ],
    "links": [
        "https://www.youtube.com/@CloudDataScience",
        "https://www.credly.com/badges/2e9d8495-037c-4aac-b672-64acded8556b",
        "https://www.credly.com/badges/9e14e093-b20a-4453-91c7-a32d69e0c345",
        "https://www.credly.com/badges/054515de-5c49-41c4-a205-6fcf2bb9b7d7",
        "https://www.credly.com/badges/75b89345-d612-4dfb-b87f-1da553a8cdb7",
        "https://www.credly.com/badges/bfb2c0d3-1a8d-4359-93b5-bb86b0ec9cc9",
        "https://www.credly.com/badges/9afd1eb6-0e7a-4046-b07c-27991547bba0",
        "https://www.credly.com/badges/50811a7a-3248-4bb7-b9a2-3c72e37da757",
        "https://www.credly.com/badges/c102ca09-a7d0-4c43-a165-ecd0de4cb04c",
        "https://www.credly.com/badges/2f51cfc0-1932-4039-a778-50fe170c4264",
        "https://www.credly.com/badges/2c086e13-5e64-4581-b85e-cb7612af366d"
    ],
    "short_description": "CS + Math student at Stanford University and Rise Global Fellow passionate about social impact via technology, focusing on startups, agents, and RL/LLMs. Founder Fellow at On Deck and former valedictorian with extensive experience in AI research, particularly in healthcare applications.",
    "long_description": "Chandra Suda is a Computer Science and Mathematics student at Stanford University (2024-2028) with a remarkable track record of achievements in technology and research. As a Rise Global Winner selected by Schmidt Futures and Rhodes Trust, Chandra is part of an elite group of 100 promising teens worldwide supported for life as they work to solve humanity's most pressing problems.\n\nCurrently serving as a Founder Fellow at On Deck, a Strategy Intern at Mercor, and a Growth team member at Anthropic, Chandra is deeply involved in the AI ecosystem. His research experience is extensive, working as a Student Researcher at Harvard Medical School and the University of Arkansas, focusing on the intersection of artificial intelligence and medicine.\n\nBefore Stanford, Chandra graduated as valedictorian (ranked 1/703) from Bentonville High School, where he led multiple teams including National Science Bowl, Mu Alpha Theta (Math Honor Society), CyberPatriot (State Champions 2023), and VRC Robotics. He also has significant volunteer experience with the American Red Cross, serving as Hub-Club President and MissingMaps Team Lead.\n\nChandra's professional experience includes working as a Machine Learning Intern at Walmart Global Tech, where he helped optimize retail environment supply and inventory for Fresh Foods by 18%. He also worked as a Computer Vision Intern at Deeping Source Inc., developing bicycler detection models for tourism data analytics.\n\nHis research has been recognized at prestigious competitions, including the International Science & Engineering Fair (ISEF), where he won awards for his work on early diagnosis and treatment monitoring of tuberculosis using machine learning and cough analysis. Other notable achievements include being a National Merit Finalist, National Cyber Scholar with Honors, and winning multiple awards at state and national science competitions.\n\nChandra holds numerous certifications, including CompTIA IT Fundamentals and multiple Microsoft Technology Associate certifications in various programming languages and technologies. His technical skills span multiple programming languages, machine learning frameworks, and cybersecurity tools, making him a versatile technologist with a strong focus on using AI for social impact."
}