{
    "id": "cheng-george",
    "name": "George Cheng",
    "profile_pic": "https://media.licdn.com/dms/image/v2/D4E03AQF5ceVEmRadSg/profile-displayphoto-shrink_200_200/B4EZUb9yVKHUAc-/0/1739930938397?e=2147483647&v=beta&t=TYEfER7Wmc6KnR6oYwKGVBo-TsM5xjAfFrjhS69JN2c",
    "contacts": [
        "gjcheng@mit.edu"
    ],
    "links": [
        "https://www.georgecheng.org",
        "https://github.com/gcheng713"
    ],
    "short_description": "George Cheng is an AI/CS and Brain & Cognitive Science student at MIT, with research experience at institutions like MIT CSAIL, Koch Institute, and Harvard Medical School. He's a published scientist, entrepreneur, and internationally recognized athlete and public speaker.",
    "long_description": "George Cheng is a multifaceted student researcher and entrepreneur currently pursuing degrees in Computer Science/AI and Brain & Cognitive Science at MIT (2024-2027). His research spans across various prestigious institutions including MIT CSAIL, MIT Koch Institute, MIT Sloan School of Management, Westlake University, Wolfram, Harvard Medical School, and multiple universities in North Carolina.\n\nHis research interests are diverse, covering neuro-symbolic learning, drug delivery systems, AI applications in finance, computational modeling, and biomedical engineering. He has published several papers in peer-reviewed journals on topics ranging from glucose monitoring devices to computational flood modeling and pathogenic detection using machine learning.\n\nAs an entrepreneur, George is a co-founder of Tally.AI (part of Alchemist Accelerator's Class 40), and has been selected as an EWOR Fellow. He's also involved in volunteer work as a co-founder of Stemable and Altra Co., and is an Eagle Scout with the Boy Scouts of America.\n\nGeorge has received numerous prestigious awards and recognitions, including being a Coca-Cola Scholar, National Merit Scholar, U.S. Presidential Scholar Semifinalist, Earth Prize Winner, Heisman High School Scholarship National Winner, and has represented the United States at international science competitions like the EU Contest for Young Scientists. He's also a 1st Place winner at the Regeneron International Science and Engineering Fair.\n\nBeyond his academic and entrepreneurial pursuits, George is proficient in both English and Chinese, and has a background in music, having received multiple awards in piano competitions. His combination of technical expertise, research experience, and leadership qualities positions him as a promising innovator at the intersection of technology, healthcare, and cognitive science."
}