{
    "id": "dhruvdiddi",
    "name": "Dhruv Diddi",
    "profile_pic": "https://media.licdn.com/dms/image/v2/D5603AQG32xXTruCu5w/profile-displayphoto-shrink_200_200/profile-displayphoto-shrink_200_200/0/1729802131992?e=2147483647&v=beta&t=_0GKft9JcQDVrsd0gkbAZ5C7puo7eo5tyDivms-Z_XQ",
    "contacts": [
        "500+ connections",
        "3K followers"
    ],
    "links": [
        "https://getsolo.tech/",
        "http://www.ddiddi.me/projects/ivo",
        "http://ddiddi.me/projects/portfolio/kaggle-titanic-challenge/",
        "http://www.ddiddi.me/projects/rise-for-nepal",
        "http://www.ddiddi.me/projects/flare",
        "http://www.ddiddi.me/projects/anthem",
        "http://www.ddiddi.me/projects/dwolla"
    ],
    "short_description": "Engineer based in the San Francisco Bay Area with experience in Applied Machine Learning. Currently working at Solo and has a background from the University of Illinois Urbana-Champaign. Writes a newsletter called \"So Essentially\" and has experience as an instructor at General Assembly.",
    "long_description": "Dhruv Diddi is an engineer based in the San Francisco Bay Area with expertise in Applied Machine Learning. He is currently working at Solo and is an alumnus of the University of Illinois Urbana-Champaign, where he was recognized as a James Scholar and made the Dean's List.\n\nDhruv writes a weekly newsletter called \"So Essentially\" which he publishes on LinkedIn and Substack. His educational background includes courses in Machine Learning, Data Structures, Computer Architecture, Algorithms, Interactive Computer Graphics, and Android Development.\n\nHe has worked on numerous projects including Illini Hyperloop, IVO, a Kaggle Titanic Prediction challenge, Rise for Nepal, Flare, Anthem Web App, and a Dwolla Pebble App. His project portfolio demonstrates his versatility in software engineering and data science.\n\nDhruv has received strong recommendations for his work as an instructor at General Assembly, where he was praised for his patience, knowledge, and ability to break down complex concepts for students. He is multilingual, with native proficiency in English, Hindi, and Punjabi, and limited working proficiency in French and Mandarin Chinese.\n\nHis professional interests appear to be centered around machine learning, AI, and technology innovation, as evidenced by his engagement with content related to these topics on LinkedIn. Dhruv is also a member of ACM (Association for Computing Machinery)."
}