{
    "id": "djain18",
    "name": "Devanshi Jain",
    "profile_pic": "https://media.licdn.com/dms/image/v2/D5603AQElzTHawk0zBA/profile-displayphoto-shrink_200_200/B56ZQje7o0G4AY-/0/1735762099449?e=2147483647&v=beta&t=fhop_HdAtPvHkmQLGe8vosgQHbHbAdYb9hLhSVHoklg",
    "contacts": [
        "djain@ucsd.edu"
    ],
    "links": [
        "https://www.linkedin.com/in/djain18"
    ],
    "short_description": "Incoming Software Engineer at Meta with previous internships at Amazon and Meta. Currently pursuing a Bachelor's degree in Mathematics and Computer Science at UC San Diego with a passion for problem-solving and software development.",
    "long_description": "Devanshi Jain is an undergraduate student at UC San Diego studying Mathematics and Computer Science with a strong focus on software development and research. She has built an impressive career trajectory with upcoming full-time employment at Meta following internships at both Meta and Amazon as a Software Engineer.\n\nHer professional experience includes working as a Software Engineering Intern at the Center for Energy Research where she improved energy efficiency by 20% across multiple buildings through scheduler optimization. She also served as a Web Developer at UC San Diego School of Medicine, developing a neurocognitive testing web application for sleep apnea patients.\n\nDevanshi has demonstrated leadership as the President of the Society of Undergraduate Mathematics Students (SUMS) at UCSD and as Technical Chair for the IEEE Student Branch. Her research experience includes work at the Computational Modeling and Flow Physics Lab, where she achieved a 12.5% efficiency improvement for NASA's GE90 engine through non-linear optimization, utilizing supercomputing resources and presenting her findings at the 2023 National Conference for Undergraduate Research.\n\nShe has participated in multiple mathematics reading groups, studying topics such as Commutative Algebra, Functional Analysis, and Translation Surfaces. Devanshi has also been recognized as a KVPY Fellow by the Indian Institute of Science and as a National Scholar by IIT Delhi.\n\nHer publication \"Robust Design and Optimization of Turbo-machinery Compressors\" in The Catalyst demonstrates her ability to apply computational methods to solve complex engineering problems. With a diverse background spanning software development, mathematics research, and leadership roles, Devanshi has positioned herself as a versatile and accomplished professional in the technology field."
}