{
    "id": "dylan-nguyenn",
    "name": "Dylan Nguyen",
    "profile_pic": "https://media.licdn.com/dms/image/v2/D4E03AQH8DI05LKFVKQ/profile-displayphoto-shrink_200_200/profile-displayphoto-shrink_200_200/0/1688671690268?e=2147483647&v=beta&t=wP3yz7whq8xRJo9rZTrfsWglKvqD8xVQbQUJNRSewok",
    "contacts": [
        "1K followers",
        "500+ connections"
    ],
    "links": [
        "https://github.com/SpotDylan/TFNeuronClassification",
        "https://github.com/SpotDylan/SocialMediaTradeBotV1"
    ],
    "short_description": "MIT '28 student and Amazon Future Engineer studying Chemical Engineering. Research assistant at MIT ChemE working on mRNA lipid nano-particles, with experience in scientific programming and computational biology. Award-winning researcher with achievements at the International Science & Engineering Fair.",
    "long_description": "Dylan Nguyen is an undergraduate student at MIT (Class of 2028) pursuing studies in Chemical Engineering. He currently serves as an Undergraduate Research Assistant at MIT Chemical Engineering (ChemE) in the Myerson Research Group, where he integrates control systems and Bayesian optimization for manufacturing mRNA lipid nano-particles.\n\nDylan is an Amazon Future Engineer Scholarship recipient, which provides $40,000 towards college tuition and a guaranteed paid internship at Amazon after his first year. He is also a Jane Street AMP Scholar, selected to spend five weeks learning mathematics, computer programming, data analysis, and game theory.\n\nHis research experience includes work as a Scientific Programming Intern at the Max Planck Florida Institute for Neuroscience and participation in the MIT Introduction to Technology, Engineering, and Science (MITES) program. Dylan has an impressive academic background, having completed an Associate of Arts degree at Palm Beach State College through dual enrollment while attending Dreyfoos School of the Arts as a Communications Arts Major.\n\nDylan has received numerous prestigious awards, including being a 3rd Place Grand Award Winner in Biomedical and Health Sciences at the 2023 Regeneron International Science and Engineering Fair, a Kovner Opportunity Scholarship Recipient, and achieving USACO Gold Division status in competitive programming. His research projects include work on AI applications, neural networks, and computational biology, such as \"Modeling the Male Adult Nerve Cord of The Drosophila Melanogaster Using Spiking Neural Networks\" and \"Application of Deep Learning Models into the Prediction of Interleukin-6 and -8 Cytokines in Sickle Cell Anemia Patients.\""
}