{
    "id": "edreismd",
    "name": "Eduardo Pontes Reis",
    "profile_pic": "https://media.licdn.com/dms/image/v2/D4D03AQHmPHJIlPURpw/profile-displayphoto-shrink_200_200/profile-displayphoto-shrink_200_200/0/1711049597043?e=2147483647&v=beta&t=0iYQR_PXAMwfMcPEMQtZN21kp5nGGJPNu2wLfelvwbk",
    "contacts": [
        "3K followers",
        "500+ connections"
    ],
    "links": [
        "https://github.com/edreisMD",
        "https://www.linkedin.com/in/edreismd/"
    ],
    "short_description": "Medical professional affiliated with Stanford University and Hospital Israelita Albert Einstein with expertise in radiology. Has training in neural networks and deep learning, with interests in healthcare AI applications.",
    "long_description": "Eduardo Pontes Reis is a medical professional with affiliations to Stanford University and Hospital Israelita Albert Einstein. His professional background includes radiology expertise, as evidenced by his membership in the Sociedade Paulista de Radiologia and Colégio Brasileiro de Radiologia.\n\nEduardo has pursued education in artificial intelligence and machine learning, completing several Coursera certifications including Convolutional Neural Networks, Neural Networks and Deep Learning, and Structuring Machine Learning Projects in 2017-2018. His interests appear to focus on the intersection of healthcare and technology, particularly AI applications in medicine.\n\nHe was a HIPUC Bootcamp Fellow as part of Stanford Biodesign's first Latin American Initiative in 2016, suggesting involvement in healthcare innovation. Eduardo has published research on \"Ischemic Postconditioning and Subanesthetic S(+)-Ketamine Infusion: Effects on Renal Function and Histology in Rats\" in BioMed Research International.\n\nEduardo is fluent in Portuguese (native) and English (professional proficiency). His LinkedIn activity shows engagement with content related to AI advancements, particularly in healthcare applications, medical imaging, and computational programming."
}