{
    "id": "eric-mao",
    "name": "Eric Mao",
    "profile_pic": "https://media.licdn.com/dms/image/v2/D4E03AQHU_MWPqnCNqg/profile-displayphoto-shrink_200_200/profile-displayphoto-shrink_200_200/0/1694921091463?e=2147483647&v=beta&t=mtLdPIsmITHYpmtl-YpSne8xsvvfUyG6Waq0pwO35Vc",
    "contacts": [
        "ericmao0606@gmail.com"
    ],
    "links": [
        "https://lnkd.in/eVmhBBEU"
    ],
    "short_description": "Co-Founder at Linkd (YC X25) and former UPenn M&T student. Eric is building people search solutions while participating in the Y Combinator accelerator program. He previously worked on Iris, a file management system for video editors, as a Telora Fellow.",
    "long_description": "Eric Mao is the Co-Founder of Linkd, a people search platform that is part of Y Combinator's X25 batch. He was previously attending the prestigious Jerome Fisher Program in Management & Technology (M&T) at the University of Pennsylvania, where he was pursuing dual degrees in Computer Science and Business Administration, but is currently on leave to focus on his startup.\n\nEric has demonstrated entrepreneurial drive and technical expertise throughout his career. As a Telora Fellow, he worked on Iris, a better file management system for video editors. He has also been involved in several research projects, including machine learning approaches for carbon sequestration estimation, reliability enhancement systems for 3D printing, cognitive status prediction from fMRI data, and mind-controlled wheelchairs for ALS patients.\n\nHis academic achievements include participation in the International Young Physicists' Tournament representing Team Canada, winning a Canadian Young Physicists' Tournament Gold Medal, the High School Big Data Challenge, and reaching the USACO Platinum Division. He was educated at Crescent School before attending UPenn.\n\nEric is also part of the Z Fellows program for 2025, further highlighting his involvement in the startup ecosystem. His recent launch of Linkd saw impressive traction with 18,000 users spending 1,350 hours on the site within the first 48 hours. In February 2024, he received the Best Research Poster award from the International Conference on Climate Change."
}