{
    "id": "harshil-avlani-b8b775323",
    "name": "Harshil Avlani",
    "profile_pic": "https://static.licdn.com/aero-v1/sc/h/9c8pery4andzj6ohjkjp54ma2",
    "contacts": [
        "218 followers",
        "217 connections"
    ],
    "links": [
        "https://www.linkedin.com/in/harshil-avlani-b8b775323"
    ],
    "short_description": "Harshil Avlani is a Computer Science and Physics student at MIT with extensive research experience in quantum computing and physics. He currently works as a Research Intern with the Quanta Group at MIT's Research Laboratory of Electronics.",
    "long_description": "Harshil Avlani is pursuing a Bachelor's degree in Computer Science and Physics at the Massachusetts Institute of Technology (MIT). He has built an impressive research portfolio focused on quantum computing and physics through multiple research internships.\n\nCurrently, Harshil serves as a Research Intern with the Quanta Group at MIT's Research Laboratory of Electronics, a position he has held since October 2024. Prior to this, he spent over a year (May 2023 - August 2024) as a Research Intern at the Quantum Mechanical Engineering Lab at Arizona State University.\n\nHis research experience also includes a 9-month internship (September 2022 - May 2023) with the Hauser Research Group at The University of Alabama, and a 4-month position (May 2022 - August 2022) as a Research Intern at the SEFCOM Lab at Arizona State University. During the same period, he participated in the MIT Beaver Works Summer Institute as a Quantum Software Student.\n\nHarshil has already begun contributing to academic publications, with a paper titled \"Dataset on density functional theory investigation of ternary Heusler alloys\" published in Data in Brief in February 2024.\n\nBefore attending MIT, Harshil completed his high school education at BASIS Chandler. His academic background and research experiences demonstrate his strong interest and capabilities in quantum computing, physics, and computer science."
}