{
    "id": "janos-meny-b70761188",
    "name": "Janos Meny",
    "profile_pic": "https://media.licdn.com/dms/image/v2/C4D03AQECN9k-RzOulA/profile-displayphoto-shrink_200_200/profile-displayphoto-shrink_200_200/0/1640445228463?e=2147483647&v=beta&t=HxTkyRCCBK1zWvUouYL3FH-Umdl1OoREvmLzItj7FR8",
    "contacts": [
        "LinkedIn: https://www.linkedin.com/in/janos-meny-b70761188"
    ],
    "links": [
        "https://www.linkedin.com/company/roblox",
        "https://de.linkedin.com/school/rheinische-friedrich-wilhelms-universit%C3%A4t-bonn"
    ],
    "short_description": "Janos Meny is a professional currently working at Roblox with an educational background from The University of Bonn. He has 255 connections and 264 followers on LinkedIn, and shows interest in topics related to rendering, computational fluid dynamics, and additive manufacturing.",
    "long_description": "Janos Meny is a professional currently working at Roblox and has an educational background from The University of Bonn (Rheinische Friedrich-Wilhelms-Universität Bonn). Based on his LinkedIn activity, he appears to have interests in computer graphics, rendering, computational fluid dynamics (CFD), and additive manufacturing technologies.\n\nHis LinkedIn profile shows engagement with content related to technical roles at Roblox's Rendering team, as well as posts about computational design software, particularly from companies like nTop and cloudfluid. He has shown interest in posts about GPU-native CFD software, 3D printing technologies, and engineering visualization tools.\n\nJanos also engages with content related to AI and machine learning applications in engineering and simulation contexts, suggesting he may have professional interests in these areas as well. His activity indicates he follows developments in advanced manufacturing techniques, particularly in the context of additive manufacturing.\n\nWhile his profile doesn't list specific experience details, his engagement pattern suggests he has technical expertise in computer graphics, simulation, or related engineering fields. He has a network of 255 connections and 264 followers on LinkedIn, indicating an established professional presence."
}