{
    "id": "jay-khemchandani",
    "name": "Jay Khemchandani",
    "profile_pic": "https://media.licdn.com/dms/image/v2/D4E03AQE6bZrMpkGkVQ/profile-displayphoto-shrink_200_200/profile-displayphoto-shrink_200_200/0/1683936907473?e=2147483647&v=beta&t=VqLDkl5zqi-7ARKdxJTSe35eOh1gsSzFFy54yRmE4Ic",
    "contacts": [
        "1K followers",
        "500+ connections"
    ],
    "links": [
        "https://www.linkedin.com/in/jay-khemchandani"
    ],
    "short_description": "CS(AI) + Math student at Stanford University and Co-Founder of Intratalent AI. Grand Prize Winner at TreeHacks 2024 with a passion for building innovative solutions. Currently conducting research at The Bianchi Lab.",
    "long_description": "Jay Khemchandani is a Computer Science (AI) and Mathematics student at Stanford University (2023-2027) who describes himself simply as \"I build 🛠️\". He is the Co-Founder of Intratalent AI in Palo Alto, California, where he is working on optimizing talent since November 2024.\n\nJay has been involved in research since September 2021, working as a Student Researcher at The Bianchi Lab, where he conducts remote research for the University of Miami. He also participated in The Summer Science Program as a Researcher from June to August 2022, focusing on genomics and computational biology.\n\nHis educational background includes a Bachelor of Science degree in CS/Artificial Intelligence from Stanford University (2023-2027) and an IB Diploma from Windermere Preparatory School (2019-2023), where he was Valedictorian.\n\nJay has worked on several projects including \"Baymax, Your Personal Healthcare Companion\" and \"Mosaic - Wallpapers Inspired by You, Made by AI\" in February 2024. His achievement as a Grand Prize Winner at TreeHacks 2024 highlights his innovative capabilities in the tech space.\n\nHis LinkedIn activity shows interests in AI, technology innovation, academic research, and entrepreneurship, as evidenced by his engagement with posts about AI advancements, research breakthroughs, and tech entrepreneurship."
}