{
    "id": "joe-li-08791120b",
    "name": "Joe Li",
    "profile_pic": "https://media.licdn.com/dms/image/v2/D5603AQHbp8Q0BPPi-w/profile-displayphoto-shrink_200_200/profile-displayphoto-shrink_200_200/0/1720486204712?e=2147483647&v=beta&t=1nM4Zgb-Z7EyvE-vmUYhTyKK1ERqzdFRH69Je0GLfgQ",
    "contacts": [
        "760 followers",
        "500+ connections"
    ],
    "links": [
        "https://www.linkedin.com/company/nousresearch",
        "https://www.linkedin.com/school/stanford-university"
    ],
    "short_description": "CS + EE student at Stanford University and Machine Learning Researcher at Nous Research. Former researcher at Hawaii Digital Health Lab, Princeton Power Electronics Lab, and Carnegie Mellon's Search-based Planning Lab. USA IOI Training Camp participant with publications in IEEE and JMIR AI.",
    "long_description": "Joe Li is a Computer Science and Electrical Engineering student at Stanford University and a Machine Learning Researcher at Nous Research, where he focuses on pre-training Large Language Models (LLMs) and reinforcement learning for reasoning models.\n\nHis research experience spans multiple prestigious institutions. At the Hawaii Digital Health Lab (2022-2024), he worked on biosignal-based emotion recognition using AI, first-authoring a paper in JMIR AI titled \"A Comparison of Personalized and Generalized Approaches to Emotion Recognition Using Consumer Wearable Devices.\" At Princeton Power Electronics Lab (2023-2024), he focused on power magnetics modeling, first-authoring \"Investigating the Mutual Impact of Waveform, Temperature, and DC-Bias on Magnetic Core Loss Using Neural Network Models\" for IEEE Applied Power Electronics Conference 2024, and co-authoring two additional papers. Earlier, at Carnegie Mellon's Search-based Planning Lab (2021-2022), he researched computer vision and autonomous planning.\n\nJoe's industry experience includes a role as ML Compiler at Moffett.AI in San Jose, California (Summer 2024). He has also demonstrated leadership as Co-President of TeamsCode and as Founder and President of ParagonX Academy from 2021 to 2024.\n\nHis academic achievements are equally impressive. Joe was a USA Physics Olympiad Gold Medalist in 2023 (top 40 nationally), a USA Computing Olympiad Finalist in 2022 (top 25 nationally, invited to training camp), and a 5-time AIME Qualifier. He was also Valedictorian at The Harker School, where he completed advanced coursework in mathematics, physics, computer science, and French.\n\nJoe has published four papers in reputable journals and conferences, including IEEE Transactions on Power Electronics and IEEE Applied Power Electronics Conference, showcasing his research capabilities in AI, machine learning, and power electronics."
}