{
    "id": "kevin-taylor-89710a262",
    "name": "Kevin Taylor",
    "profile_pic": "https://media.licdn.com/dms/image/v2/D5603AQG5cehjogq8RA/profile-displayphoto-shrink_200_200/B56ZSkYnijGQAY-/0/1737924705939?e=2147483647&v=beta&t=2bWiEN6X_1Hp49YGV4PjcN181GNyeO3Q7nsP9dXsMoc",
    "contacts": [
        "532 followers",
        "500+ connections"
    ],
    "links": [
        "https://www.linkedin.com/in/kevin-taylor-89710a262"
    ],
    "short_description": "Developer Relations Intern at Cerebras Systems, a passionate hackathon participant, and a high school student at Monte Vista High School (Class of 2025). Kevin has extensive experience in programming education, research, and community service.",
    "long_description": "Kevin Taylor is a Developer Relations Intern at Cerebras Systems where he organizes community events like Cafe Compute and Hackathons to increase engagement, while also building internal automation tools and showcase projects for their inference product. He's currently a high school student at Monte Vista High School (Class of 2025).\n\nKevin has a diverse background in technology and education. He previously worked as a Technology Intern at SNP Communications, developing AI-powered tools including a live AI communications coach and an AI-powered internal sales proposal generator. He also gained valuable experience as a Developer at NodNet.org, where he created an accessibility platform to help amputees use computers through head-tracking technologies.\n\nHis teaching experience is extensive, working as a self-employed Programming Instructor since December 2022, teaching students aged 6-16. He also worked as a Math Tutor, helping students with subjects from Algebra to Calculus II. Previously, he served as an Intern Instructor at theCoderSchool, teaching various programming languages to young camp students, and as a Volunteer Instructor at EngageSTEM, teaching Java to underserved middle school students.\n\nKevin has impressive research credentials, working as a Published Research Paper Co-author with an MIT PhD researcher on multimodal neural networks, with their paper accepted to the Intelligent Systems Conference.\n\nHis commitment to community service is evident through his volunteer work with Lion's Heart - Teen Volunteers and Leaders (150+ hours of service), Boy's Team Charity (serving dozens of organizations), and as an Advisory Board Member for the Town of Danville (the youngest member ever admitted).\n\nKevin has also participated in educational programs like COSMOS at UC Davis, where he programmed simulations in Python and studied Biophysics and Robotics, and Inspirit AI, where he worked with PhDs to develop a computer vision model for driverless cars.\n\nHis headline describes him as \"DevRel @ Cerebras, Hackathon Goer, Class '25 MVHS,\" highlighting his passion for technology, community engagement, and education."
}