{
    "id": "leonhardn",
    "name": "Leo Nagel",
    "profile_pic": "https://static.licdn.com/aero-v1/sc/h/9c8pery4andzj6ohjkjp54ma2",
    "contacts": [
        "826 followers",
        "500+ connections"
    ],
    "links": [
        "https://www.linkedin.com/in/leonhardn/"
    ],
    "short_description": "Electrical Engineering & Computer Science student at UC Berkeley with a passion for generative algorithms and technology advancement. Previously worked as a Curriculum Developer at Mad for Stem and served as Chief Executive of the Global Society of Young Physicists.",
    "long_description": "Leo Nagel is an Electrical Engineering & Computer Science student at UC Berkeley, deeply passionate about advancing society through technology. His academic journey has sparked a profound interest in generative algorithms and their potential to revolutionize various aspects of life.\n\nWith a strong educational background, Leo has studied at prestigious institutions including UC Berkeley, The University of Hong Kong, and completed an International Baccalaureate Diploma at Dulwich College Shanghai Pudong with an impressive score of 44/45. He has also participated in specialized programs at Stanford University, the Summer Science Program in Astrophysics, and the Quantum Cryptography School for Young Students at the University of Waterloo.\n\nProfessionally, Leo worked as a Curriculum Developer at Mad for Stem, where he collaborated with colleagues to create interdisciplinary courses covering economics, computer science, data science, and technology. He also gained experience as an intern at Huazhong University of Science and Technology and as a Student Member at Carboncopies.\n\nLeo has demonstrated leadership through his volunteer work, serving as Chief Executive of the Global Society of Young Physicists from February 2022 to May 2024. He also held positions as Deputy Secretary General and Head of Information Technology at the International Discord Model United Nations.\n\nHis achievements include placing first in the Berkeley Trading Invitational, receiving a Gold Award in the Senior Maths Challenge from the United Kingdom Mathematics Trust, being an International STEM Olympiad Finalist, and earning a National Honor Award at the European Economics Olympiad.\n\nLeo is multilingual, with native proficiency in English and German, and elementary proficiency in Chinese and Latin. He maintains professional affiliations as a Student Member of both the Association for Computing Machinery and the Institute of Electrical and Electronics Engineers (IEEE).\n\nThrough his academic pursuits and professional experiences, Leo continues to explore the intersection of computer science and electrical engineering, with a particular focus on how generative algorithms can be applied to address complex societal challenges and drive positive change."
}