{
    "id": "lunw1024",
    "name": "Alan Wu",
    "profile_pic": "https://media.licdn.com/dms/image/v2/D5603AQHF7vsjTn0g_g/profile-displayphoto-shrink_200_200/profile-displayphoto-shrink_200_200/0/1679813392061?e=2147483647&v=beta&t=Bt1gHG0OXieaUuMCpdwfiPBbxHkIvJlyAYqGF2Esdto",
    "contacts": [
        "2K followers",
        "500+ connections"
    ],
    "links": [
        "https://alanwu.xyz"
    ],
    "short_description": "Alan Wu is a Caltech student and startup founder with a passion for programming and mathematics. He has won numerous prestigious competitions including the Citadel Data Open Global Championship and IMC Prosperity 2, demonstrating exceptional skills in data science, algorithmic trading, and computer science research.",
    "long_description": "Alan Wu is a talented individual affiliated with Caltech who describes himself as someone who \"loves to meet and compete with the brightest minds\" and is active in programming and mathematics. His professional journey spans both academic research and entrepreneurship, as he identifies as a startup founder.\n\nAlan has an impressive track record of achievements in competitive settings. He won the Citadel Data Open Global Championship in December 2022, securing a $100,000 cash prize. In April 2024, he was the winner of IMC Prosperity 2 trading challenge as part of team Puerto Vallarta, earning $25,000. His competitive excellence extends to programming contests, where he qualified for ICPC NAC as part of a top 3 school team in November 2024, and achieved a top 100 ranking in the USACO Platinum Division.\n\nIn the research domain, Alan has contributed to publications including \"LoLCATs: On Low-Rank Linearizing of Large Language Models\" (ICLR 2025) and \"DenseFuseNet: Improve 3D Semantic Segmentation in the Context of Autonomous Driving with Dense Correspondence\" (IEEE, 2021). The latter research earned him a Bronze Prize in the prestigious S.-T Yau High School Science Award in Computer Science, placing 3rd among over 1000 global research projects.\n\nAlan has consistently demonstrated excellence in data science competitions, winning first place in the Berkeley Trading Competition Data Science Challenge (February 2024), placing 4th in the Terminal Global Championship 2022 ($5,000 prize), and earning a Silver Medal in the Halite by Two Sigma Data Science Competition. He also received recognition in the Chainlink Spring 2022 Hackathon with a Top Quality Project Award.\n\nHis academic achievements include a First Award in NOIP 2019 (ranked 31st) and a top 4 finish at MIT BattleHack 2020 out of 130 participants. With 2,000+ followers on LinkedIn and connections to professionals across the tech and finance industries, Alan has established himself as a rising talent at the intersection of computer science, mathematics, and quantitative finance."
}