{
    "id": "ma06nicole",
    "name": "Nicole Ma",
    "profile_pic": "https://media.licdn.com/dms/image/v2/D5603AQERna6N0lKvzw/profile-displayphoto-shrink_200_200/profile-displayphoto-shrink_200_200/0/1705121223153?e=2147483647&v=beta&t=UfOGPL27vgJxlLYQ6R40uwn14_zJP357em02loWVLl8",
    "contacts": [
        "manicole@stanford.edu"
    ],
    "links": [
        "https://doi.org/10.1029/2022EA002662"
    ],
    "short_description": "Nicole Ma is a Computer Science and Mathematics student at Stanford University with research experience at NASA Jet Propulsion Laboratory and Stony Brook University. She is interested in tech entrepreneurship and has published research on global surface temperature projections.",
    "long_description": "Nicole Ma is currently pursuing a Bachelor of Science in Computer Science and Mathematics at Stanford University (2024-2028). She has an impressive research background, serving as a Research Fellow at the Simons Summer Research Program at Stony Brook University since June 2023. Previously, she worked as a Research Intern at NASA Jet Propulsion Laboratory for over two years (2021-2023) and at California State Polytechnic University-Pomona (2021-2023).\n\nNicole has demonstrated excellence in academics and research, publishing a paper titled \"21st Century Global and Regional Surface Temperature Projections\" in Earth and Space Science. Her research projects include \"Constructing a Novel Multidirectional Stochastic Process Model to Simulate the Latitude of the North Atlantic Jet Stream\" and \"Using Machine Learning to Improve Offshore Wind Resource Assessment and Forecasting.\"\n\nHer achievements include being a National Merit Scholarship Finalist, receiving the 2023 CESASC JHJ Prize for Fundamental Science (Physics), being a Finalist and Oral Presenter at the 61st National Junior Science and Humanities Symposium, qualifying for the American Invitational Mathematics Examination, and winning numerous hackathon and science fair awards. She is also the President of the Climate Justice Global Alliance, demonstrating her commitment to environmental issues.\n\nNicole is bilingual, with native proficiency in both English and Mandarin. She graduated from Sage Hill School (2020-2024) before attending Stanford. She is scheduled to participate in Jane Street's WiSE Program in July 2024."
}