{
    "id": "matthew-law-0x251",
    "name": "Matthew Law",
    "profile_pic": "https://media.licdn.com/dms/image/v2/D5603AQEH_PGSFl34zg/profile-displayphoto-shrink_200_200/B56ZUhis_4GUAg-/0/1740024500544?e=2147483647&v=beta&t=nqU84vPku0H9MsLz_PLDlMrLSR-7Pif_bqij4_gc0-g",
    "contacts": [
        "574 followers",
        "500+ connections"
    ],
    "links": [
        "https://www.linkedin.com/in/matthew-law-0x251"
    ],
    "short_description": "Researcher at Stanford Institute for Human-Centered Artificial Intelligence (HAI) and Backend Lead at a Stealth AI Startup. Matthew is a 16-time hackathon winner with expertise in computational neuroscience engineering.",
    "long_description": "Matthew Law is a talented researcher at Stanford Institute for Human-Centered Artificial Intelligence (HAI) in Palo Alto, California, where he has been working since September 2024. Simultaneously, he serves as a Backend Lead at a Stealth AI Startup, also based in Palo Alto, a position he has held since December 2024.\n\nMatthew has established himself as an accomplished hackathon participant, winning 16 hackathons as highlighted in his headline. His LinkedIn activity shows active engagement with the AI and tech community, particularly in hackathons and AI development. He has participated in events like the U.S.S. Hornet Defense Hackathon 2024 and the CreatorsCorner and MindsDB Vertical Specific hackathon, where his teams achieved notable success.\n\nHis educational background includes attendance at Monte Vista High School in 2021. While his LinkedIn profile doesn't detail his complete educational history, his professional roles at Stanford HAI and in AI development suggest advanced knowledge and expertise in artificial intelligence, computational neuroscience, and backend engineering.\n\nMatthew maintains a network of over 500 connections and has 574 followers on LinkedIn, indicating his active presence in the professional tech community. His interests appear to span AI research, computational neuroscience, hackathons, and backend development."
}