{
    "id": "mavli",
    "name": "Mav L.",
    "profile_pic": "https://static.licdn.com/aero-v1/sc/h/9c8pery4andzj6ohjkjp54ma2",
    "contacts": [
        "2K followers",
        "500+ connections"
    ],
    "links": [
        "https://drive.google.com/file/d/1kZ9EVdByV6XFoW3pnsuL6krvgb5UkvIy/view?usp=sharing"
    ],
    "short_description": "Mav L. is an explorer, investor, and trader with a background in Applied Mathematics from Harvard University. They are currently exploring opportunities in the San Francisco Bay Area while actively investing as an angel investor in multiple startups. Mav is also an accomplished chess player with Candidate Master and Women's Candidate Master titles.",
    "long_description": "Mav L. is a multifaceted professional with experience spanning quantitative trading, investing, and research. They hold a degree in Applied Mathematics from Harvard University and have worked at prestigious firms including Jane Street and BlackEdge Capital as a Quantitative Trader. \n\nMav is currently exploring new opportunities in the San Francisco Bay Area while serving as an angel investor for multiple startups including Stealth, nosu, Haize Labs, Etched, and XOUL. Their professional journey includes roles as a Growth Investor at The Lightsmith Group, a Crypto Trader at Galaxy, and a Principal at Harvard Undergraduate Capital Partners.\n\nTheir academic experience includes undergraduate research at the Harvard John A. Paulson School of Engineering and Applied Sciences and participation in a study abroad program in Iceland as a Student Researcher in the Arctic through the School for International Training.\n\nMav has demonstrated leadership as a Program Lead for the Harvard Undergraduate Clean Energy Group and continues to give back as an Alumni Interviewer for Harvard University and as a National Science Bowl Volunteer for the U.S. Department of Energy.\n\nThey are trilingual, with native proficiency in Chinese and English, and limited working proficiency in Spanish. Mav is also an accomplished chess player, holding both Candidate Master (CM) and Women's Candidate Master (WCM) titles. Their chess achievements include representing the US at World Youth Chess Championships and winning the Illinois State Female Chess Championship three times. Additionally, they qualified for a Gold Medal Score at the International Earth Science Olympiad (IESO) in South Korea, placing among the top 30 students in the world."
}