{
    "id": "niya-ma",
    "name": "Niya Ma",
    "profile_pic": "https://media.licdn.com/dms/image/v2/D4E03AQEIdH4fEpYJoA/profile-displayphoto-shrink_200_200/profile-displayphoto-shrink_200_200/0/1670706041193?e=2147483647&v=beta&t=Oz-BXvFxQE0HDtBNt9YYFAUAgx800e-7MDwCIjJuNmk",
    "contacts": [
        "niya-ma.com"
    ],
    "links": [
        "https://www.linkedin.com/in/niya-ma",
        "https://niya-ma.com"
    ],
    "short_description": "Software Engineer at Oracle OCI with experience in automation and cloud infrastructure. Graduated Magna Cum Laude from Davidson College with double majors in Computer Science and Mathematics. Former Director of Hack@Davidson and President of Association For Women In Mathematics.",
    "long_description": "Niya Ma is a Software Engineer at Oracle Cloud Infrastructure (OCI) who graduated Magna Cum Laude from Davidson College with double majors in Computer Science and Mathematics. Her professional experience includes software engineering internships at Oracle, where she pioneered a Python script that accelerated network traffic simulation by 250x, and at Qualtrics, where she worked on the Developer Experience team creating efficient updating mechanisms for multiple services.\n\nThroughout her academic career, Niya demonstrated leadership as the President of the Association For Women In Mathematics - Davidson Chapter and as Director of Hack@Davidson. She also served as a Teaching Assistant for Numerical Analysis and was involved in machine learning research at Davidson College, applying ML methods to process Argon-46 detector images.\n\nNiya has an impressive track record in hackathons, winning multiple awards including 2nd Place at the Twilio LLM Hackathon, Best project using Wolfram API at Stanford LLM x Law Hackathon, and several other recognitions for security, sustainability, and creative solutions. She is proficient in both English and Mandarin with native or bilingual proficiency.\n\nHer technical skills are validated by certifications including completing 100 AlgoExpert Questions and R Programming from Coursera. Niya's academic coursework covered advanced topics such as Natural Language Processing, Concurrent & Parallel Computing, Deep Learning, Operating Systems, Competitive Coding (C++), Database Systems, and Applied Cryptography. She also took CS229 - Machine Learning at Stanford University in 2023.\n\nBeyond her technical achievements, Niya was active in campus life as part of Davidson Chorale and as a Student Leader in the Residence Life Office, demonstrating her well-rounded character and commitment to community engagement."
}