{
    "id": "parsa-idehpour-8b0a8628a",
    "name": "Parsa Idehpour",
    "profile_pic": "https://media.licdn.com/dms/image/v2/D4E03AQEKIIQrvvsguA/profile-displayphoto-shrink_200_200/profile-displayphoto-shrink_200_200/0/1700958015122?e=2147483647&v=beta&t=K36o7k8PMVpyM46GSO-PG8mMKHRTZV11lzWdWdv2u7s",
    "contacts": [
        "983 followers",
        "500+ connections"
    ],
    "links": [
        "https://www.linkedin.com/in/parsa-idehpour-8b0a8628a"
    ],
    "short_description": "Parsa Idehpour is a Math & CS student at the University of Pennsylvania pursuing an MSE in Robotics with AI and Machine Learning specialization. He is currently engaged in machine learning research at Penn Engineering and works as a Junior Analyst at Wharton Analytics Fellows.",
    "long_description": "Parsa Idehpour is a dedicated student at the University of Pennsylvania pursuing dual academic paths: a Bachelor's degree in Math and Computer Science (2023-2026) with minors in Statistics and Engineering Entrepreneurship, alongside a Master of Science in Engineering in Robotics with AI and Machine Learning specialization (2024-2026) at the prestigious GRASP Lab.\n\nHis professional experience includes multiple research roles at Penn. As a Machine Learning Researcher at Penn Engineering (April 2024-Present), he is investigating how neural networks avoid overfitting through \"sloppiness\" patterns, working under Dr. Pratik Chaudhari with support from NSF CAREER awards and industry partnerships with Amazon and Intel. Simultaneously, he conducts Mathematical Economics Research (October 2023-Present), developing models for evolutionary game theory and switching costs under the supervision of Dr. Akcay and Dr. Plotkin.\n\nIn addition to his research work, Parsa serves as a Junior Analyst at Wharton Analytics Fellows (February 2024-Present), where he builds and trains machine learning models to analyze worker absenteeism for Dallas Area Rapid Transit (DART), utilizing Python and SQL for data analysis.\n\nWith 983 followers and over 500 connections on LinkedIn, Parsa is actively engaged in the academic and professional community, particularly in the fields of machine learning, AI, and mathematical modeling. His diverse academic background and research experience demonstrate his commitment to advancing the field of artificial intelligence and its applications."
}