{
    "id": "radostin-cholakov-bb4422146",
    "name": "Radostin Cholakov",
    "profile_pic": "https://media.licdn.com/dms/image/v2/D4D03AQHEJPyHH2j69w/profile-displayphoto-shrink_200_200/profile-displayphoto-shrink_200_200/0/1683628003889?e=2147483647&v=beta&t=jK1Tv5KX4luuRipBWQYTtCZ6JDhvcQDN37tk-f9BVJQ",
    "contacts": [
        "radostin.cholakov@example.com"
    ],
    "links": [
        "https://www.linkedin.com/in/radostin-cholakov-bb4422146",
        "https://github.com/RSG-Group/RSG-Chess-API",
        "https://anygoalanytime.com/",
        "http://smileforafrica.eu"
    ],
    "short_description": "Radostin Cholakov is a researcher and developer with expertise in artificial intelligence and machine learning, particularly focused on natural language processing and deep learning architectures. He is a Google Developer Expert, Forbes \"30 under 30\" recipient, and has published several papers on topics including large language model quantization and task-oriented dialogue systems.",
    "long_description": "Radostin Cholakov is an accomplished young researcher and developer in the field of artificial intelligence and machine learning. His research focuses on natural language processing, deep learning architectures, and efficient model optimization techniques.\n\nHe has published several significant papers, including work on distributional quantization of large language models, efficient task-oriented dialogue systems, and enhanced deep learning architectures for tabular modeling with his GatedTabTransformer. His research has earned him multiple prestigious awards, including an Honorable Mention from AAAI and First Award by Mawhiba at Regeneron ISEF'23, Second Award at the European Contest For Young Scientists 2022, and Second award from ACM at Regeneron ISEF'22.\n\nRadostin has been recognized as part of Forbes \"30 under 30\" in 2021 and received the Presidential Award \"John Atanasoff\" for exceptional results in National IT Competitions. He is also a member of the Google Developer Experts program since November 2022.\n\nHis volunteer work includes contributions to the Smile for Africa Foundation as a Full-Stack Software Engineer and involvement with Google Developers Group Sofia. He has developed several projects including the RSG Chess API and AnyGoal.\n\nAcademically, Radostin has connections to Stanford University and has completed numerous certifications in machine learning, mathematics for machine learning, Bayesian statistics, and scientific writing through Coursera. He scored 1510/1600 on the SAT with a perfect 800 in Math.\n\nHe is fluent in Bulgarian (native) and has professional working proficiency in English. His activities on LinkedIn show a strong interest in following developments in machine learning, particularly in areas related to large language models, translation systems, and AI research advancements."
}