{
    "id": "rez-havaei",
    "name": "Rez Havaei",
    "profile_pic": "https://media.licdn.com/dms/image/v2/D5603AQGyYJGEL1Yusg/profile-displayphoto-shrink_200_200/B56ZTEe9TbHsAY-/0/1738463238633?e=2147483647&v=beta&t=3Orze9_MciQqEapXAkJyh8T3AwY0usTcDqgYmoI_Pss",
    "contacts": [
        "2K followers",
        "500+ connections"
    ],
    "links": [
        "https://www.linkedin.com/in/rez-havaei"
    ],
    "short_description": "Co-Founder and CEO of General Analysis (YC S24) with extensive experience in AI, machine learning, and quantitative trading. Former Founding Engineer at vals.ai and intern at Jane Street, Snap Inc., Cohere, and NVIDIA.",
    "long_description": "Rez Havaei is the CEO and Co-Founder of General Analysis, a Y Combinator-backed startup (S24 batch). His career showcases a strong foundation in AI, machine learning, and quantitative finance.\n\nPrior to founding General Analysis, Rez served as a Founding Engineer at vals.ai for 7 months. His professional journey includes impressive internships at leading tech and finance companies: Quantitative Trading intern at Jane Street, Applied Research Intern in Deep Learning at Snap Inc., Machine Learning Engineering Intern at Cohere, and Quantitative Trading Intern at Susquehanna International Group (SIG).\n\nRez also gained valuable research experience as a Researcher at USC Information Sciences Institute and in Applied Research focusing on Artificial Intelligence at NVIDIA. His academic background includes roles as a Research Assistant and Teaching Assistant at UC Davis.\n\nHis education includes a Bachelor of Science degree from the University of California, Davis (2018-2023) with an impressive Engineering GPA of 3.97. He also attended the National Organization for Development of Exceptional Talents (Sampad) for his high school education and participated in Y Combinator's S24 batch.\n\nRez has completed several professional courses including Coursera's AI for Medical Diagnosis Specialization, Deep Learning Specialization, Statistical Inferences from Eindhoven University of Technology, and GAN Specialization, demonstrating his commitment to continuous learning in the field of artificial intelligence and machine learning."
}