{
    "id": "ricardo-skewes-zorrilla-882084159",
    "name": "Ricardo Skewes Zorrilla",
    "profile_pic": "https://media.licdn.com/dms/image/v2/C4E03AQGdjg9dMgMgaw/profile-displayphoto-shrink_200_200/profile-displayphoto-shrink_200_200/0/1639253413496?e=2147483647&v=beta&t=JBICJ8qbTT0shdzjywSD1QQMy50sgNGWcRsRg7mIsEU",
    "contacts": [
        "ricardo-skewes-zorrilla-882084159"
    ],
    "links": [
        "https://ricardoskewes.github.io/CoviDetectives/index.html",
        "https://hongkunparklab.com/",
        "https://edib.harvard.edu/language-exchange"
    ],
    "short_description": "Physics and Computer Science student at Harvard University with expertise in quantum computing, data analysis, and international relations. Fluent in six languages and experienced in research, leadership, and cross-cultural collaboration. Currently working as a Business Analyst at Alibaba Group.",
    "long_description": "Ricardo Skewes Zorrilla is a Physics and Computer Science student at Harvard University (2021-2025) with a remarkable academic and professional background. Currently working as a Business Analyst at Alibaba Group in Mexico, he combines technical expertise with international experience.\n\nRicardo has held leadership positions in several Harvard organizations, including Vice President of the Harvard College Quantum Computing Association and Co-President of Harvard International Relations on Campus. His research experience includes work at the Harvard Radcliffe Institute and undergraduate research in solid-state physics under Professor Hongkun Park, where he worked with 2D transition metal dicholchogenides and created Van der Waals heterostructures.\n\nHis professional experience extends to ESG consulting at PwC in Shanghai, where he spearheaded sustainable design strategies for a $100M real estate project and presented entirely in Mandarin Chinese. He has also worked as a Research Partner at the Harvard Radcliffe Institute, examining primary and secondary sources from Macao and writing chapter summaries in Portuguese.\n\nRicardo is multilingual, with proficiency in Spanish (native), English, French, Chinese (full professional proficiency), Russian (professional working), and German (limited working). His technical skills are evidenced by his achievements in various competitions, including 2nd place at the MIT Quantum Computing Hackathon 2024, winning Microsoft's Student Hackathon, and medals in international physics competitions.\n\nHis academic coursework includes advanced subjects such as Quantum Computing, Geometric Machine Learning, Information Theory, and Advanced Modern Chinese. Ricardo has also been recognized with numerous awards, including the Franklin Ford Award 2024 from Harvard University and multiple medals in international physics competitions.\n\nRicardo's commitment to international collaboration is demonstrated through his work with the Harvard Undergraduate Foreign Policy Initiative, where he co-wrote a white paper on internet laws in the US and China, and his role as Head of the 75YAMUN Conference in collaboration with the United Nations Information Center for Mexico, Cuba, and the Dominican Republic."
}