{
    "id": "ronakmalik",
    "name": "Ronak Malik",
    "profile_pic": "https://media.licdn.com/dms/image/v2/D5603AQH-KxSKBLRowA/profile-displayphoto-shrink_200_200/profile-displayphoto-shrink_200_200/0/1723689518420?e=2147483647&v=beta&t=o22-OQmaTSJBirwjQjg_W7AEq7mAn39VNdBtCayGF28",
    "contacts": [
        "Greater Houston"
    ],
    "links": [
        "https://github.com/BeyondPerception"
    ],
    "short_description": "Computer Science student at Harvard University with experience in software engineering and aerospace. Currently working as a Software Engineer at Altitude with previous internships at SpaceX, AMD, and NASA.",
    "long_description": "Ronak Malik is a Computer Science student at Harvard University (2021-2025) with a strong background in software engineering and aerospace technology. He is currently working as a Software Engineer at Altitude (June 2024-Present). \n\nHis professional experience includes serving as an Avionics Software Responsible Engineer at Texas Rocket Engineering Lab for 3 years (March 2021-February 2024), where he contributed to rocket engineering projects. He completed a Starship Software Internship at SpaceX in Hawthorne, California (May-August 2023), and a Machine Learning Frameworks Internship at AMD in Austin, Texas (May-August 2022).\n\nRonak also worked as a Software Engineering Intern at Houston Radar LLC (June-August 2021) and as a HUNCH Developer at NASA (September 2018-August 2020), where he developed a remote inspection system for a 4-axis Sherline mill with an HD inspection camera, allowing engineers to conduct inspections of circuit boards and flight parts without needing to visit manufacturing facilities.\n\nHis educational background includes a Bachelor's degree in Computer Science from Harvard University (2021-2025) and high school education at Cypress Woods High School (2017-2021). He has obtained certifications in \"Build a Modern Computer from First Principles\" courses through Coursera.\n\nWith 331 followers and 329 connections on LinkedIn, Ronak has demonstrated interest in rocket engineering, software development, and aerospace technology through his professional experiences and educational pursuits."
}