{
    "id": "samuel-xie-56544b202",
    "name": "Samuel Xie",
    "profile_pic": "https://static.licdn.com/aero-v1/sc/h/9c8pery4andzj6ohjkjp54ma2",
    "contacts": [
        "226 followers",
        "226 connections"
    ],
    "links": [
        "https://www.linkedin.com/in/samuel-xie-56544b202"
    ],
    "short_description": "Samuel Xie is an Electrical Engineering & CS undergraduate student at Caltech (2024-2028). He currently works as an Engineer at PARSEC (Caltech Rocketry Club) and as an Undergraduate Researcher at Husker Lab, focusing on geophysics modeling of earthquakes.",
    "long_description": "Samuel Xie is an Electrical Engineering & Computer Science undergraduate student at the California Institute of Technology (Caltech), pursuing his Bachelor's degree from 2024 to 2028. He previously attended The Lawrenceville School from 2020 to 2024.\n\nCurrently, Samuel serves as an Engineer at PARSEC (Caltech Rocketry Club), where he contributes to the MARS/FAR Challenge with the goal of launching a rocket to 45,000 ft and ensuring stable recovery. His responsibilities include designing and implementing a PWM (Pulse Width Modulation) control system to assist in stabilizing the rocket during descent, and developing control algorithms and integrating hardware/software systems to manage recovery dynamics effectively.\n\nSimultaneously, Samuel works as an Undergraduate Researcher at Husker Lab at Caltech, conducting geophysics modeling of earthquakes using Python to analyze seismic data and simulate earthquake behavior. He performs data analysis on seismic datasets to identify trends, patterns, and insights related to earthquake dynamics, and utilizes Python-based tools and libraries for numerical simulations, signal processing, and visualization of geophysical phenomena.\n\nSamuel has received several notable awards, including the Hubert Alyea Award from the Princeton Section of the American Chemical Society & Princeton University Department of Chemistry for excellence in the study of Chemistry (May 2024), National Merit Scholar Finalist (May 2024), USACO Gold Division from USA Computing Olympiad (Dec 2022), 2023 Scholastic All-American from USA Swimming (awarded to an athlete with a Winter Junior National Qualifying Time and a GPA of 3.5 or above), and qualified three times for the American Invitational Mathematics Exam from the Mathematical Association of America (2021-2023) in both the AMC 10 & 12."
}