{
    "id": "sheryl-chen-489b892a1",
    "name": "Sheryl Chen",
    "profile_pic": "https://media.licdn.com/dms/image/v2/D5603AQF7_QG5tfr-OA/profile-displayphoto-shrink_200_200/profile-displayphoto-shrink_200_200/0/1707247264534?e=2147483647&v=beta&t=pLLl0q8_b7J7d3UeTvTjW8tT5-kVRKRwOWjNeMq120M",
    "contacts": [
        "https://www.linkedin.com/in/sheryl-chen-489b892a1"
    ],
    "links": [
        "https://sherylchen.com/"
    ],
    "short_description": "Computer Science student at Stanford University with experience as a Software Engineer at rézme and Fundusol, LLC. Also worked as an NLP Researcher at Stanford Institute for Economic Policy Research and has a background in debate coaching.",
    "long_description": "Sheryl Chen is a Computer Science student at Stanford University with a diverse portfolio of technical and leadership experiences. She currently works as a Software Engineer at rézme (since December 2024) and serves as a Debate Coach at Menlo School in Atherton, California.\n\nPreviously, she worked as a Software Engineer at Fundusol, LLC from April to December 2024, where she developed an internal UI to simulate agrivoltaic systems using Django, Celery, Redis, HTML, CSS, SQLite, and Chart.js. She also secured contracts with leading international solar development companies.\n\nFrom January to July 2024, Sheryl was an NLP Researcher at the Stanford Institute for Economic Policy Research, where she was advised by Dr. Ashrakat Elshehawy. Her work involved various machine learning and data science projects using NLP and OCR to extract insights related to social sciences. She presented her research at the 2024 Global Development Research Symposium.\n\nSheryl also served as a Project Management Mentor at StreetCode Academy in East Palo Alto from January to March 2024, where she mentored 17+ adult learners on project management life cycles, methodologies, and approaches.\n\nIn the summer of 2023, she interned at Auburn University's Data Science and Engineering Laboratory, testing and comparing state-of-the-art video analysis models within MMAction2, a PyTorch toolbox for action recognition and temporal modeling. She also conducted a literature review of research on 3D CNN image classification.\n\nSheryl has received several notable awards, including a Perfect Score on the AP Research Exam (top 1.14% globally in 2022), being named the 2022 CA National History Day Champion in the Historical Paper division, receiving Special Congressional Recognition in 2020 for co-founding Fighting for Heroes (which donated over 40,800 masks to hospitals and vulnerable communities), and ranking 2nd Nationally in Parliamentary Debate.\n\nShe is a Lifetime Girl Scout Member with Girl Scouts of Northern California Troop 62410, demonstrating her long-term commitment to community service and leadership development."
}