{
    "id": "sohvasa",
    "name": "Soham Vasanawala",
    "profile_pic": "https://media.licdn.com/dms/image/v2/D5603AQEXyl3g-sHJ1w/profile-displayphoto-shrink_200_200/profile-displayphoto-shrink_200_200/0/1702666283417?e=2147483647&v=beta&t=lWQE841Q89GD6tm4CSE01oM28SAOLdtfJ-H5irJaXrw",
    "contacts": [
        "1K followers",
        "500+ connections"
    ],
    "links": [
        "https://www.amazon.com/Entrepreneurial-Insights-Essays-Interviews-Entrepreneurs/dp/B0BGQ87BRX/"
    ],
    "short_description": "Soham Vasanawala is a Math student at Stanford University with interests in data science and biotech. He is the co-founder of Intratalent AI and Gains Coach LLC, and has experience in medical research and software engineering.",
    "long_description": "Soham Vasanawala is currently pursuing a Bachelor of Science degree in Mathematics at Stanford University (2023-2027), maintaining a perfect 4.0 GPA. He is the co-founder of two companies: Intratalent AI (founded November 2024) and Gains Coach LLC (founded December 2021), where he is developing a real-time, AI-powered coaching platform for physical movements including physiotherapy, sports, fitness, and dance.\n\nHis professional experience includes research internships at Stanford University School of Medicine, where he developed a real-time augmented-reality visualization of knee motion from MRI data for the HoloLens2, and at Stanford University School of Engineering, where he designed and conducted research that led to a time-saving algorithm for a medical procedure, which was presented at Stanford BioX 2022 and ISMRM 2023. He also worked as a Software Engineer at Turboprop, a fintech startup, in the summer of 2022.\n\nSoham graduated from Henry M. Gunn High School with a 4.6 weighted GPA and 4.0 unweighted GPA. He has published \"Essays and Interviews with Bay Area Entrepreneurs\" on Amazon in September 2022. He is proficient in English (native) and has limited working proficiency in French. Soham is also a member of The International Society for Magnetic Resonance in Medicine, demonstrating his continued interest in the intersection of technology and healthcare."
}