{
    "id": "spike-ocarroll",
    "name": "Spike O'Carroll",
    "profile_pic": "https://media.licdn.com/dms/image/v2/D5603AQGsjEOYcE2YvA/profile-displayphoto-shrink_200_200/B56ZPbObIrHoAg-/0/1734549812941?e=2147483647&v=beta&t=7v7hKutq7Sfk3KWW4gymu0wnjIg9sKLlPeToEbstD8s",
    "contacts": [
        "spike.codes"
    ],
    "links": [
        "https://spike.codes"
    ],
    "short_description": "CS student at UC Irvine specializing in AI/ML with a 3.95 GPA. Incoming SWE Intern at Ramp and co-founder of Dispatch AI. Previously built Libreddit with 4M+ monthly users and worked as a Software Engineer at Portal. Award-winning hackathon participant with over $120k in total winnings.",
    "long_description": "Spike O'Carroll is a Computer Science student at UC Irvine specializing in Intelligent Systems (AI/ML), maintaining a 3.95 GPA. He has an impressive track record as both a software engineer and entrepreneur.\n\nCurrently, he is an incoming Software Engineering Intern (Backend) at Ramp for Summer 2025 and serves as the CEO/Co-Founder of Dispatch AI, an AI-powered 911 operator system that uses empathy-driven emergency response to empower dispatch centers. Dispatch AI has received grants from OpenAI, Intel, Skydeck, and Mistral AI, and won the $50,000 Grand Prize at the 2024 UC Berkeley AI Hackathon. The startup was accepted into Berkeley Skydeck's Pad-13 Program, which has a 1% acceptance rate.\n\nPreviously, Spike worked as a Software Engineer Intern at Portal, where he shipped 80+ features to an AI web browser serving 30,000 users monthly. He built a high-performance vector database in Rust with SQL query support and developed a conversational voice AI with web agent capabilities.\n\nOne of his most notable achievements is creating Libreddit (now Redlib), a private and customizable Reddit client that gained over 4 million monthly active users, 5,000 GitHub stars, and had 20+ instances hosted globally. He also developed Peacock Browser, which garnered 30,000 downloads.\n\nSpike has an impressive record in competitions, winning first place in multiple prestigious events including the UC Berkeley AI Hackathon (2024), LAHacks Google Company Challenge (2024), UCI Stella Zhang New Venture Competition (2024), UCI Butterworth Product Design Competition (2024), and UCI AI Innovation Challenge (2024). His total competition winnings exceed $120,000.\n\nHe has also worked as a freelance web developer since 2021, building high-converting websites and branding for businesses. His designs have been featured in over 30 Adobe Behance collections.\n\nBefore college, Spike attended Culver High School, where he maintained a 3.98 unweighted GPA, scored 1510 on the SAT, and was recognized as an AP Scholar with Honor. He was active in multiple clubs, serving as Programming Club President, Badminton Club President, and Dodgeball Club President.\n\nSpike is passionate about software engineering, entrepreneurship, and UI/UX design, with a proven ability to build successful products and lead teams to victory in competitive environments."
}