{
    "id": "suresh-nambi-13036a120",
    "name": "Suresh Nambi",
    "profile_pic": "https://media.licdn.com/dms/image/v2/D5603AQFUKOWLiXF3ww/profile-displayphoto-shrink_200_200/B56ZUbb_1nGsAY-/0/1739922079620?e=2147483647&v=beta&t=PXGsGlsN50304hTFWPDnHUOzW4TEgC3-jjoYOo1vLtQ",
    "contacts": [
        "Stanford University Department of Computer Science"
    ],
    "links": [
        "https://github.com/SureshNambi/DeBAM_Decoder_based_Approximate_Multiplier"
    ],
    "short_description": "Researcher at Stanford University with expertise in hardware development, focusing on efficient computing architectures for AI applications. Published author with significant work in approximate multipliers, laser-induced graphene, and posit-based neural network designs.",
    "long_description": "Suresh Nambi is a researcher affiliated with Stanford University's Department of Computer Science, where he focuses on the development and implementation of efficient and effective hardware systems. With over 2K followers on LinkedIn, he has established himself as a notable figure in his field.\n\nHis research interests span several areas of hardware design and optimization, particularly for AI applications. Suresh has published multiple peer-reviewed papers in prestigious journals including IEEE Access, Carbon, IEEE Embedded Systems Letters, IEEE Journal of Photovoltaics, and ACS Applied Electronic Materials.\n\nHis notable publications include:\n- \"ExPAN(N)D: Exploring Posits for Efficient Artificial Neural Network Design in FPGA-based Systems\" (IEEE Access, 2021)\n- \"Low-Resistance Laser-Induced Graphitic Carbon by Maximizing Energy Delivery and Pulse Overlap\" (Carbon, 2021)\n- \"DeBAM: Decoder Based Approximate Multiplier for Low Power Applications\" (IEEE Embedded Systems Letters, 2020)\n- \"Performance analysis of submerged polycrystalline photovoltaic cell in varying water conditions\" (IEEE Journal of Photovoltaics, 2019)\n- \"One-Step Fabrication of Low-Resistance Conductors on 3D-Printed Structures by Laser-Induced Graphene\" (ACS Applied Electronic Materials)\n\nSuresh has made his work on approximate multipliers open source, demonstrating his commitment to advancing the field through collaborative efforts. His research appears to bridge multiple disciplines, including computer architecture, energy-efficient computing, materials science, and photovoltaic technology.\n\nBased on his activity on LinkedIn, he maintains connections with professionals in semiconductor companies, academic institutions, and research organizations, suggesting a broad professional network in the hardware and computing research community."
}