{
    "id": "timofey-obraztsov",
    "name": "Timofey Obraztsov",
    "profile_pic": "https://media.licdn.com/dms/image/v2/D5603AQFGFig-GZwtvg/profile-displayphoto-shrink_200_200/profile-displayphoto-shrink_200_200/0/1700889846712?e=2147483647&v=beta&t=Ys48tPtReJw1H9JmErPan0xCnjXru9jAa0Mmuwv9AL8",
    "contacts": [
        "timofey-obraztsov@linkedin.com"
    ],
    "links": [
        "https://www.linkedin.com/in/timofey-obraztsov/"
    ],
    "short_description": "Computer Science student at UC Irvine with experience as a Founding Engineer at Aurora Media and Co-Founder of a stealth startup in the MIT StartHouse 2024 Cohort. Passionate about software engineering, full-stack development, and AI, with a background in developing industry-standard software solutions.",
    "long_description": "Timofey Obraztsov is a Computer Science student at UC Irvine (Class of 2027) with aspirations to double major in business. His journey in technology began early when his mother introduced him to programming through a C++ for Dummies book. Growing up in Moscow, he actively participated in coding workshops and dual enrollment classes to build his knowledge in computer science.\n\nCurrently, Timofey serves as a Founding Engineer at Aurora Media (AM) and is a Co-Founder of a stealth startup that's part of the MIT StartHouse 2024 Cohort. His startup work focuses on redefining commercial real estate industry due diligence standards by creating an AI Copilot for real estate agents and investors that expedites property risk analysis, damage assessment, and HOA compliance conflict identification.\n\nHis professional experience includes roles as a Software Engineer Intern at Corent Technology, Software Engineer Researcher at UC Irvine's Donald Bren School of Information and Computer Sciences, and Software Developer at Palos Verdes Peninsula Land Conservancy. At the Land Conservancy, he created industry-standard software for trail watch report submissions, improving database loading speed by 30%, and developed web crawling bots for social media metrics analysis.\n\nTimofey is actively involved in campus organizations, serving as a Developer for UCI ICS Student Council, an Executive at Artificial Intelligence at UCI, and previously worked with the Associated Students of University of California, Irvine (ASUCI) on Academic Engagement and Higher Education Opportunities Commissions.\n\nHis project portfolio includes work on Proximity, Regretful App, EasyPC, Quickier App, and WhitelistAIO Bot, demonstrating his versatility in software development. With a strong foundation in software engineering, full-stack development, data analytics, and business administration, Timofey continues to expand his skills while pursuing his education at UC Irvine."
}