{
    "id": "vivek-vajipey",
    "name": "Vivek Vajipey",
    "profile_pic": "https://media.licdn.com/dms/image/v2/D5603AQET6mgXE42DNw/profile-displayphoto-shrink_200_200/profile-displayphoto-shrink_200_200/0/1719107890138?e=2147483647&v=beta&t=oycbSSqTgvtWznKQ1MSh1Ut2y48zsfE21OMiOOk7uS4",
    "contacts": [
        "vivek-vajipey@linkedin.com"
    ],
    "links": [
        "https://www.linkedin.com/in/vivek-vajipey/",
        "https://www.mdpi.com/2072-4292/15/17/4123",
        "https://arxiv.org/abs/2411.06590"
    ],
    "short_description": "Vivek Vajipey is a Computer Science student at Stanford University pursuing both BS and MS degrees. He is a researcher at the Stanford Artificial Intelligence Laboratory (SAIL) focusing on reasoning in large language models, and has experience in machine learning applications for agriculture and software engineering.",
    "long_description": "Vivek Vajipey is a talented Computer Science student at Stanford University, currently pursuing both a Bachelor's and Master's degree in the field. His academic journey includes a minor in Geophysics, demonstrating his interdisciplinary interests.\n\nAs a researcher at the Stanford Artificial Intelligence Laboratory (SAIL), Vivek focuses on reasoning in large language models within the Computation & Cognition Lab. His research experience also extends to machine learning applications in agriculture, where he worked with remote sensing data at Stanford's Lobell Lab.\n\nVivek has diverse professional experience, including a fellowship at True Ventures and a software engineering role at Swingtech. He has also taken on leadership responsibilities as the VP of Events for the Stanford Energy Club.\n\nHis academic achievements are complemented by impressive hackathon successes, including winning 1st Place at PennApps XXIV for building CharactAR (an interactive AI+AR experience) and the Best Web3 Hack at Cal Hacks 10.0 for WorldDex (a real-life Pokédex application using Computer Vision and LLMs). Earlier in his academic career, he earned a Silver Medal at the International Earth Science Olympiad.\n\nVivek has contributed to scientific publications, including \"Annual field-scale maps of tall and short crops at the global scale using GEDI and Sentinel-2\" and \"CriticAL: Critic Automation with Language Models,\" showcasing his research capabilities in both environmental science and artificial intelligence.\n\nHis educational background includes graduating from West Windsor-Plainsboro High School North before attending Stanford University, where he is expected to complete his BS in Computer Science by 2025 and his MS by the same year."
}