{
    "id": "wanzinyazar",
    "name": "Wanzin Yazar",
    "profile_pic": "https://static.licdn.com/aero-v1/sc/h/9c8pery4andzj6ohjkjp54ma2",
    "contacts": [
        "392 followers",
        "387 connections"
    ],
    "links": [
        "https://www.linkedin.com/company/d-matrix?trk=public_profile_topcard-current-company",
        "https://www.linkedin.com/school/uc-berkeley/?trk=public_profile_topcard-school"
    ],
    "short_description": "Wanzin Yazar is a professional affiliated with d-Matrix and the University of California, Berkeley. With expertise in AI and machine learning, Wanzin has published research on quantized LLMs, self-selected attention span for accelerating large language model inference, and other technical topics.",
    "long_description": "Wanzin Yazar is a professional working at d-Matrix with connections to the University of California, Berkeley. Their work appears to focus on AI and machine learning, particularly in the optimization and acceleration of large language models (LLMs).\n\nWanzin has published several research papers including \"Combining Multiple Post-Training Techniques to Achieve Most Efficient Quantized LLMs,\" \"Self-Selected Attention Span for Accelerating Large Language Model Inference,\" \"The Self-Upgrading Mobile Application for the Automatic Malaria Detection,\" and \"Through the Looking Glass: Unraveling the Stage-Shift of Acute Rejection in Renal Allografts.\"\n\nTheir professional interests are evident from their LinkedIn activity, which shows engagement with content related to AI inference, semiconductor technology, parallel computing, and machine learning optimization. They frequently interact with posts about AI hardware acceleration, CUDA programming, and advancements in AI chip technology.\n\nWanzin holds certifications including Google Cloud Certified Data Engineer (issued January 2020), Deep Learning Specialization from deeplearning.ai (issued January 2018), and Full Stack Machine Learning on AWS from AI Camp.\n\nTheir achievements include winning the 2019 IBM Call For Code Global Challenge - Best Asian Pacific Quest (September 2019), Grand Prize at AngelHack Silicon Valley 2019 (June 2019), and Best Mobile Hack at SF HACK 2019 (March 2019).\n\nBased on their publications, certifications, and activity, Wanzin appears to be a technical professional with expertise in AI optimization, particularly focused on making large language models more efficient and performant."
}