{
    "id": "yohannes-aklilu",
    "name": "Yohannes Aklilu",
    "profile_pic": "https://static.licdn.com/aero-v1/sc/h/9c8pery4andzj6ohjkjp54ma2",
    "contacts": [
        "yaklilu@stanford.edu",
        "yaklilu@gc-fellow.com"
    ],
    "links": [
        "https://www.linkedin.com/in/yohannes-aklilu/"
    ],
    "short_description": "Engineering student at Stanford University and General Catalyst Venture Fellow with experience in hardware engineering, ML, and aerospace. Currently working at Astranis Space Technologies as an Avionics Intern while pursuing his undergraduate degree.",
    "long_description": "Yohannes Aklilu is an engineering student at Stanford University (2023-2027) with a diverse background spanning venture capital, hardware engineering, machine learning, and aerospace. He currently serves as a General Catalyst Venture Fellow and works as an Avionics Intern at Astranis Space Technologies in San Francisco.\n\nHis professional experience includes working as a Hardware Engineer & ML specialist at Amazon, where he focused on ML quantization for embedded hardware. He has also conducted research at Stanford University's Department of Computer Science, building drones in the PinCS Lab (Pedagogy in Computer Science Lab) under Chris Gregg.\n\nYohannes participated in the Jane Street Focus Fellowship, learning high-order OCaml programming. His previous roles include working as a Software Engineer at the Regional Transportation Commission of Southern Nevada, where he developed quantitative predictive modeling for city car crash data, and serving as a Venture Capital Extern at General Catalyst in New York.\n\nHis research experience extends to NASA, where he tested Aerogel insulation against radiation at 70,000 feet using weather balloon capsules. He has also published research on \"Analysis of Supersonic Parachutes On ReEntry\" at the University of Las Vegas, Nevada, examining the effectiveness of different materials and design factors for supersonic parachutes used in rocket capsule reentry.\n\nBefore Stanford, Yohannes attended Advanced Technologies Academy (2019-2023). He maintains an active interest in technology, aerospace, and venture capital, as evidenced by his engagement with content related to these fields on LinkedIn."
}