{
    "id": "yuwei-qin-7654bb74",
    "name": "Yuwei Qin",
    "profile_pic": "https://media.licdn.com/dms/image/v2/C5603AQGNj7wJGzPTfA/profile-displayphoto-shrink_200_200/profile-displayphoto-shrink_200_200/0/1524618540253?e=2147483647&v=beta&t=Vz3WbczKstX4HNWaaVNw-pyTQPzy0qEoDcCTB52uZOY",
    "contacts": [
        "linkedin.com/in/yuwei-qin-7654bb74"
    ],
    "links": [
        "https://ieeexplore.ieee.org/abstract/document/8954691/",
        "https://aip.scitation.org/doi/full/10.1063/1.5130455",
        "https://ieeexplore.ieee.org/abstract/document/8666753",
        "https://ieeexplore.ieee.org/abstract/document/8360129",
        "https://ieeexplore.ieee.org/abstract/document/8496540",
        "https://iopscience.iop.org/article/10.1088/1361-648X/aab227/meta",
        "https://ieeexplore.ieee.org/abstract/document/8072529",
        "https://ieeexplore.ieee.org/abstract/document/7933931",
        "https://ieeexplore.ieee.org/abstract/document/7893155"
    ],
    "short_description": "Yuwei Qin is a professional at d-Matrix with a background from Carnegie Mellon University. He has expertise in machine learning, deep neural networks, and computational electromagnetics with numerous published research papers. His work focuses on AI hardware and computational solutions.",
    "long_description": "Yuwei Qin is a results-driven professional currently working at d-Matrix, with a strong educational foundation from Carnegie Mellon University. He has established himself as an expert in the fields of machine learning, deep neural networks, computational electromagnetics, and magnetic recording technologies.\n\nHis research background is extensive, with multiple publications in prestigious journals including IEEE Transactions on Magnetics, AIP Advances, IEEE Magnetics Letters, and Journal of Physics: Condensed Matter. His work spans various technical domains including deep neural networks for data detection, heat-assisted magnetic recording, machine learning-based computational electromagnetics, and electrically tunable polarizers.\n\nYuwei has received numerous academic accolades, including the Dean's Fellowship from the Department of ECE, Talented Development Scholarship from the Hong Kong Government, EE72 K.M. Yung Scholarship from the University of Hong Kong, Lee Shau Kee Scholarship for Student Enrichment, and the Centenary Prize for EEE Project by HKUEEE and IBM China/Hong Kong Limited.\n\nHis educational background includes extensive coursework in advanced technical subjects such as Algorithm Design & Analysis, Computer Vision, Convex Optimization, Deep Learning, Machine Learning, Statistical Machine Learning, Quantum Mechanics, Solid State Physics, and Random Processes.\n\nAccording to a recommendation from Ivan Simões Gaspar, Yuwei excels in modeling and prototyping, developing innovative context-aware solutions that leverage advanced technologies including head-mounted display inertial and acoustic sensors, real-time connectivity, remote computing, and machine learning. He is described as curious, flexible, result-oriented, and possessing a growth mindset that allows him to adapt quickly to dynamic situations.\n\nWith 806 followers and over 500 connections on LinkedIn, Yuwei is an active professional who regularly engages with content related to AI, machine learning, and computational technologies."
}