{
    "id": "zeyneb-kaya",
    "name": "Zeyneb Kaya",
    "profile_pic": "https://media.licdn.com/dms/image/v2/D5603AQEi8fKQahmGtg/profile-displayphoto-shrink_200_200/profile-displayphoto-shrink_200_200/0/1690337858570?e=2147483647&v=beta&t=BTSlMq9TxiLQWJvcQ_FTX7rWmsDAroNBU8k_LBxsRiQ",
    "contacts": [
        "zeyneb-kaya@stanford.edu"
    ],
    "links": [
        "https://www.zeynebnk.com/"
    ],
    "short_description": "CS student at Stanford University and accomplished researcher in AI with a focus on NLP. Zeyneb is a Regeneron Science Talent Search Top 5 Winner, Coca Cola Scholar, and NCWIT Aspirations in Computing National Winner with multiple publications in computational linguistics and machine learning.",
    "long_description": "Zeyneb Kaya is a Computer Science student at Stanford University (2024-2028) with an impressive research background in artificial intelligence, particularly in natural language processing. Her research interests focus on understanding and advancing NLP algorithms, exploring areas in data efficiency and interpretability to enhance the robust reasoning capabilities of algorithms beyond shallow pattern memorization.\n\nAs a researcher, Zeyneb has contributed to multiple publications including work on large language models, word embeddings for low-resource languages, data augmentation methods for neural machine translation, and language contact in code-switching. Her academic excellence has been recognized through numerous prestigious awards, including placing 5th in the Regeneron Science Talent Search ($90K winner), being named a Coca Cola Scholar in 2024, and receiving the NCWIT Aspirations in Computing National Award.\n\nPrior to Stanford, Zeyneb attended Saratoga High School (2020-2024) where she was recognized as a National Merit Finalist and AP Scholar with Distinction. She also completed dual enrollment courses at West Valley College, including advanced mathematics courses with a perfect 4.0 GPA.\n\nZeyneb has gained research experience as an intern at both Stanford University and San Jose State University (2021-2024). She is also the Founder and President of Romeyka Everlasting, and serves as an Ambassador for Women in Data Science (WiDS) Worldwide since March 2022.\n\nHer technical expertise is evidenced by multiple certifications in Natural Language Processing, Computer Vision, and Data Science from Coursera and Udemy. Zeyneb is multilingual, with native proficiency in English and Turkish, and limited working proficiency in Chinese.\n\nBeyond her academic achievements, Zeyneb has demonstrated leadership through winning hackathons (TreeHacks 2025 Prize Winner) and participating in competitive events like the Online Linguistics Olympiad (10th Place, 1st in USA 2023) and the North American Computational Linguistics Olympiad."
}