{
    "id": "zhangalv",
    "name": "Alvin Zhang",
    "profile_pic": "https://media.licdn.com/dms/image/v2/D5603AQGR-LGMvC8sow/profile-displayphoto-shrink_200_200/profile-displayphoto-shrink_200_200/0/1730348155423?e=2147483647&v=beta&t=aPQpdFhMYP1H44PDEEeFUWC6TCbkolyD_6S20QikdAI",
    "contacts": [
        "zhangalv@neweraventures.com"
    ],
    "links": [
        "https://www.linkedin.com/in/zhangalv"
    ],
    "short_description": "Electrical Engineering + CS student at Caltech with experience in venture capital, machine learning research, and engineering. Currently a Venture Fellow at New Era Ventures and involved in multiple research projects at Caltech.",
    "long_description": "Alvin Zhang is an undergraduate student pursuing a BS in Electrical Engineering and Computer Science at Caltech. He is currently a Venture Fellow at New Era Ventures, where he focuses on early-stage investing. His academic and professional interests span multiple technical domains including machine learning, statistical mechanics, and avionics engineering.\n\nAt Caltech, Alvin is engaged in several research projects, including enhancing LLM agents as a Machine Learning Researcher and working on long-range statistical mechanics models and simulations under the mentorship of Prof. Tom Hutchcroft. He is also an Avionics Engineer at PARSEC - Caltech Rocketry, where he implements rocket communication protocols through hardware and software development.\n\nAlvin has demonstrated leadership as an Event Organizer for Hacktech, Caltech's annual hackathon, where he handles logistics and sources sponsorships. He was previously an Undergraduate Fellow at the Caltech AI Alignment (CAIA) Machine Learning Fellowship, collaborating on novel AI research.\n\nBefore Caltech, Alvin attended Lakeside School from 2020 to 2024, where he co-founded and served as Co-President of the Computer Science Club and was on the Varsity Swim team. His achievements include being named to the 2022-23 NISCA Swimming and Diving All American team, the USA Swimming 2022-2023 Scholastic All-America Team, receiving the President's Volunteer Service Award - Silver from AmeriCorps, qualifying for AIME with Distinction four times, and being a National Merit Scholarship Finalist.\n\nAlvin also has experience in community service, having founded and served as Club President for an American Red Cross chapter from August 2021 to June 2024."
}