{
    "id": "aadit-juneja",
    "name": "Aadit Juneja",
    "profile_pic": "https://media.licdn.com/dms/image/v2/D5603AQG1r1EUCVZW7w/profile-displayphoto-shrink_200_200/profile-displayphoto-shrink_200_200/0/1727810515258?e=2147483647&v=beta&t=SMjOHwHIX-97dOcdr-UEizlT-bEypLChv05n7Slrvsg",
    "links": [
        "https://aaditjuneja.com",
        "https://www.linkedin.com/in/aadit-juneja",
        "https://github.com/ajuneja23"
    ],
    "short_description": "Aadit Juneja is a student in the prestigious Jerome Fisher M&T Program at UPenn, pursuing dual degrees in Finance from Wharton and Computer Science from Penn Engineering. He has research experience in multimodal language models for tumor contouring at Penn Medicine and is preparing for a quantitative trading internship at Five Rings while actively publishing technical articles on AI and language models.",
    "long_description": "Aadit Juneja is an ambitious undergraduate student in the highly selective Jerome Fisher Management & Technology (M&T) Program at the University of Pennsylvania, where he is pursuing dual degrees in Finance from The Wharton School and Computer Science from Penn Engineering.\n\nHis professional experience demonstrates a strong interest in the intersection of finance and technology. Aadit is preparing for a Quantitative Trading Internship at Five Rings in New York (January-February 2025) and recently completed a Fall Private Equity Analyst role at Leo Legacy in Philadelphia (August-October 2024). \n\nWhat sets Aadit apart is his research experience in artificial intelligence applications in healthcare. During Summer 2024, he worked as a Research Assistant at Penn Medicine, University of Pennsylvania Health System, focusing on multimodal language models for tumor contouring. This experience highlights his ability to apply advanced AI techniques to solve complex medical problems.\n\nAcademically, Aadit maintains a perfect 4.0 GPA and is actively involved in several finance and analytics-focused student organizations, including the Wharton Investment and Trading Group, Wharton Analytics Fellows, and Wharton Undergraduate Distressed Investing Group.\n\nAadit is also a prolific technical writer, regularly publishing articles on his personal website about cutting-edge AI topics. His recent publications include \"A Distributed Inference Engine for SmolLM with Rust and gRPC,\" \"RL for Training Multiple Decoding Heads -- An Inference Acceleration Method in Language Models,\" and \"Frequency Based Constrained Decoding for Language Model Watermarks.\" He has also written about practical AI applications like \"Agent for Seamless Meeting Scheduling\" and financial analysis with \"Tempus AI Short Recommendation.\"\n\nAs a developer, Aadit maintains an active GitHub profile (ajuneja23) with repositories focused on AI, machine learning, and practical applications. His projects include implementations of Monte Carlo integration, PPO (Proximal Policy Optimization) algorithms from scratch, and an Agentic Meeting Scheduler, demonstrating his technical skills in both finance and computer science domains.\n\nHis contact information includes his email (aadit@aaditjuneja.com) and phone number (224-443-2889), making him accessible for professional and academic opportunities.\n\nAadit's dual expertise in finance and computer science, combined with his research experience in healthcare AI applications and technical writing skills, positions him uniquely at the intersection of these rapidly evolving domains."
}