{
    "id": "aaquib-syed",
    "name": "Aaquib Syed",
    "profile_pic": "https://media.licdn.com/dms/image/v2/D4E03AQF6WA6SN7AFbg/profile-displayphoto-shrink_200_200/profile-displayphoto-shrink_200_200/0/1694543181540?e=2147483647&v=beta&t=w0cAWKTW20MPdZGvXbgMAXcxYTSWUaDR9GV9o5xBgfU",
    "links": [
        "https://www.github.com/Aaquib111",
        "https://arxiv.org/abs/2406.11717",
        "https://openreview.net/forum?id=tiLbFR4bJW",
        "https://openreview.net/forum?id=cKlgcx7nSZ",
        "https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0280320",
        "https://www.linkedin.com/in/aaquib-syed/"
    ],
    "short_description": "AI researcher at Google with a focus on interpretability and language model behavior. Aaquib has published significant work on refusal mechanisms in LLMs, attribution patching for circuit discovery, and efficient pruning techniques for massive language models. A Banneker-Key Scholar at the University of Maryland with a strong competitive programming background.",
    "long_description": "Aaquib Syed is an AI researcher currently working at Google while affiliated with the University of Maryland, where he is pursuing a CS and Math degree as a Banneker-Key Scholar (full merit scholarship for the top 0.5% of incoming class). His research focuses on understanding and improving large language models, with particular emphasis on interpretability and model behavior mechanisms.\n\nHis recent publication \"Refusal in Language Models Is Mediated by a Single Direction\" (NeurIPS 2024, Poster) has garnered significant attention with 98+ citations. This groundbreaking work demonstrates that refusal behavior in conversational LLMs is controlled by a one-dimensional subspace across multiple open-source chat models, providing important insights into how safety mechanisms function in these systems.\n\nAaquib has also made significant contributions to automated interpretability research with his work \"Attribution Patching Outperforms Automated Circuit Discovery\" (BlackboxNLP at EMNLP 2024), which has received 47+ citations. In this paper, he developed a simple yet powerful method based on attribution patching that outperforms existing approaches while requiring minimal computational resources - just two forward passes and a backward pass.\n\nIn the area of model efficiency, his research \"Prune and Tune: Improving Efficient Pruning Techniques for Massive Language Models\" (ICLR TinyPapers Workshop 2023, top 6%) advanced techniques for pruning large language models without extensive retraining, addressing critical compute expense issues in deploying massive models.\n\nHis most recent work includes \"Mechanistic Unlearning: Robust Knowledge Unlearning and Editing via Mechanistic Localization\" (2024), exploring techniques for targeted knowledge editing in language models.\n\nBeyond pure AI research, Aaquib has applied machine learning to medical imaging, co-authoring a paper in PLOS ONE that uses XGBoost with MRI and non-imaging data to predict pathological complete response in breast cancer patients undergoing neoadjuvant chemotherapy.\n\nAs a student, Aaquib has received numerous prestigious recognitions, including the USA Computing Olympiad Gold rank and the National Merit Scholarship. He has also developed several projects including a Personal Distance Monitor, a Stress Level Manager for students with autism spectrum disorder, and a FIRST Robotics Competition Scouting system.\n\nAccording to his GitHub profile, Aaquib describes himself as someone who enjoys \"thinking about and solving problems in AI/ML and finance\" with a current interest in \"creating scalable methods to attribute and edit behaviors and knowledge in large language models.\" He also mentions a love for competitive programming, working with low-level languages, and creating infrastructure and trading strategies for financial markets.\n\nHis interests span AI/ML and finance, with a particular focus on solving complex problems at the intersection of these fields. Aaquib's combination of theoretical research and practical applications demonstrates his versatility and depth of expertise in artificial intelligence."
}