{
    "id": "advaitiyer",
    "name": "Advait Iyer",
    "profile_pic": "https://static.licdn.com/aero-v1/sc/h/9c8pery4andzj6ohjkjp54ma2",
    "contacts": [
        "https://www.linkedin.com/in/advaitiyer"
    ],
    "links": [
        "https://advaitiyer.com"
    ],
    "short_description": "Computer Engineer currently working as a Software Engineer at Tesla. Graduate of the University of Michigan with a Bachelor of Science in Engineering. Experienced in C/C++, Verilog/SystemVerilog, and Python with research experience in computer architecture and systems.",
    "long_description": "Advait Iyer is a Computer Engineer with a strong background in computer systems and hardware engineering. He graduated from the University of Michigan with a Bachelor of Science in Engineering (2021-2024) and is currently working as a Software Engineer at Tesla.\n\nHis professional experience includes multiple roles at Tesla, where he has worked as a Software Engineer since February 2025, following previous internships in 2023 and 2024. He has also worked as a Hardware Engineer at Aethero (Sep-Dec 2024) and held various academic positions at the University of Michigan, including Instructional Assistant for Advanced Computer Architecture (EECS 470) and Digital Logic Design (EECS 270), as well as Research Assistant in the CE Lab.\n\nAdvait has contributed to the venture capital space as a Venture Partner at Contrary (Nov 2021-Dec 2024). His earlier experience includes roles at Marathon Digital Holdings as an Engineer (May-Dec 2022) and at KiranaKart (YC W21) in Operations, Growth, and Engineering (2021).\n\nHis research work has been published in the 51st International Conference on Very Large Data Bases with a paper titled \"Vortex: Overcoming Memory Capacity Limitations in GPU-Accelerated Large-Scale Data Analytics.\"\n\nAdvait has received several academic awards, including being a Runner-up in the APS History of Physics Essay Contest (Oct 2021), Gold Award in the Queen's Commonwealth Essay Competition (Sep 2020), and Times Scholars 2019 Winner. He achieved an impressive SAT score of 1570/1600.\n\nHe is multilingual, with native proficiency in English and Hindi, full professional proficiency in French, and professional working proficiency in Tamil."
}