{
    "id": "aidangollan",
    "name": "Aidan Gollan",
    "profile_pic": "https://media.licdn.com/dms/image/v2/D4E03AQEE6i7YSKlYKA/profile-displayphoto-shrink_200_200/profile-displayphoto-shrink_200_200/0/1680121037642?e=2147483647&v=beta&t=lgBeNneoVCQbVNsLpzSFwKulTEEz8a_wnGgvS24tod4",
    "links": [
        "https://nosu.io",
        "https://weirdspotify.com",
        "https://notello.ai",
        "https://aidangollan.com",
        "https://github.com/aidangollan"
    ],
    "short_description": "Co-founder of nosu.io and a versatile builder with a passion for turning creative ideas into shareable products. Computer Science and Mathematics student at Michigan State University, with experience at Auto-Owners Insurance and SampleServe, and creator of projects like Weird Spotify and Notello.",
    "long_description": "Aidan Gollan is an entrepreneurial technologist and builder who thrives on transforming creative concepts into tangible products that connect people. As the co-founder of nosu.io, he's focused on \"hacking hackathons\" and creating innovative solutions in the AI space.\n\nCurrently pursuing a Bachelor's degree in Computer Science and Mathematics at Michigan State University (expected graduation: May 2025), Aidan balances theoretical knowledge with practical application. He serves as a Project Director at the AI Club at MSU, where he helps guide and develop AI initiatives among students, including contributing to the club's website.\n\nAidan's professional experience includes software engineering roles at Auto-Owners Insurance (May 2024 - Present) and SampleServe (December 2023 - May 2024), where he honed his technical skills in real-world environments. He was also the founder of DataLume (formerly Lume Analytics), an innovative data analytics platform designed to empower local business owners with simplified, data-driven solutions. This venture was inspired by his father's struggles with complex data systems as the owner of Common Good Bakery.\n\nWhat sets Aidan apart is his enthusiasm for building unique, user-centric applications. His projects include Weird Spotify (weirdspotify.com) and Notello.ai, reflecting his creativity and desire to create experiences that resonate with users. He's been coding since age 12, initially creating programs to automate his homework, and has maintained that playful innovation spirit throughout his career.\n\nAidan's approach to technology is refreshingly human-centered. In his own words, he likes to \"turn fun ideas into things you can share with others,\" highlighting his understanding that technology is ultimately about connecting people and enhancing experiences. This philosophy guides his work across various projects and ventures, making him a distinctive voice in the tech and AI community.\n\nHis technical skills include Python, JavaScript, and TypeScript, which he showcases through various repositories on GitHub, including personal projects and contributions to open-source initiatives."
}