{
    "id": "alicia-l",
    "name": "Alicia L.",
    "profile_pic": "https://static.licdn.com/aero-v1/sc/h/9c8pery4andzj6ohjkjp54ma2",
    "contacts": [
        "563 followers",
        "500+ connections"
    ],
    "links": [
        "https://arxiv.org/abs/2409.19226",
        "https://math.mit.edu/research/highschool/primes/materials/2022/Li-Yablon.pdf",
        "https://sciendo.com/article/10.2478/rmm-2020-0005",
        "https://arxiv.org/abs/2006.16797"
    ],
    "short_description": "MIT CS/AI & Math Double Major with extensive research experience in machine learning and robotics. First author on a NeurIPS 2024 workshop paper and incoming ML Research intern at Genesis Therapeutics. Founded Watch To Donate, raising over $6,000 for various causes and reaching millions of people.",
    "long_description": "Alicia L. is a talented undergraduate student at MIT pursuing a double major in Computer Science/AI and Mathematics (2023-2027). She has established herself as a promising researcher in the field of artificial intelligence, currently working as an Undergraduate Researcher at MIT Computer Science and Artificial Intelligence Laboratory (CSAIL) in the Learning & Intelligent Systems Group, focusing on robot learning and planning. She is the first author on a paper accepted to the NeurIPS 2024 Open-World Agents Workshop titled \"Learning to Bridge the Gap: Efficient Novelty Recovery with Planning and Reinforcement Learning.\"\n\nHer research experience is diverse, including work on Safe Reinforcement Learning for power grid optimization at MIT's Donti Lab, and previous research at MIT PRIMES where she developed and analyzed adversarial strategies against epsilon-greedy online learning agents. She has an impressive publication record for an undergraduate, with papers on topics ranging from reinforcement learning to recreational mathematics.\n\nBeyond her academic pursuits, Alicia demonstrated entrepreneurial skills as the Founder and CEO of Watch To Donate from 2020 to 2023. This international student organization raised over $6,000 for 27 causes, reached over 6 million people, and developed mobile apps with 9,000+ downloads. She led a team of 10 and created a community fund to help those in need.\n\nAlicia has participated in prestigious programs including the European Summer Program on Rationality's Program on AI and Reasoning, Jane Street's WiSE Program, and has been invited to insight programs at Citadel and Optiver. She also conducted research at the University of Applied Arts Vienna, developing models for harnessing the attention economy for sustainability.\n\nHer academic achievements include being a National Merit Finalist, qualifying for the American Invitational Mathematics Examination (AIME) five times, and qualifying for Math Prize For Girls three times. She has taken graduate-level courses in Advanced Algorithms, Inference and Information, Sensorimotor Learning, as well as courses in Natural Language Processing, Probability, Real Analysis, and Statistics.\n\nAlicia is positioned to make significant contributions to the fields of artificial intelligence and machine learning, with a particular focus on reinforcement learning and robotics, as evidenced by her upcoming ML Research internship at Genesis Therapeutics."
}