{
    "id": "alicia-l",
    "name": "Alicia Li",
    "profile_pic": "https://static.licdn.com/aero-v1/sc/h/9c8pery4andzj6ohjkjp54ma2",
    "links": [
        "https://arxiv.org/abs/2409.19226",
        "https://math.mit.edu/research/highschool/primes/materials/2022/Li-Yablon.pdf",
        "https://sciendo.com/article/10.2478/rmm-2020-0005",
        "https://arxiv.org/abs/2006.16797",
        "https://www.mit.edu/~aliciali/",
        "https://www.watchtodonate.org/",
        "https://play.google.com/store/apps/details?id=com.playtodonate.myfirstandroidapplication&hl=en_US&gl=US&pli=1"
    ],
    "short_description": "MIT CS/AI & Math double major with a strong research background in robot learning and reinforcement learning. First author on a NeurIPS 2024 workshop paper and incoming ML Research intern at Genesis Therapeutics. Founded Watch To Donate, raising over $6,000 for various causes while reaching millions of people.",
    "long_description": "Alicia Li is a talented undergraduate at MIT pursuing a double major in Computer Science/AI (specifically course 6-4: AI and Decision Making) and Mathematics (2023-2027). Her research interests span robot learning, planning, and reinforcement learning, with particular focus on safe RL applications.\n\nAs an undergraduate researcher at MIT CSAIL's Learning & Intelligent Systems Group, she works on robot learning and planning, and is the first author on a paper accepted to the NeurIPS 2024 Open-World Agents Workshop titled \"Learning to Bridge the Gap: Efficient Novelty Recovery with Planning and Reinforcement Learning.\" She's also researching safe reinforcement learning for power grid optimization at MIT's Donti Lab, where she was listed as a past member in 2024.\n\nAlicia has an impressive publication record for her career stage, with multiple published papers including work on adversarial attacks against online reinforcement learning agents (as part of MIT PRIMES research project 2022-2023), magic SET squares classification, the Post Correspondence Problem, and coin weighing problems. Her academic excellence is further demonstrated by her coursework in graduate-level subjects including Advanced Algorithms, Inference and Information, and Sensorimotor Learning.\n\nBeyond her academic pursuits, Alicia founded and served as CEO of Watch To Donate from 2020 to 2023, an international student organization that donates revenue from social media videos, mobile apps, and business collaborations. Under her leadership, the organization raised over $6,000 for 27 causes, reached over 6 million people, and developed apps with 9,000+ downloads. She also created a Family Fund to help their online community of 50,000 in need. Additionally, she developed \"Play To Donate,\" an app that leverages ad revenue to enable users to donate to charity by playing games.\n\nAlicia is active in MIT's campus life, participating in MIT Asian Dance Team and Ridonkulous (MIT's competitive hip hop dance team), and was previously on Fixation (MIT's competitive contemporary dance team). She also enjoys figure skating and watching movies with friends in her free time.\n\nShe is currently preparing for her upcoming role as an ML Research intern at Genesis Therapeutics, where she'll likely apply her expertise in AI and mathematics to challenges in the therapeutic development space."
}