{
    "id": "ally-nakamura",
    "name": "Ally Nakamura",
    "profile_pic": "https://media.licdn.com/dms/image/v2/D5603AQE80GJ4v42Xaw/profile-displayphoto-shrink_200_200/profile-displayphoto-shrink_200_200/0/1718752691393?e=2147483647&v=beta&t=2Ia0lTa_G1zbGYov-O6qKXdTF_zv5x1USw3VNdAPR40",
    "links": [
        "https://www.coursera.org/account/accomplishments/certificate/HXGBESUA4X53",
        "http://masason-foundation.org/en/",
        "https://github.com/DPCLab/CensorScout-Front",
        "http://dpclab.org/china/dashboard/",
        "https://papers.ssrn.com/sol3/papers.cfm?abstract_id=3266193",
        "https://trycatapult.ai/",
        "https://www.linkedin.com/in/ally-nakamura/"
    ],
    "short_description": "Recent Stanford graduate currently building at PearX and involved with Catapult AI. Ally has a background in deep learning, AI, and scientific research, with notable achievements including a gold medal at the International Earth Science Olympiad, selection as a Masason Foundation Scholar, and research on Chinese censorship.",
    "long_description": "Ally Nakamura is a recent Stanford University graduate with BS/MS degrees in Computer Science with a focus on AI. She is currently building at PearX while also being involved with Catapult AI, where she's working on helping medical device companies deploy AI to make their workflows easier.\n\nHer academic journey has been complemented by her deep interest in artificial intelligence and healthcare technology. She holds a Neural Networks and Deep Learning certification from deeplearning.ai and has worked with Stanford's Open Virtual Assistant Lab to build EHR-Xamine, a virtual assistant for electronic clinical health records designed to reduce physician burnout.\n\nAlly has demonstrated exceptional scientific aptitude, having published research on Fluorescence-Guided Surgery in Frontiers in Oncology, where she reviewed applications of fluorescent probes in defining tumor locations during surgical procedures. Her scientific excellence was recognized internationally when she represented the United States at the International Earth Science Olympiad, earning a gold medal and ranking among the top 15 students out of nearly 400 participants from over 30 countries.\n\nHer technical accomplishments include leading an AI-enabled email client at DoNotPay that was featured by Forbes and Wired, and building a voice agent to automatically handle reference checks for healthcare staffing agencies. She also enjoys participating in hackathons, where she has built AI dating apps and launched an AI crypto coin that scaled to $15M market cap.\n\nBeyond her technical work, Ally has conducted significant research on Chinese censorship. Working with Jeffrey Shen, she created CensorScout and the Weibo Censorship Dashboard, two applications that increase transparency into censorship on Weibo. Their published paper on SSRN made daily top-tens in several sections and was in the top 10% of authors by downloads in the year following publication. This project was completed as part of Digital Propaganda & Censorship, an Independent Project at Phillips Academy.\n\nHer entrepreneurial spirit is evident through her involvement with various organizations at Stanford, including co-founding the Stanford Chapter of Scholar of Finance and being a member of the Asia-Pacific Student Entrepreneurship Society. She also served as an intern at Stanford Women in Business, showcasing her interest in the intersection of business and technology.\n\nAlly was selected as one of just 42 students to join the prestigious Masason Foundation after a rigorous three-round admissions process, further highlighting her exceptional potential. During her high school years, she contributed to STEM education as an Event Coordinator for Techstravaganza with Tomorrow's Women in Science and Technology.\n\nShe is bilingual in English and Japanese with limited working proficiency in German, giving her a global perspective that complements her technical skills and entrepreneurial mindset. In her free time, she enjoys hiking, attending DJ sets, eating sushi, and playing poker with friends."
}