{
    "id": "ally-nakamura",
    "name": "Ally Nakamura",
    "profile_pic": "https://media.licdn.com/dms/image/v2/D5603AQE80GJ4v42Xaw/profile-displayphoto-shrink_200_200/profile-displayphoto-shrink_200_200/0/1718752691393?e=2147483647&v=beta&t=2Ia0lTa_G1zbGYov-O6qKXdTF_zv5x1USw3VNdAPR40",
    "contacts": [
        "2K followers",
        "500+ connections"
    ],
    "links": [
        "https://www.coursera.org/account/accomplishments/certificate/HXGBESUA4X53"
    ],
    "short_description": "Recent Stanford University graduate currently building at PearX and previously associated with Catapult AI. Ally is a Masason Foundation Scholar with expertise in deep learning and a background in science, having won gold at the International Earth Science Olympiad.",
    "long_description": "Ally Nakamura is a recent Stanford University graduate who is currently building at PearX and has previous experience with Catapult AI. She has a strong foundation in deep learning, having completed Neural Networks and Deep Learning certification from deeplearning.ai in April 2020.\n\nAlly has demonstrated leadership and entrepreneurial spirit as a Stanford Chapter Cofounder of Scholar of Finance and through her membership in the Asia-Pacific Student Entrepreneurship Society. She also served as an intern at Stanford Women in Business, showing her commitment to business leadership.\n\nHer academic excellence is highlighted by prestigious recognitions, including being selected as a Masason Foundation Third Generation Scholar in 2019, one of only 42 students chosen after a rigorous three-round admissions process. She also represented the United States at the 12th International Earth Science Olympiad in 2018, where she won a gold medal, ranking among the top 15 students out of nearly 400 participants from over 30 countries.\n\nAlly has contributed to scientific research, co-authoring a publication on Fluorescence-Guided Surgery in Frontiers in Oncology in December 2017, which reviewed applications of fluorescent probes in defining tumor locations during surgical procedures.\n\nDuring her high school years, she served as a Techstravaganza Event Coordinator for TWIST: Tomorrow's Women in Science and Technology from September 2017 to June 2019, demonstrating her early commitment to promoting women in STEM fields.\n\nAlly is bilingual, with native or bilingual proficiency in Japanese and limited working proficiency in German, adding to her global perspective and communication skills."
}