{
    "id": "andrewtran-cs",
    "name": "Andrew Tran",
    "profile_pic": "https://media.licdn.com/dms/image/v2/D4E03AQEVUI9KsbIKCw/profile-displayphoto-shrink_200_200/profile-displayphoto-shrink_200_200/0/1721361710559?e=2147483647&v=beta&t=8uors9J-vCvX7EYzHpa4JC9Snu4aX6VMN4ChYrHBUYo",
    "links": [
        "https://academic.oup.com/bioinformatics/article/40/Supplement_1/i357/7700902"
    ],
    "short_description": "Andrew Tran is a junior at Yale University with a strong focus on computer science, particularly in molecular AI research. He has contributed to MolLM, a unified language model integrating biomedical text with 2D and 3D molecular representations, and has experience at Hudson River Trading. His coursework spans deep learning, natural language processing, and graph-structured data.",
    "long_description": "Andrew Tran is an undergraduate junior at Yale University pursuing computer science with specialized interests in computational biology and AI. His research work is evidenced by his contribution to MolLM, a sophisticated unified language model that integrates biomedical text with both 2D and 3D molecular representations. This project, presented at ISMB 2024, demonstrates his capability in developing advanced AI systems for molecular modeling.\n\nAndrew has professional experience at Hudson River Trading, a quantitative trading firm known for its algorithmic trading strategies and high-performance computing infrastructure. This suggests his skills extend to financial technology applications of computer science.\n\nHis academic foundation is robust, with coursework covering both theoretical computer science (Compilers and Interpreters, Computer Architecture, Operating Systems, Discrete Mathematics) and cutting-edge AI topics (Deep Learning on Graph-Structured Data, Natural Language Processing, Probabilistic Machine Learning). This diverse technical background positions him well at the intersection of traditional computer science and modern AI applications.\n\nAndrew's interest in molecular AI research, as shown by his publication work, indicates his potential to contribute to the growing field of AI applications in healthcare and drug discovery. His engagement with content related to diffusion models, geometry problem-solving AI, and other technical developments (as seen in his LinkedIn activity) suggests he stays current with the latest advancements in artificial intelligence.\n\nIt's important to note that there are several other professionals named Andrew Tran in different fields, including an investigative data reporter at The Washington Post (who won a Pulitzer Prize), an orthopedic surgeon specializing in sports medicine, a UCLA law lecturer, and a visual effects artist who has worked on major films like The Hunger Games and Avengers: Infinity War. Our Andrew Tran is specifically the Yale computer science student focused on molecular AI research."
}