{
    "id": "andrewztan",
    "name": "Andrew Tan",
    "profile_pic": "https://media.licdn.com/dms/image/v2/C5603AQGbKr_GFvC9xw/profile-displayphoto-shrink_200_200/profile-displayphoto-shrink_200_200/0/1588713934994?e=2147483647&v=beta&t=tjcRP3P0tUW_I9t-yslIvruSBoE7eHrUiK9rkmuocZ8",
    "contacts": [
        "joinnova.co"
    ],
    "links": [
        "https://andrewztan.com",
        "https://www.linkedin.com/in/andrewztan"
    ],
    "short_description": "Andrew Tan is associated with Humans and Stanford University. He is focused on democratizing access to career growth through joinnova.co. Andrew is a highly accomplished individual with a strong academic background, having been recognized with numerous awards including Phi Beta Kappa and Outstanding Student Instructor at UC Berkeley.",
    "long_description": "Andrew Tan is a talented professional associated with Humans and Stanford University. He previously attended UC Berkeley where he excelled academically, being inducted into Phi Beta Kappa as a junior (top 20 students in his class) and consistently making the Dean's Honors List (top 4% of students). \n\nAndrew has an impressive academic and professional background, having been recognized as an Outstanding Student Instructor at UC Berkeley's Data Science Department and participating in the EECS Honors Program. He was also a Jack Larson Scholar at UC Berkeley Haas School of Business, which supported his entrepreneurship pursuits in technology and research.\n\nHis entrepreneurial spirit is evident through his participation in the Pear VC Summer Fellowship, where he received $30k in funding for an early-stage startup. Andrew was also one of only 11 students nationwide to be awarded the Snap Research Scholarship, recognizing his technical abilities and research experience.\n\nAndrew has published research on \"Sentiment Predictability for Stocks\" (2018), exploring stock market prediction using textual sentiment analysis tools and prediction models. He is bilingual, with native English proficiency and professional working proficiency in Chinese.\n\nBefore Berkeley, Andrew was the Salutatorian (ranked #2) in his high school class of 505 students. He demonstrated excellence in mathematics as a 4-time qualifier for the American Invitational Mathematics Examination (AIME) and placed 2nd in the DECA International Competition for \"Entrepreneurship - Growing Your Business.\"\n\nCurrently, Andrew appears to be focused on democratizing access to career growth through joinnova.co. With 23K followers and 500+ connections on LinkedIn, he has built a substantial professional network. His combination of technical expertise, academic excellence, and entrepreneurial drive makes him a notable professional in his field."
}