{
    "id": "andrewye1",
    "name": "Andrew Ye",
    "profile_pic": "https://static.licdn.com/aero-v1/sc/h/9c8pery4andzj6ohjkjp54ma2",
    "links": [
        "https://andrew-ye.com",
        "https://www.linkedin.com/in/andrewye1",
        "https://scholar.google.com/citations?user=N0gvFN4AAAAJ&hl=en",
        "https://github.com/andrewlye"
    ],
    "short_description": "Stanford University undergraduate studying Mathematics and Computer Science with research focus on AI, particularly neural architectures and network compression. Published at NeurIPS 2023 and ICML 2024, with experience as a software engineering intern, teaching assistant, and visiting instructor.",
    "long_description": "Andrew Ye is a talented undergraduate student currently pursuing his B.S. in Mathematics and Computer Science at Stanford University, having transferred there in 2024. Prior to Stanford, Andrew studied at Case Western Reserve University from 2022 to 2024, also focusing on Mathematics and Computer Science.\n\nAndrew has built an impressive research portfolio in artificial intelligence. Since June 2023, he has been working as an Undergraduate Researcher at the Case School of Engineering at Case Western Reserve University, collaborating with Dr. Shuai Xu, Dr. Vipin Chaudhary, and researchers at Rice AI and MIT. His research has led to publications at prestigious AI conferences including NeurIPS 2023 and ICML 2024, with his work \"GNNs also deserve editing, and they need it more than once\" receiving multiple citations.\n\nAndrew's research interests span several areas of AI including neural architectures, human-computer interaction, probability/combinatorics, metacognition, and learning theory. He is particularly focused on addressing key questions in AI such as ensuring system faithfulness and security, balancing the scale-bloat tradeoff in neural networks, and understanding how neural networks fundamentally reason and learn. He founded quant@CWRU, a student-led research group supported by professors at Case Western Reserve University focused on integrating machine learning paradigms to solve complex financial tasks.\n\nBeyond research, Andrew has gained practical industry experience as a Software Engineering Intern at Zventus from May to August 2023, where he worked with Angel Alban on healthcare technologies. He has also developed his teaching skills as a Teaching Assistant at Case Western Reserve University, where he assisted with courses in Algorithms and Discrete Mathematics from August 2023 to May 2024. Most recently, he served as a Visiting Instructor at DigiPen Institute of Technology, teaching Data Analytics and Statistics during the summer of 2024.\n\nAndrew grew up in Seattle and Hong Kong and has diverse personal interests including solving puzzles, playing piano (with a particular fondness for Liszt), hiking with his dog, and writing on his blog. His commitment to community service is evident from his volunteer work with North Helpline from May 2021 to April 2022. His academic profile, research contributions, and diverse experiences showcase his versatility and dedication to advancing the field of artificial intelligence."
}