{
    "id": "anirudhkotamraju",
    "name": "Anirudh Kotamraju",
    "profile_pic": "https://static.licdn.com/aero-v1/sc/h/9c8pery4andzj6ohjkjp54ma2",
    "contacts": [
        "749 followers",
        "500+ connections"
    ],
    "links": [
        "https://anirudhkotamraju.com"
    ],
    "short_description": "Computer Science student at UC Berkeley with experience as a Teaching Assistant for CS61B and Machine Learning Researcher at Space Sciences Laboratory. Previously interned at Amazon and Lawrence Livermore National Laboratory, focusing on full stack development and cybersecurity.",
    "long_description": "Anirudh Kotamraju is a Computer Science student at UC Berkeley (2022-2026) with a strong academic background and diverse professional experience. He currently serves as a Teaching Assistant for CS61B: Data Structures at UC Berkeley EECS, where he previously worked as a Tutor for both CS61B and CS61A courses. \n\nSince September 2022, Anirudh has been working as a Machine Learning Researcher at UC Berkeley's Space Sciences Laboratory, developing CNNs and autoencoders to approximate the image response of Compton telescopes. His industry experience includes a Software Development Engineer internship at Amazon (Summer 2024), where he worked on full stack development for the retail division, and a Software Engineer internship at Lawrence Livermore National Laboratory (Summer 2023), focusing on cyberattack detection for TCP networks in critical U.S. infrastructure.\n\nAnirudh's earlier experiences include roles as an Academic Intern at UC Berkeley EECS (2023), a Research Intern in Computational Astrophysics at UC Santa Cruz (Summer 2021), and a Software Engineer Intern at One Convergence, Inc (Summer 2019).\n\nHe has an impressive list of awards and achievements, including the Sustainability Grand Prize at Stanford Treehacks 2024, 1st Place Eluv.io Prize at Calhacks 2022, Bloomberg BPuzzled Challenge UC Berkeley Winner, and finalist status for the UC Berkeley Regents' and Chancellor's Scholarship. He was also a National Merit Scholarship Finalist and received the Gold President's Volunteer Service Award for 250+ hours of volunteer service.\n\nAnirudh founded a COVID-19 Oxygen Concentrator and Supply Fundraiser for India, demonstrating his commitment to social causes. His coursework includes Operating Systems, Databases, Computer Architecture, Data Structures, Discrete Math, Linear Algebra, and Data Science, providing him with a comprehensive foundation in computer science and related fields."
}