{
    "id": "arihantchoudhary",
    "name": "Arihant Choudhary",
    "profile_pic": "https://media.licdn.com/dms/image/v2/D5603AQEwe9slSziy1g/profile-displayphoto-shrink_200_200/profile-displayphoto-shrink_200_200/0/1732321576920?e=2147483647&v=beta&t=Slek8Q_g21kge1NqoFA6jeWsZgc-YriMZZpOqZguGds",
    "contacts": [
        "arihantchoudhary.com"
    ],
    "links": [
        "https://arihantchoudhary.com"
    ],
    "short_description": "Computer Science and Data Science student at UC Berkeley with research experience at Stanford and Intel. Currently serving as Dean's Engineering Ambassador at UC Berkeley College of Engineering with a focus on AI, machine learning, and computational research.",
    "long_description": "Arihant Choudhary is a Computer Science, Data Science, and Applied Mathematics student at UC Berkeley (2021-2025) with extensive research and professional experience. He currently works as a Software Intern (AI) at Intel Corporation and as a Research Assistant at Stanford University's Department of Computer Science under Prof. Edward Chang, focusing on Multi Agent Systems for Inference, Reasoning, and Planning.\n\nHis research experience includes work at UC Berkeley's Center for Responsible, Decentralized Intelligence (RDI), the ACE Lab under Prof. Dan Garcia (where he authored papers accepted at SIGSCE 2024 and 2025), the Computational Game Theory Lab (Gamescrafters), and the Cryptography Lab under Prof. Sanjam Garg. He previously interned at Intel as a Research Intern working on Text to Video Research.\n\nArihant serves as a Dean's Engineering Ambassador at UC Berkeley College of Engineering, working on engineering programs for high schools and community colleges in the Bay Area. He has also held teaching positions as an Academic Intern for CS61A, CS61B, and CS70, and as a Teaching Assistant at UC Berkeley's Fung Institute.\n\nHis entrepreneurial ventures include founding Berkeley Social, a platform to connect incoming UC Berkeley students, and co-founding Yindu & Zhongguo Inc, an AgriTech enterprise serving farmers in West Bengal, India. He also founded Academic Reserve, an online repository for study resources.\n\nArihant has published research on \"Dynamic, Animated Feedback for Randomized Problems with Computer-Based Testing\" (ACM, 2024) and \"Analyzing Future Climate Change using CMIP6 models.\" He is proficient in English, Hindi, Bengali, with limited working proficiency in Punjabi and Marwari."
}