{
    "id": "arihantchoudhary",
    "name": "Arihant Choudhary",
    "profile_pic": "https://media.licdn.com/dms/image/v2/D5603AQEwe9slSziy1g/profile-displayphoto-shrink_200_200/profile-displayphoto-shrink_200_200/0/1732321576920?e=2147483647&v=beta&t=Slek8Q_g21kge1NqoFA6jeWsZgc-YriMZZpOqZguGds",
    "links": [
        "https://arihantchoudhary.com",
        "https://github.com/arihantchoudhary"
    ],
    "short_description": "Computer Science and Data Science student at UC Berkeley with extensive research experience across AI, cryptography, and computational game theory. Currently working as a Software Intern at Intel and Lead Undergraduate Researcher at UC Berkeley, focusing on multi-agent systems, AI applications, and CS education.",
    "long_description": "Arihant Choudhary is a multifaceted Computer Science, Data Science, and Applied Mathematics student at UC Berkeley with a remarkable research portfolio spanning diverse technical domains. His research journey includes work at Stanford University on multi-agent systems for inference, reasoning, and planning, as well as climate data analysis using CMIP-6 models.\n\nAt UC Berkeley, Arihant has made significant contributions across multiple research labs. He serves as a Lead Undergraduate Researcher in two labs under Prof. Dan Garcia - the Computational Game Theory Lab (GamesCrafters) and the CS Education Lab (ACE Lab). In the ACE Lab, he authored papers on dynamic animated feedback for randomized graph problems (accepted at SIGCSE 2024) and co-authored work on personalized reminders for mastery learning (AutoRemind, accepted at SIGCSE 2025). His work in the Computational Game Theory Lab involved developing solvers for games like Quick Cross and Euclid's Game, researching pure draw theory, and creating human-robot interaction systems.\n\nProfessionally, Arihant is currently working as a Software Intern at Intel Corporation, implementing cutting-edge research and building products for Intel Foundry. His previous role as a Research Intern at Intel focused on text-to-video research and building Intel's Personal Educator (IPED) using large language models and text-to-speech libraries to support employee training. He also serves as a Dean's Engineering Ambassador at UC Berkeley's College of Engineering, working on programs for high schools and community colleges in the Bay Area.\n\nArihant's journey to UC Berkeley is particularly inspiring. After being rejected from all colleges in his first application cycle, he took a gap year in 2020 and pursued multiple projects, including a significant climate change research project through Polygence. Working with his mentor Tristan Ballard, a Stanford PhD in earth systems science, Arihant analyzed a petabyte of climate data to study monsoons in Kolkata and assess climate change impacts on agriculture. This experience not only built his technical skills but also helped him secure admission to UC Berkeley on his second attempt.\n\nArihant's entrepreneurial spirit is evident in his founding of Berkeley Social, a platform he developed to help incoming UC Berkeley students connect with peers sharing similar interests. He also co-founded Yindu & Zhongguo Inc, which included the Bangla Machinery Bank, an AgriTech enterprise providing efficient farm machinery to farmers in West Bengal.\n\nHis academic pursuits extend beyond UC Berkeley, with coursework at Stanford University in CS224G: Apps with LLMs Inside. Arihant's technical expertise spans AI, machine learning, cryptography, and data science, complemented by his multilingual proficiency in English, Hindi, Bengali, Punjabi, and Marwari.\n\nThrough his diverse experiences in research, entrepreneurship, and community service, Arihant demonstrates a commitment to leveraging technology for social impact and educational advancement. Expected to graduate in Spring 2025, he is now interested in pursuing a graduate degree and a career in artificial intelligence/machine learning."
}