{
    "id": "arjun-banerjee",
    "name": "Arjun Banerjee",
    "profile_pic": "https://www.ocf.berkeley.edu/~launchpad/media/uploads/profile_pictures/3276.jpg",
    "links": [
        "mailto:abaner@berkeley.edu",
        "https://kidsteachtech.com/",
        "https://www.linkedin.com/in/arjun-banerjee/"
    ],
    "short_description": "UC Berkeley student, Head of Education at Launchpad, and Industrial Relations Officer at HKN. Founder and CEO of Kids Teach Tech, a non-profit organization teaching technology to underserved youth.",
    "long_description": "Arjun Banerjee is a student at UC Berkeley with extensive involvement in technology education and leadership. He serves as the Head of Education at Launchpad, a community of problem solvers focused on intelligent software and artificial intelligence, and as an Industrial Relations Officer at Eta Kappa Nu (HKN), the Electrical Engineering and Computer Science honor society.\n\nMost notably, Arjun is the founder and CEO of Kids Teach Tech (KTT), a non-profit organization he started at the age of 10. Under his leadership, KTT has built a team of over 250 youth educators who have taught technology, programming, and AI to more than 8,000 students, primarily from underserved communities in the San Francisco Bay Area. The organization follows a \"teach it forward\" model, where students become teachers and leaders in their communities.\n\nArjun has established significant partnerships for KTT with UC Berkeley's IEOR Department, Georgia Tech, and the Urban League of Greater San Francisco Bay Area. Together they deliver the Seth Bonder Summer Program in Computational and Data Science for Engineering, which provides underserved youth with education in computer programming, data science, optimization, artificial intelligence, and computational biology.\n\nHis technical expertise spans multiple programming languages, with particular proficiency in Python and C#. Beyond his work with KTT, Arjun has contributed to data visualization projects, including the Ten Strands/CAELI Data Project which won the Fall 2022 Data Visualization Award at UC Berkeley. This project focused on understanding environmental literacy education in California K-12 schools.\n\nArjun also has experience as a Research Assistant at Stanford University's Hoover Institution, where he developed an interactive archive of declassified documents from the Intelligence Community. His diverse interests extend to national and international policy, philosophy, poetry, and quantum physics."
}