{
    "id": "arnavwad",
    "name": "Arnav Adhikari",
    "profile_pic": "https://media.licdn.com/dms/image/v2/D5603AQEXbM27cAUEwQ/profile-displayphoto-shrink_200_200/profile-displayphoto-shrink_200_200/0/1714488562826?e=2147483647&v=beta&t=Jp3Vtx7-7LOT-737u5whGzu_29_3lsxwbBJWz4eszcE",
    "links": [
        "https://www.linkedin.com/in/arnavwad",
        "https://x.com/arnavwad",
        "https://github.com/LitMSCTBB",
        "mailto:arnavwad@mit.edu"
    ],
    "short_description": "19-year-old EECS and Finance student at MIT with a passion for building innovative solutions in fintech, robotics, and healthtech. First place winner at HackMIT 2024 with a nicotine cessation patch project, and currently working on semantic operators at MIT CSAIL while also running a stealth startup.",
    "long_description": "Arnav Adhikari is a dynamic 19-year-old undergraduate at MIT pursuing a dual focus in Electrical Engineering and Computer Science (EECS) and Finance. His technical interests span across multiple domains including fintech (payments, wealth management, AI analysts), robotics (collaboration and control), healthtech (LLM-aided care), and productivity tools. He describes himself as a \"big proponent of automating the mundane\" and believes that jobs should be automated to redirect human attention toward tasks requiring ingenuity.\n\nArnav has built an impressive track record of achievements. Most notably, he and his team won the First Place Grand Prize at HackMIT 2024 with their algorithmically-driven nicotine cessation patch. He's currently working as a Builder at MIT's prestigious Computer Science and Artificial Intelligence Laboratory (CSAIL), focusing on semantic operators.\n\nEntrepreneurially minded, Arnav is the Founder and CEO of a stealth startup that he's been running since January 2024. His previous experience includes work at Boston Consulting Group (BCM), Rice University, Stanford's Center for Artificial Intelligence in Medicine & Imaging (AIMI), and Harvard Medical School, demonstrating his ability to collaborate with top-tier institutions across academia and industry.\n\nArnav's research work is particularly notable in healthcare technology. He has worked on cardiac imaging interpretability and standardized cardiac measurements at BCM, Texas Children's Hospital, and Stanford AIMI, with his work being featured in Circulation by the American Heart Association in November 2023. He has also analyzed teamwork synergy for AI Surgical Robotic Coaches at Rice HCAIR and Harvard Medical School, and developed smarter irrigation and water management systems for the City of Southside Place in Houston.\n\nHis technical background is further strengthened by his experience in robot motion planning and control at Rice RobotPI, and his achievements as a retired USAJMO winner and USACO Gold Medalist. Arnav is also an author, having written the Cubronix Competitive Math Practice Book for charity, which was featured in the Houston Chronicle in January 2022.\n\nBeyond his academic and professional pursuits, Arnav offers tutoring services in the Greater Houston area, specializing in math, science, engineering, and test preparation. He enjoys tennis, basketball, football, biking, the outdoors, and various forms of media entertainment.\n\nCurrently a freshman at MIT (class of 2028), Arnav graduated from Carnegie Vanguard High School in 2024 after previously attending Bellaire High School. He describes himself as someone who loves \"learning and building fast,\" and is always open to discussing innovative ideas and groundbreaking technologies."
}