{
    "id": "arnavwad",
    "name": "Arnav Adhikari",
    "profile_pic": "https://media.licdn.com/dms/image/v2/D5603AQEXbM27cAUEwQ/profile-displayphoto-shrink_200_200/profile-displayphoto-shrink_200_200/0/1714488562826?e=2147483647&v=beta&t=Jp3Vtx7-7LOT-737u5whGzu_29_3lsxwbBJWz4eszcE",
    "contacts": [
        "1K followers",
        "500+ connections"
    ],
    "links": [
        "https://www.linkedin.com/in/arnavwad"
    ],
    "short_description": "19-year-old EECS and Finance student at MIT with interests in AI, startups, VC, and product management. First place winner at HackMIT 2024 and founder of a stealth startup. Previously worked at BCM, Rice, Stanford AIMI, and Harvard Med School.",
    "long_description": "Arnav Adhikari is a 19-year-old undergraduate student at MIT pursuing degrees in Electrical Engineering and Computer Science (EECS) and Finance (2024-2028). He has extensive interests and experience across multiple domains including fintech (payments, wealth management, AI analysts), robotics (collaboration and control), healthtech (LLM-aided care), and productivity tools.\n\nArnav is currently a Builder at MIT Computer Science and Artificial Intelligence Laboratory (CSAIL) working on semantic operators since December 2024. He is also the Founder and CEO of a stealth startup since January 2024.\n\nHis notable achievement includes winning the First Place Grand Prize at HackMIT 2024 with his team, where they developed an algorithmically-driven nicotine cessation patch. He has also worked on GenAI-driven Financial Operations advisors that create cost-efficient plans for data and cloud management solutions.\n\nBefore MIT, Arnav attended Carnegie Vanguard High School (2021-2024) and Bellaire High School (2020-2021). His previous professional experiences include positions at BCM, Rice, Stanford AIMI, and Harvard Med School, though specific details about these roles are not provided.\n\nArnav describes himself as someone who loves learning and building fast, with a passion for groundbreaking ideas and technologies. He maintains an active presence on LinkedIn, engaging with content related to AI, startups, and technology innovations."
}