{
    "id": "audrey-chen-tech",
    "name": "Audrey Chen",
    "profile_pic": "https://media.licdn.com/dms/image/v2/D5603AQHi5addWjMElA/profile-displayphoto-shrink_200_200/B56ZS4zalDHsAY-/0/1738267274735?e=2147483647&v=beta&t=uyeytLEn_VuhWzl4hKEgYp0vh3EizQrXkGordf52sR8",
    "links": [
        "https://github.com/audgeviolin07",
        "https://www.instagram.com/jia.seed/",
        "https://audreychendev.com",
        "https://open.spotify.com/artist/JIAseed"
    ],
    "short_description": "Serial hackathon winner (21 wins) and tech entrepreneur with a passion for AI innovation. Co-founder of VC-backed nosu.io, Software Engineering Intern at Intuit, and content creator with 68K Instagram followers. Currently pursuing Computer Engineering at Michigan State University while balancing multiple tech roles including NASA USRC research and Intel AI projects.",
    "long_description": "Audrey Chen is a dynamic force in the tech world, particularly known for her exceptional track record of winning 21 hackathons with a 70% win rate, accumulating over $20,000 in prizes. Her technical prowess spans multiple domains within AI and software engineering, demonstrated through her diverse professional experiences.\n\nAs the co-founder and CEO of nosu.io, Audrey has successfully raised $100,000 in venture capital funding and grown the platform to over 7,800 users. The company focuses on AI organization software for hackathons and developers, addressing communication challenges between AI companies and low-code users. Her entrepreneurial venture is backed by notable investors including Boost VC, Earthling VC, and 13 angels.\n\nProfessionally, Audrey has secured impressive roles including an upcoming Software Engineering Internship at Intuit where she'll work on predictive AI for the Lead Management & Planning team. She's currently engaged with Intel's AI PC Pilot Program, where she developed a machine learning model for diabetic retinopathy diagnosis that improved accuracy from 67% to 80%. As a NASA USRC Drone Research Software Engineer, she contributes to the Laser Energized Aerial Drone System (LEADS) project aimed at monitoring wildfires.\n\nHer technical versatility extends to DevOps/SRE work through her Meta Fellowship, where she developed web applications using Python, Flask, Jinja, MySQL, Docker, and NGINX, while implementing CI/CD pipelines and configuring system monitoring with Prometheus and Grafana.\n\nBeyond her technical work, Audrey has built a significant online presence as a content creator with 68,000 followers on Instagram (@jia.seed), generating over 10 million views across her educational content about technology and hackathons. She's also a musician with over 140,000 streams on Spotify.\n\nAt Michigan State University, where she's pursuing a Bachelor of Engineering with a minor in Economics, Audrey serves as Co-director of SpartaHack and Workshop Coordinator for the AI Club, delivering presentations to audiences of up to 300 attendees on advanced AI topics.\n\nHer entrepreneurial spirit manifested early with ventures like SheeshSeaglass, where she grew $17.99 to $2,100 in sales revenue with a 65% net profit margin. Audrey's technical certifications include oneAPI Ambassador Level 1 from Intel Corporation, showcasing her commitment to continuous learning in emerging technologies.\n\nIt's worth noting that Audrey is also a talented musician, with classical training in cello beginning at age 8 and voice at age 11. While her primary focus is on technology and entrepreneurship, her musical background adds another dimension to her multifaceted talents. This musical training likely contributes to her creative approach to problem-solving in the tech space."
}