{
    "id": "audrey-chen-tech",
    "name": "Audrey Chen",
    "profile_pic": "https://media.licdn.com/dms/image/v2/D5603AQHi5addWjMElA/profile-displayphoto-shrink_200_200/B56ZS4zalDHsAY-/0/1738267274735?e=2147483647&v=beta&t=uyeytLEn_VuhWzl4hKEgYp0vh3EizQrXkGordf52sR8",
    "contacts": [
        "audgeviolin07@gmail.com"
    ],
    "links": [
        "https://github.com/audgeviolin07",
        "https://audreychendev.com",
        "https://instagram.com/jia.seed"
    ],
    "short_description": "21x hackathon winner and tech enthusiast currently working as a Software Engineering Intern at Intuit and co-founder of nosu.io. Michigan State University student with experience at Intel, NASA, and Meta, and a content creator with 68k followers on Instagram.",
    "long_description": "Audrey Chen is a highly accomplished tech professional and entrepreneur with an impressive track record of success in hackathons, software engineering, and content creation. As a 21-time hackathon winner with a remarkable 70% win rate, she has accumulated approximately $20,000 in prizes, demonstrating her exceptional problem-solving abilities and technical skills.\n\nCurrently, Audrey is a Software Engineering Intern at Intuit, working on the Lead Management & Planning team in VEP Sales & Growth, focusing on predictive AI applications for products like MailChimp and TurboTax. She is also the co-founder and CEO of nosu.io, an AI organization software for hackathons and developers that has raised $100,000 in funding, attracted 7,800+ users, and is backed by Boost VC, Earthling VC, and 13 angels, including YC founders and unicorn leaders.\n\nHer diverse professional experience includes roles at Intel as an AI Student Engineer in the AI PC Pilot Program and as a OneAPI Ambassador, where she delivered high-performance computing training to over 33,000 students. At NASA, she worked as a Drone Research Software Engineer on the Laser Energized Aerial Drone System (LEADS) project. She also completed a DevOps/SRE Fellowship at Meta through the MLH Fellowship program.\n\nAudrey has built a significant online presence as a content creator with 68,000 followers on Instagram (@jia.seed), generating over 10 million views on her educational content about technology, hackathons, and engineering tips. She has secured 15 brand deals, earning $3,500 through her content creation efforts.\n\nAs a student at Michigan State University pursuing a Bachelor of Engineering with a minor in Economics, Audrey has maintained academic excellence, appearing on the Dean's List twice. She is actively involved in campus organizations, serving as Co-director of SpartaHack and as an E-Board Workshop Coordinator for the AI Club at MSU.\n\nAudrey's entrepreneurial spirit extends beyond nosu.io, as she previously founded SheeshSeaglass, growing $17.99 to $2,100 in sales revenue with a 65% net profit margin. She is also a musician, with her work available on Spotify under the name JIA seed, accumulating over 140,000 streams and 1,600 monthly listeners.\n\nHer technical expertise spans various domains, including machine learning, AI, software development, and DevOps, making her a versatile and valuable professional in the tech industry."
}