{
    "id": "chandrasuda",
    "name": "Chandra Suda",
    "profile_pic": "https://media.licdn.com/dms/image/v2/D4E03AQGlREg-x__G2Q/profile-displayphoto-shrink_200_200/profile-displayphoto-shrink_200_200/0/1699998830993?e=2147483647&v=beta&t=7OGKyeL9j3jNid0fBMOI2w3xPSPCkYp_WWNSQGzLM34",
    "links": [
        "https://www.youtube.com/@CloudDataScience",
        "mailto:csuda@stanford.edu",
        "https://www.linkedin.com/in/chandra-suda/"
    ],
    "short_description": "CS and Math student at Stanford University and Rise Global Fellow with a passion for social impact through technology. Specializes in AI applications in healthcare, with research experience at Harvard Medical School and innovative work on tuberculosis detection through cough audio analysis.",
    "long_description": "Chandra Suda is a Computer Science and Mathematics student at Stanford University (2024-2028) and a Rise Global Fellow with the Rhodes Trust, an initiative that selects 100 promising teens worldwide to support them as they work to solve humanity's most pressing problems.\n\nWith a strong focus on the intersection of AI and healthcare, Chandra has conducted significant research in applying machine learning to medical diagnostics. His most notable project involves developing an innovative app for early detection of tuberculosis using cough audio analysis. The app allows users to record a one-second cough segment and receive a diagnostic output, with plans to integrate healthcare provider notifications to help reduce disease spread. This work earned him recognition at the International Science & Engineering Fair, where he received a Grand Award in 2023.\n\nBefore attending Stanford, Chandra was a standout student at Bentonville High School in Arkansas, where he was accepted to multiple prestigious universities including Harvard, Princeton, Cornell, University of Pennsylvania, Johns Hopkins, Berkeley, Columbia, and Carnegie Mellon. His teachers describe him as intelligent, determined, studious, and notably humble, always expressing gratitude to educators who supported his journey.\n\nChandra currently serves as a Student Researcher at Harvard Medical School in AI and Medicine, and has previous experience as a Machine Learning Intern at Walmart Global Tech, where he worked on optimizing retail environment supply and inventory systems. He's also gaining experience in the AI startup ecosystem as a Founder Fellow at On Deck and Strategy Intern at Mercor, while working with Anthropic as a Stanford ambassador to strategize product growth efforts for Claude. Additionally, he serves as a Campus Strategist for Perplexity AI.\n\nHis technical achievements are complemented by leadership roles, including serving as the Red Cross Hub-Club President for the Missouri-Arkansas Region and leading the MissingMaps team to optimize disaster relief through geographical data mapping. At 16, he founded Aimate, a STEM education nonprofit, and has received US Presidential and Congressional Award recognitions for his humanitarian volunteer work.\n\nAs a published researcher with works on \"Early Diagnosis and Predictive Treatment Monitoring of Tuberculosis With Novel Machine Learning Cough Analysis\" and \"Improving Alzheimer's Disease Diagnosis Using MRI Scans-Based Artificial Neural Networks,\" Chandra demonstrates a commitment to leveraging AI for meaningful social impact, particularly in healthcare accessibility and diagnostics for underserved communities."
}