{
    "id": "cheng-george",
    "name": "George Cheng",
    "profile_pic": "https://media.licdn.com/dms/image/v2/D4E03AQF5ceVEmRadSg/profile-displayphoto-shrink_200_200/B4EZUb9yVKHUAc-/0/1739930938397?e=2147483647&v=beta&t=TYEfER7Wmc6KnR6oYwKGVBo-TsM5xjAfFrjhS69JN2c",
    "links": [
        "https://github.com/gcheng713",
        "https://www.georgecheng.org",
        "gjcheng@mit.edu",
        "https://scholar.google.com/citations?user=nU2wGKIAAAAJ&hl=en"
    ],
    "short_description": "MIT student combining AI/CS with Brain & Cognitive Science, with research spanning neuro-symbolic learning, medical devices, and environmental engineering. Award-winning researcher and entrepreneur with publications in healthcare, pathogenic detection, and flood prediction, recognized by organizations including Regeneron ISEF and the Earth Prize.",
    "long_description": "George Cheng is a multifaceted researcher and innovator currently studying Computer Science, Mathematics, and Finance at MIT. His academic journey bridges the gap between artificial intelligence and human cognition, with a particular focus on neuro-symbolic learning that mimics human brain architecture.\n\nGeorge's research portfolio is impressively diverse. At MIT CSAIL, he works on neuro-symbolic learning under PI Gerald Sussman. He previously conducted research at the MIT Koch Institute for Integrative Cancer Research, developing next-generation smart capsules for drug delivery. His work at MIT Sloan School of Management explored how AI can analyze monetary policy impacts on investment plans. At Westlake University, he developed an AI avatar called \"Forever\" that mimics human likeness using voice, pictures, and memory, which was recognized as \"Best Idea\" and \"Best Project\" at the Westlake University AI Open Course Project Showcase.\n\nAs an entrepreneur, George is a co-founder of Tally.AI, which helps researchers identify emerging studies and competing work, and was accepted into the Alchemist Accelerator with less than 1.7% acceptance rate. He's also involved with EWOR as a Fellow and has co-founded Stemable and Altra Co. as volunteer initiatives to address socioeconomic issues, raising $150,000 for homeless artists, cancer patients, and Title I schools.\n\nHis publication record includes papers on topics ranging from glucose monitoring devices to flood prediction models and machine learning applications for pathogenic detection. His project \"FloodGate\" won the Earth Prize, demonstrating his commitment to applying technology to environmental challenges. Another notable project, \"PuriScan,\" uses machine learning for pathogen identification with a 3D-printable microscope that is 500x cheaper than commercial options and 750x faster than laboratory testing.\n\nGeorge's most personal research focuses on Type 2 diabetes, inspired by his mother's condition which developed during her pregnancy with him. He created an oral-fluid glucose-monitoring watch and later developed \"DiaMiR,\" an insulin-delivering patch worn on the skin that delivers medication through painless microneedles. He has filed a provisional patent for this technology.\n\nBeyond his technical work, George is an accomplished athlete, having been recognized as a Heisman High School Scholarship National Winner and participating in four varsity sports. He's also an Eagle Scout and World Science Scholar who has been recognized by numerous prestigious organizations including Regeneron International Science and Engineering Fair (ISEF), National Junior Science and Humanities Symposium (JSHS), United States Stockholm Junior Water Prize, Coca-Cola, and the Department of Defense.\n\nWith his technical expertise spanning machine learning, MLLMs, AutoGPT, Stable Diffusion, GenAI, and various programming tools, George exemplifies excellence across multiple domains while maintaining a clear focus on using technology to solve meaningful problems, particularly in healthcare and environmental sustainability."
}