{
    "id": "chunjin-william-gao",
    "name": "William Gao",
    "profile_pic": "https://static.licdn.com/aero-v1/sc/h/9c8pery4andzj6ohjkjp54ma2",
    "contacts": [
        "1K followers",
        "500+ connections"
    ],
    "links": [
        "https://github.com/Barneybean",
        "https://www.linkedin.com/in/chunjin-william-gao"
    ],
    "short_description": "Data Analyst at TikTok with skills in SQL, Python, and Tableau. UC Davis alumnus and Certified Public Accountant with multiple technical certifications including AWS, Tableau, and Java programming.",
    "long_description": "William Gao is a goal-driven and task-oriented Data Analyst currently working at TikTok. He graduated from the University of California, Davis and is also a Certified Public Accountant licensed by the Washington State Board of Accountancy since 2016.\n\nWilliam possesses a diverse technical skill set, demonstrated through numerous certifications including AWS Certified Cloud Practitioner, Tableau Desktop Specialist and Certified Associate, Java programming from the University of Pennsylvania, Computer Organization and Assembly Language Programming from Arizona State University, Data Structures and Algorithms, and SQL for Data Science.\n\nHis educational background includes coursework in Big Data, Data Management, Data Visualization, Machine Learning, Statistics, and Business Analysis. William is proficient in multiple languages, with full professional proficiency in English and native proficiency in Chinese and Fuzhou Dialect.\n\nWilliam has worked on projects including the 2018 Adobe Analytics Challenge and Dent-Soft. He has received strong recommendations from colleagues who praise his exceptional technical abilities, mentorship skills, and unique management style that elevates team performance. According to his peers, William has a rare combination of productivity, ambition, and intellect, along with outstanding troubleshooting and coding skills.\n\nHis GitHub portfolio showcases his technical work, and his professional network includes over 500 connections on LinkedIn with 1,000+ followers."
}