{
    "id": "collinqian",
    "name": "Collin Qian",
    "profile_pic": "https://media.licdn.com/dms/image/v2/D5603AQFQCn9yeymLFw/profile-displayphoto-shrink_200_200/profile-displayphoto-shrink_200_200/0/1710308398783?e=2147483647&v=beta&t=-AeNYzhv0ZOzQN3usBUGzKDIB-3QFCCWS0OFvoas9mw",
    "contacts": [
        "collinqian@linkedin.com"
    ],
    "links": [
        "https://www.linkedin.com/in/collinqian"
    ],
    "short_description": "Computer Science student at UC Santa Barbara with a 3.95 GPA and a minor in Mathematics. Experienced software engineer intern with roles at Databricks, Amazon, Intuitive, and other tech companies. Award-winning hackathon participant with a track record of first-place finishes.",
    "long_description": "Collin Qian is a Computer Science student at UC Santa Barbara pursuing a Bachelor of Science degree with a minor in Mathematics. He maintains an impressive 3.95/4.0 GPA and has received High Honors recognition.\n\nCollin has built a strong professional foundation through multiple software engineering internships at leading companies. He is set to join Databricks as a Software Engineer Intern on the Multi Cloud Efficiency Team from June to September 2024. Previously, he interned at Amazon on the Smart Vehicles Team (Summer 2023), Benioff Ocean Science Laboratory working on the WhaleSafe and SharkEye Projects (Nov 2022 - Jun 2023), Rocket Lawyer on the Playwright Test Scripts Team (Jan - Apr 2023), and Intuitive on the Telepresence Team (Summer 2022).\n\nCollin has demonstrated exceptional technical skills through his hackathon achievements, including first place at SB Hacks XI for building SnapSell (an automated Facebook Marketplace workflow), first place at the 2024 Jumpstart Designathon for creating a wireframe for neurodivergent users, and first place in the Spring 2022 Blockchain Project Series where he earned $3750 for developing a web forum with cryptocurrency bounties.\n\nHis educational background includes attending Monta Vista High School and Shanghai High School International Division before enrolling at UC Santa Barbara. With 2K followers and over 500 connections on LinkedIn, Collin has established a substantial professional network in the tech industry."
}