{
    "id": "collinqian",
    "name": "Collin Qian",
    "profile_pic": "https://media.licdn.com/dms/image/v2/D5603AQFQCn9yeymLFw/profile-displayphoto-shrink_200_200/profile-displayphoto-shrink_200_200/0/1710308398783?e=2147483647&v=beta&t=-AeNYzhv0ZOzQN3usBUGzKDIB-3QFCCWS0OFvoas9mw",
    "links": [
        "https://www.linkedin.com/in/collinqian",
        "https://github.com/CollinQ",
        "https://collinqian.vercel.app/",
        "https://x.com/collinhqian"
    ],
    "short_description": "Fourth-year Computer Science student at UC Santa Barbara with a minor in Mathematics, maintaining a 3.95 GPA. Currently serving as President of Alpha Kappa Psi. Collin has diverse software engineering experience across multiple industries, including Databricks, Amazon, Benioff Ocean Science Laboratory, and Intuitive. He excels in hackathons, having won first place in three competitive events.",
    "long_description": "Collin Qian is a high-achieving fourth-year Computer Science student at UC Santa Barbara, complementing his technical studies with a minor in Mathematics. With an impressive 3.95/4.0 GPA and High Honors recognition, he demonstrates exceptional academic aptitude. His coursework includes Data Structures and Algorithms, Discrete Mathematics, Algorithms Engineering, Machine Learning, Object Oriented Design and Implementation, Computer Organization and Logic Design, Intelligent and Interactive Systems, Intro to Computational Science, Vector Calculus, Linear Algebra, and Differential Equations.\n\nCollin has built a diverse portfolio of software engineering experience across multiple industries. He is currently at Databricks and is set to join their Multi Cloud Efficiency Team as a Software Engineer Intern in summer 2024. At Amazon, he implemented the Smart Home Widget using Alexa Presentation Language for an in-vehicle infotainment product, programmed the Weather Forecast APL Card feature for the Weather Widget leveraging APL Skill Connections, and produced a C++ Native App utilizing Yocto SDK for Widget rendering, improving rendering performance by 25%. He also contributed to 10+ code reviews, resulting in a 15% reduction in code defects. His previous experience includes working at Amazon's Smart Vehicles Team, contributing to marine conservation technology at the Benioff Ocean Science Laboratory on the WhaleSafe and SharkEye Projects, developing test automation at Rocket Lawyer, and supporting telepresence technology at Intuitive, a leader in surgical robotics.\n\nBeyond his professional experience, Collin has demonstrated exceptional project development skills through hackathon competitions. He won first place at SB Hacks XI with SnapSell, a solution that automates the Facebook Marketplace selling process. He also secured first place in the 2024 Jumpstart Designathon, creating a wireframe for neurodivergent users to manage food waste, competing at the Intermediate+ level. Additionally, he won the Spring 2022 Blockchain Project Series, earning $3,750 for developing a web forum that incorporated cryptocurrency bounties for questions.\n\nCollin is actively involved in campus leadership as the President of Alpha Kappa Psi, having previously served as VP of Internal Affairs, VP of Alumni Relations, and Philanthropy Director. He joined the fraternity during his freshman year and values the community of \"intelligent and lively individuals\" it has provided him.\n\nOriginally from Cupertino, CA, Collin's educational background includes international experience, having attended Shanghai High School International Division before completing his high school education at Monta Vista High School. He aspires to work in tech and possibly found his own company one day. In his free time, he enjoys playing sports like tennis, pickleball, volleyball, basketball, rock climbing, and weightlifting, as well as cooking new recipes.\n\nCollin is an active GitHub user (CollinQ) with 12 followers and has contributed to numerous repositories, including projects for hackathons and university coursework. His combination of strong academic performance, diverse technical internships, leadership experience, and proven ability to develop innovative solutions in competitive environments positions him as a promising talent in the computer science field."
}