{
    "id": "cooper-gamble",
    "name": "Cooper Gamble",
    "profile_pic": "https://media.licdn.com/dms/image/v2/D5603AQF_eVhrDSBu8w/profile-displayphoto-shrink_200_200/profile-displayphoto-shrink_200_200/0/1719544888930?e=2147483647&v=beta&t=Qf6SqIuSkiiZUHRlMxzeJ62QK9ZQURlW3khjkv7GjwU",
    "contacts": [
        "cooper-gamble@linkedin.com"
    ],
    "links": [
        "https://www.hackerrank.com/certificates/a85a092c0342",
        "https://www.hackerrank.com/certificates/6f8dba8eb9a3",
        "https://www.citiprogram.org/verify/?w889a86ae-7ac0-4720-96aa-a3cac6f5dc8d-57165501",
        "https://www.citiprogram.org/verify/?w2a006c1c-af26-44fe-affc-f47e75277b55-57165506",
        "https://doi.org/10.3348/kjr.2024.0108",
        "https://doi.org/10.48550/arXiv.2401.08058",
        "https://doi.org/10.48550/arXiv.2311.09402"
    ],
    "short_description": "Founding Engineer at Noise Labs and Computer Science & Physics student at USC. Cooper has conducted research in radiology informatics at Mayo Clinic and has multiple published papers. He describes himself as \"Forever curious\" and has experience in quantitative development and AI research.",
    "long_description": "Cooper Gamble is a Founding Engineer at Noise Labs in San Francisco, where he has been working since June 2024. He is simultaneously pursuing a B.S. in Computer Science and Physics at the University of Southern California (2023-2026), with a minor in Mathematical Finance.\n\nCooper has an impressive research background, having worked as a Radiology Informatics Intern at Mayo Clinic for nearly two years (2022-2024). During this time, he conducted research on radiology and artificial intelligence under Dr. Shahriar Faghani and Dr. Bradley Erickson, with his work being accepted for presentation at multiple prestigious conferences including the Mayo Clinic AI Summit, International Society for CT, CMIMI, ASFNR, and RSNA.\n\nHis professional experience also includes serving as an Engineering Manager at Develop for Good (April-August 2024) and as a Quantitative Developer at Quant SC (September 2023-February 2024), where he developed a high-frequency trading platform implementing state-of-the-art trading algorithms.\n\nCooper has published several papers, including \"Uncover This Tech Term: Uncertainty Quantification for Deep Learning\" in the Korean Journal of Radiology, \"Toward Clinically Trustworthy Deep Learning: Applying Conformal Prediction to Intracranial Hemorrhage Detection,\" and \"Synthetically Enhanced: Unveiling Synthetic Data's Potential in Medical Imaging Research.\"\n\nHis academic achievements are equally impressive. He was valedictorian of his high school class with a 4.9/4.0 GPA, and has received numerous accolades including being selected as the youngest-ever RSNA Fast 5 speaker, placing second in the Harvard Undergraduate Trading Competition, becoming a Coca Cola Scholarship Finalist, and qualifying for the USA Computing Olympiad Gold Division.\n\nCooper is actively involved in various university organizations including Blockchain@USC, HackSC, Marshall Case Team, Men's Crew (as Vice President of Fundraising), QuantSC, Trojan Consulting Group, and Trojan Investing Society. He also has certifications in JavaScript and Python from HackerRank, as well as research ethics certifications from the CITI Program.\n\nHis self-description as \"Forever curious\" aptly captures his diverse interests and accomplishments across technology, finance, and medical research."
}