{
    "id": "cooper-gamble",
    "name": "Cooper Gamble",
    "profile_pic": "https://media.licdn.com/dms/image/v2/D5603AQF_eVhrDSBu8w/profile-displayphoto-shrink_200_200/profile-displayphoto-shrink_200_200/0/1719544888930?e=2147483647&v=beta&t=Qf6SqIuSkiiZUHRlMxzeJ62QK9ZQURlW3khjkv7GjwU",
    "links": [
        "https://doi.org/10.3348/kjr.2024.0108",
        "https://doi.org/10.48550/arXiv.2401.08058",
        "https://doi.org/10.48550/arXiv.2311.09402"
    ],
    "short_description": "Founding Engineer at Noise Labs with a unique background bridging computer science, physics, and medical AI research. Cooper has published multiple papers on uncertainty quantification and synthetic data in medical imaging, and was recognized as the youngest-ever Fast 5 speaker at the RSNA conference while conducting research at Mayo Clinic.",
    "long_description": "Cooper Gamble is a Founding Engineer at Noise Labs in San Francisco, bringing his technical expertise to this emerging company while pursuing a dual degree in Computer Science and Physics at the University of Southern California (expected graduation 2026). His professional journey showcases a remarkable intersection of software engineering, medical AI research, and quantitative finance.\n\nDuring his 1.8-year tenure as a Radiology Informatics Intern at Mayo Clinic, Cooper conducted groundbreaking research at the intersection of radiology and artificial intelligence under distinguished mentorship. His work resulted in multiple publications focused on uncertainty quantification for deep learning in medical imaging and the application of synthetic data in medical research. His research contributions earned him recognition as the youngest-ever Fast 5 speaker at the prestigious 2023 RSNA \"Leading Through Change\" conference, and his work was presented at multiple other professional conferences including the Mayo Clinic AI Summit, International Society for CT, CMIMI, and ASFNR.\n\nCooper has also demonstrated his technical versatility as a Quantitative Developer at Quant SC, where he developed high-frequency trading platforms implementing state-of-the-art algorithms and researched potential improvements to enhance financial outcomes. His technical skills were further validated through his achievement as a USA Computing Olympiad Gold Division Qualifier.\n\nBeyond his technical accomplishments, Cooper has shown leadership as an Engineering Manager at Develop for Good and through his involvement in humanitarian projects like Run for Ukraine and Run for Lebanon. His academic excellence is evidenced by his selection as a Coca Cola Scholarship Finalist (among 250 from over 91,000 applicants) and his second-place finish at the Harvard Undergraduate Trading Competition.\n\nCooper's self-description as \"Forever curious\" aptly captures his multidisciplinary approach to technology and problem-solving, combining rigorous technical skills with innovative thinking across diverse domains including medical AI, quantitative finance, and software engineering."
}