{
    "id": "cterdam",
    "name": "Liangze Li",
    "profile_pic": "https://media.licdn.com/dms/image/v2/D5603AQFniucXAPif2w/profile-displayphoto-shrink_200_200/profile-displayphoto-shrink_200_200/0/1724899314595?e=2147483647&v=beta&t=dMnEw9T_BPNCv1xHcRO4nriwbfaN1y2iECgJH2j9E58",
    "contacts": [
        "2K followers",
        "500+ connections"
    ],
    "links": [
        "https://uk.linkedin.com/company/googledeepmind",
        "https://www.linkedin.com/school/cmuscs/"
    ],
    "short_description": "Liangze Li is an AI researcher at Google DeepMind with a background from Carnegie Mellon University School of Computer Science. He is actively involved in AI research and startups, and is multilingual with proficiency in Mandarin, English, Cantonese, and Russian.",
    "long_description": "Liangze Li is an AI researcher currently working at Google DeepMind and has an educational background from Carnegie Mellon University School of Computer Science. He describes himself as being involved in AI research and startups, and is open to connecting and answering questions.\n\nDuring his time at Carnegie Mellon University, Liangze was highly active in student organizations. He founded and served as President of the CMU Blackjack Society and was the Founder and Lecturer of Carnegie Mellon University Student College. He also served as President of the Student College Executive Committee and as a Representative in the Graduate Student Assembly. Additionally, he played Alto Saxophone in the Carnegie Mellon University Kiltie Band.\n\nPrior to CMU, Liangze was involved in various organizations including founding and leading the Pinghe School Philosophy Club and playing Alto Saxophone in the Pinghe Chamber Orchestra. He received recognition in mathematics, achieving a Global Team Ranking of 62 in the American Regional Mathematics League in 2016.\n\nLiangze is multilingual, with native or bilingual proficiency in both Mandarin and English, full professional proficiency in Cantonese, and limited working proficiency in Russian. His profile indicates he has 2K followers and over 500 connections on LinkedIn, suggesting he maintains an active professional network."
}