{
    "id": "dedatta",
    "name": "Debajyoti (Debo) Datta",
    "profile_pic": "https://media.licdn.com/dms/image/v2/D5603AQF7dB8dvRc2wg/profile-displayphoto-shrink_200_200/profile-displayphoto-shrink_200_200/0/1677269077236?e=2147483647&v=beta&t=gliXfLC1WBtnizVk1OxTFARr8CD7ohNXKjSi1klFJMc",
    "links": [
        "https://www.linkedin.com/in/dedatta",
        "https://profiles.ucsf.edu/debajyoti.datta",
        "https://scholar.google.com/citations?user=L6lx408AAAAJ"
    ],
    "short_description": "Debajyoti (Debo) Datta is an experienced machine learning engineer and physician currently at Hippocratic AI with a background in building large-scale ML systems at AWS AI and Crossing Minds. He is an Amazon Research Fellow with expertise in TensorFlow and has contributed to open-source projects like Learn2learn for meta-learning research.",
    "long_description": "Debajyoti (Debo) Datta has a unique dual career as both a machine learning specialist and a practicing physician. Currently working as a Co-Founder at Hippocratic AI, a healthcare-focused AI company that recently secured $141M in Series B funding, Debo brings valuable expertise to the healthcare AI sector.\n\nHis professional journey in AI includes significant roles at AWS AI and Crossing Minds, where he developed and implemented sophisticated machine learning solutions. In recognition of his contributions to the field, he was awarded the Amazon Research Fellowship in September 2022, highlighting his innovative approach to AI research.\n\nAs a physician, Dr. Datta is an Assistant Professor of Medicine at UCSF, specializing in Hematology and Oncology. He completed his MD at UCSF School of Medicine in 2012, followed by an Internal Medicine residency at Thomas Jefferson University Hospital (2012-2015) and a Hematology/Oncology fellowship at UCSF (completed in 2018). He also holds a PhD in Biophysics from UCSF (2010) and an undergraduate degree in Physics from Harvard University (2002).\n\nHis research work spans both fields, with publications in biomedical natural language processing, clinical data analysis, and AI applications in healthcare. He has contributed to projects like \"PatientExploreR\" for visualizing patient clinical histories and \"ROMOP\" for interfacing with electronic health record data. His recent work includes AI prediction of early relapse in lymphoma patients and analysis of treatment patterns in lung cancer.\n\nDebo has a strong technical background in machine learning, particularly in large language models. He has contributed to significant AI research projects including BLOOM (a 176B-parameter multilingual language model) and has been cited thousands of times for his work on multitask prompted training and language model capabilities.\n\nHis competitive achievements include being part of the winning team at the Facebook Global PyTorch Hackathon in 2019, where he contributed to Learn2learn, a PyTorch library designed to make meta-learning more accessible. He also participated in the Allen NLP Hackathon 2021, focusing on recovering dataset errors and detecting model limitations through weak supervision.\n\nDebo's academic excellence was recognized with the Ruthie Oxford Memorial Award from the Systems and Information Engineering Department at the University of Virginia in 2016, given to the most promising graduate student of the year.\n\nHis multilingual abilities include native proficiency in English and Bengali, along with professional working proficiency in Hindi, which enhances his collaborative capabilities in diverse teams.\n\nDebo maintains an active interest in cutting-edge AI developments, particularly in reinforcement learning for language models, CUDA kernel optimization, and open-source AI initiatives as evidenced by his recent activity. His project \"Open-Advice\" suggests an ongoing commitment to knowledge sharing and community contribution in the AI field."
}