{
    "id": "dedatta",
    "name": "Debajyoti (Debo) Datta",
    "profile_pic": "https://media.licdn.com/dms/image/v2/D5603AQF7dB8dvRc2wg/profile-displayphoto-shrink_200_200/profile-displayphoto-shrink_200_200/0/1677269077236?e=2147483647&v=beta&t=gliXfLC1WBtnizVk1OxTFARr8CD7ohNXKjSi1klFJMc",
    "contacts": [
        "4K followers",
        "500+ connections"
    ],
    "links": [
        "https://www.linkedin.com/company/hippocratic-ai-health",
        "https://in.linkedin.com/school/birla-institute-of-technology-and-science-pilani"
    ],
    "short_description": "Experienced professional in building large scale Machine Learning Systems, currently at Hippocratic AI. Alumnus of Birla Institute of Technology and Science with expertise in AI and machine learning technologies. Recognized with multiple awards including the Amazon Research Fellowship.",
    "long_description": "Debajyoti (Debo) Datta is an experienced professional specializing in building large scale Machine Learning Systems. He has worked at AWS AI and Crossing Minds, and is currently associated with Hippocratic AI, focusing on applications of AI in healthcare.\n\nDebo is an alumnus of Birla Institute of Technology and Science, and has demonstrated expertise in various machine learning technologies and frameworks. His professional interests appear to be centered around AI, particularly in healthcare applications, as evidenced by his current affiliation with Hippocratic AI.\n\nHe has received several prestigious recognitions throughout his career, including the Amazon Research Fellowship (2022), and has participated in various hackathons such as the Allen NLP Hackathon 2021 and Facebook Global Pytorch Hackathon (2019). He was also awarded the Ruthie Oxford Memorial Award from the Systems and Information Engineering Department at the University of Virginia in 2016.\n\nDebo has obtained multiple certifications in machine learning and data science, including Advanced Machine Learning with TensorFlow on Google Cloud Platform Specialization and Machine Learning with TensorFlow on Google Cloud Platform Specialization from Coursera.\n\nHe is multilingual, with native proficiency in English and Bengali, and professional working proficiency in Hindi. His activities on LinkedIn suggest he stays current with developments in AI, machine learning, and healthcare technology, frequently engaging with content related to these fields."
}