{
    "id": "djain18",
    "name": "Devanshi Jain",
    "profile_pic": "https://media.licdn.com/dms/image/v2/D5603AQElzTHawk0zBA/profile-displayphoto-shrink_200_200/B56ZQje7o0G4AY-/0/1735762099449?e=2147483647&v=beta&t=fhop_HdAtPvHkmQLGe8vosgQHbHbAdYb9hLhSVHoklg",
    "links": [
        "https://escholarship.org/uc/item/8rs4v3pq",
        "mailto:djain@ucsd.edu",
        "https://devanshi.codes/",
        "https://www.linkedin.com/in/djain18/",
        "https://github.com/devanshi-jain"
    ],
    "short_description": "Devanshi Jain is a Mathematics and Computer Science undergraduate at UC San Diego with a unique blend of software engineering and computational research experience. She has interned at Meta and Amazon, while also contributing to research in energy optimization and computational fluid dynamics. Her technical expertise spans backend development, signal processing, and mathematical modeling, with a particular focus on applying computational methods to solve complex engineering problems.",
    "long_description": "Devanshi Jain is a Mathematics and Computer Science undergraduate at UC San Diego with a diverse portfolio spanning software engineering, computational research, and mathematical analysis. Her professional journey includes software engineering internships at both Meta and Amazon, where she worked on login core products and cross-border transportation systems respectively.\n\nBeyond her industry experience, Devanshi has demonstrated exceptional research capabilities across multiple domains. At UC San Diego's Center for Energy Research, she improved energy efficiency by 20% through scheduler optimization algorithms. Her work at the Computational Modeling and Flow Physics Lab led to a 12.5% efficiency improvement for NASA's GE90 engine through non-linear optimization techniques, utilizing 200,000 high-performance computing hours for complex CFD simulations.\n\nDevanshi's technical versatility extends to signal processing, where she developed algorithms for acoustic systems and beamforming while working with Triton Robosub. She also built a neurocognitive testing web application for sleep apnea patients at UC San Diego's School of Medicine, contributing to the San Diego Verbal Paired-Associates (SD-VPA) App for testing sleep-dependent memory.\n\nHer leadership experience is equally impressive, serving as President of the Society of Undergraduate Mathematics Students and Technical Chair for IEEE's Student Branch at UC San Diego. She has also participated in multiple advanced mathematics reading groups, studying topics like commutative algebra, functional analysis, and translation surfaces.\n\nDevanshi has published research on turbo-machinery compressor optimization, where her work exceeded NASA's 1980 model efficiency by 12.5%. Her technical skills include Python, JavaScript, React.js, NextJS, AWS, Git, HTML/CSS, Django, and specialized tools like Ansys for computational fluid dynamics.\n\nAs an active member of the academic community, she has served as a Teaching Assistant for UCSD Cosmos and participated in various innovation programs including QuForce Innovation Fellow and Blackstone LaunchPad Incubator. Her unique combination of software engineering expertise, mathematical rigor, and research experience positions her as a standout talent in computational problem-solving and optimization."
}