{
    "id": "edreismd",
    "name": "Eduardo Pontes Reis",
    "profile_pic": "https://media.licdn.com/dms/image/v2/D4D03AQHmPHJIlPURpw/profile-displayphoto-shrink_200_200/profile-displayphoto-shrink_200_200/0/1711049597043?e=2147483647&v=beta&t=0iYQR_PXAMwfMcPEMQtZN21kp5nGGJPNu2wLfelvwbk",
    "links": [
        "https://github.com/edreisMD",
        "http://hipuc.com/2016_fellows/",
        "https://orcid.org/0000-0001-5110-457X",
        "https://scholar.google.com/citations?user=NglVXZ8AAAAJ"
    ],
    "short_description": "Eduardo Pontes Reis is a physician-researcher specializing in radiology and AI applications in healthcare. Currently affiliated with Stanford University and Hospital Israelita Albert Einstein, he focuses on developing AI tools for medical imaging and clinical documentation. His research has been cited over 1,200 times, with significant contributions to medical text summarization, chest X-ray interpretation, and multimodal medical AI systems.",
    "long_description": "Eduardo Pontes Reis is a physician-researcher at the intersection of medicine and artificial intelligence, currently serving as a Visiting Scholar at Stanford University's Center for Artificial Intelligence in Medicine & Imaging (AIMI) and as a researcher at Hospital Israelita Albert Einstein in Brazil.\n\nHis educational background includes an MD from State of Sao Paulo University (UNESP) in 2013, followed by a Radiology Residency at UNICAMP in 2017, and Neuroradiology specialization at Hospital Israelita Albert Einstein in 2018. This clinical foundation has informed his research focus on applying AI to healthcare challenges.\n\nEduardo's research has gained significant recognition in the field of medical AI. According to Google Scholar, his work has been cited over 1,200 times, with an h-index of 13. His research contributions span several important areas:\n\n1. Medical Text Summarization: He co-authored a groundbreaking study published in Nature Medicine demonstrating that adapted large language models can outperform medical experts in clinical text summarization, potentially reducing documentation burden for clinicians.\n\n2. Medical Imaging AI: He has contributed to multiple projects involving AI applications in radiology, including the development of BRAX (Brazilian labeled chest X-ray dataset), and participated in the creation of ChexAgent, a foundation model for chest X-ray interpretation.\n\n3. Multimodal Medical AI: His work includes contributions to Med-Flamingo (a multimodal medical few-shot learner) and Merlin (a vision-language foundation model for 3D computed tomography).\n\n4. Clinical Applications: Eduardo's research focuses on practical applications that can improve healthcare delivery, including automated contrast phase detection in abdominal CT and AI tools for radiology report generation.\n\nAt Stanford, Eduardo is part of the Machine Intelligence for Medical Imaging (MIMI) research group led by Dr. Akshay Chaudhari, where his research focuses on developing AI tools to improve healthcare, particularly in radiology and medical records. His specific interests include methods that use pairs of images and reports to teach radiology to computers, and applying large language models to reduce documentation burden for medical professionals.\n\nEduardo is an advocate for open data in healthcare when safe and feasible, contributing to the development of open-source datasets and tools. His professional affiliations include membership in the Sociedade Paulista de Radiologia (São Paulo Radiology Society), Colégio Brasileiro de Radiologia (Brazilian College of Radiology), and CREMESP (Regional Council of Medicine of the State of São Paulo).\n\nBeyond his professional pursuits, Eduardo enjoys tennis, music (particularly playing the piano), and hiking. He is fluent in Portuguese (native) and English (professional proficiency), enabling him to engage with international research and collaboration opportunities in his field."
}