{
    "id": "emilybtran",
    "name": "Emily T.",
    "profile_pic": "https://media.licdn.com/dms/image/v2/D5603AQFWx6niV5JBDQ/profile-displayphoto-shrink_200_200/B56ZPcnkT8HoAY-/0/1734573181156?e=2147483647&v=beta&t=REILAvZntCzgpDl9D8N7MV5A34EHU0swgiD6Nlx_xZY",
    "links": [
        "https://www.linkedin.com/in/emilybtran",
        "mailto:emtran04@stanford.edu"
    ],
    "short_description": "Emily is a Computer Science and Management Science & Engineering student at Stanford University with a keen interest in AI innovation and medical research. Her academic pursuits bridge technical expertise with healthcare applications, particularly in orthopedics and AI integration in medicine.",
    "long_description": "Emily T. (also known as Emily Phu Tran or Emily Thomas-Tran) is currently pursuing a Bachelor of Science degree in Computer Science with a focus on Management Science & Engineering at Stanford University. Her academic profile shows a multifaceted individual who bridges technical expertise with medical interests.\n\nIn 2022, Emily was a medical student at Stanford University School of Medicine, where she participated in Match Day and was accepted for a psychiatry residency at the University of Washington alongside her spouse, Jane Thomas-Tran. This suggests she may have completed or is pursuing a dual degree program combining her technical background with medical education.\n\nEmily has demonstrated significant research experience in the medical field, particularly with Stanford's Pediatric Orthopedic Research Program. She worked on an ACL length study with Dr. Shea, contributing to a project that involved retrospective MRI studies of pediatric patients. Her research was presented at the 7th annual meeting of PRISM in Glendale, AZ in January 2020. She has also been involved in biomechanics and histology research related to pediatric discoid meniscus saucerization and meniscectomy.\n\nHer Stanford profile indicates she uses the email emtran04@stanford.edu, confirming her affiliation with the university. The combination of her computer science background and medical research experience positions Emily at the intersection of technology and healthcare, with particular strengths in:\n\n1. AI Research and Academic Innovation: Her engagement with Stanford HAI (Human-Centered AI) content and AI-native research discovery platforms suggests an interest in applying AI to medical and research contexts.\n\n2. Medical Research: Her work with the Pediatric Orthopedic Research Program demonstrates hands-on clinical research experience and the ability to contribute to medical knowledge.\n\n3. Interdisciplinary Collaboration: Her background spanning computer science, management science, and medicine indicates strong capabilities in bridging technical and healthcare domains.\n\n4. Academic Presentation: Her experience presenting research at professional conferences shows scholarly communication skills.\n\nEmily's unique combination of technical expertise in computer science and AI with practical medical research experience positions her well for innovative work at the intersection of technology and healthcare, whether in clinical practice, medical research, or health technology development."
}