{
    "id": "eric-mao",
    "name": "Eric Mao",
    "profile_pic": "https://media.licdn.com/dms/image/v2/D4E03AQHU_MWPqnCNqg/profile-displayphoto-shrink_200_200/profile-displayphoto-shrink_200_200/0/1694921091463?e=2147483647&v=beta&t=mtLdPIsmITHYpmtl-YpSne8xsvvfUyG6Waq0pwO35Vc",
    "links": [
        "https://lnkd.in/eVmhBBEU",
        "mailto:ericmao0606@gmail.com",
        "https://www.instagram.com/ericmao__/",
        "https://www.ericmao.com.au"
    ],
    "short_description": "Co-Founder of Linkd (YC X25), former MasterChef Australia contestant, and UPenn M&T student with a strong background in AI research. Eric has worked on diverse projects from carbon sequestration estimation to cognitive status prediction using machine learning, and is currently building people search solutions through Y Combinator's accelerator program.",
    "long_description": "Eric Mao is a multifaceted entrepreneur and researcher at the intersection of technology, business, and culinary arts. As the Co-Founder of Linkd (YC X25), he's currently building people search solutions through Y Combinator's prestigious accelerator program. His product has shown impressive early traction, with 18,000 users spending over 1,350 hours on the site within 48 hours of launch.\n\nEric was previously enrolled in the Jerome Fisher Program in Management & Technology (M&T) at the University of Pennsylvania, pursuing a dual degree in Computer Science and Business Administration at Wharton. He's currently on leave to focus on his startup.\n\nHis research experience spans multiple AI applications. He has worked on machine learning approaches for carbon credit accuracy, deep learning for 3D printing reliability enhancement, cognitive status prediction from fMRI data, and mind-controlled wheelchairs for ALS patients. His research on carbon sequestration earned him the Best Research Poster award at the International Conference on Climate Change in 2024.\n\nEric gained national recognition as a contestant on Season 13 of MasterChef Australia at the age of 21. As one of the youngest competitors, he showcased his passion for regional Chinese cuisine and Pan-Asian cooking. His culinary journey began early - he had previously auditioned for Junior MasterChef Australia at age 10. With roots in Wuxi, Eastern China, Eric's cooking is deeply influenced by his heritage and family traditions. During the competition, he created signature dishes including Shanghai Chive Pancake with Black Garlic Prawns, Three Treasure Wonton, and Strange Flavour Chicken.\n\nBefore MasterChef, Eric was a medical student at the University of New South Wales, where he made the difficult decision to defer his studies to pursue his culinary passion. His dream has been to create a pop-up restaurant that brings regional Chinese cuisine into a modern Australian setting.\n\nEric was also selected as a Fellow at Telora, where he worked on Iris, an improved file management system for video editors. His entrepreneurial journey includes participation in Z Fellows, a program for founders and builders.\n\nDuring his high school years at Crescent School, Eric demonstrated exceptional talent in physics and computer science, representing Team Canada in the International Young Physicists' Tournament, earning a Gold Medal in the Canadian Young Physicists' Tournament, winning the High School Big Data Challenge, and reaching the Platinum Division in the USA Computing Olympiad (USACO).\n\nEric combines technical expertise in AI and machine learning with business acumen, entrepreneurial drive, and culinary creativity, focusing on creating practical solutions to real-world problems across multiple disciplines."
}