{
    "id": "ernesto-nam",
    "name": "Ernesto Nam",
    "profile_pic": "https://media.licdn.com/dms/image/v2/D5603AQFqOu3BvjLCwQ/profile-displayphoto-shrink_200_200/profile-displayphoto-shrink_200_200/0/1702936929596?e=2147483647&v=beta&t=V6qhxgvL6rPMfCZGmUvBCuE5kR7ltgTdhgC19EYgruA",
    "contacts": [
        "2K followers",
        "500+ connections"
    ],
    "links": [
        "https://www.linkedin.com/in/ernesto-nam"
    ],
    "short_description": "CS student at Stanford University with a focus on AI. Currently building at 11x. Previously interned at Amazon (Alexa) and Hashdex. Multilingual professional fluent in Spanish, English, Korean, and Portuguese with interests in tech and entrepreneurship in both Latin America and the US.",
    "long_description": "Ernesto Nam is a Computer Science student at Stanford University specializing in Artificial Intelligence. He is currently building at 11x, an Agentic AI company. Before starting university, Ernesto took two gap years to gain professional experience, working in various roles including Software Engineering Intern at Amazon (Alexa team) and Hashdex.\n\nHis professional journey includes diverse experiences such as Business Development at cloud humans, Content Creator at Tract, Consultant at IDB Lab, and Private Tutor teaching math, English, and test preparation for SAT and TOEFL. Ernesto also has entrepreneurial experience as the Founder of ENGLOBAR PY.\n\nErnesto has a strong academic background, having attended Stanford University for Computer Science with a focus on AI, and participated in Latitud's LF3 program. He is an alumnus of the Latin American Leadership Academy, where he participated in both the Inaugural Academy and Brazil Leadership Bootcamp.\n\nHis achievements include multiple awards in mathematics, having won nine championships in the Alto Parana Department for the National Math Olympiad, as well as two gold medals, four silver medals, and two bronze medals at the national level.\n\nErnesto is multilingual, with native or bilingual proficiency in Spanish, and full professional proficiency in English, Korean, and Portuguese. He has expressed a strong interest in technology and entrepreneurship in both Latin America and the United States, demonstrating his global perspective and ambition to make an impact across regions."
}