{
    "id": "ernesto-nam",
    "name": "Ernesto Nam",
    "profile_pic": "https://media.licdn.com/dms/image/v2/D5603AQFqOu3BvjLCwQ/profile-displayphoto-shrink_200_200/profile-displayphoto-shrink_200_200/0/1702936929596?e=2147483647&v=beta&t=V6qhxgvL6rPMfCZGmUvBCuE5kR7ltgTdhgC19EYgruA",
    "links": [
        "https://www.linkedin.com/in/ernesto-nam",
        "https://twitter.com/ernesto_nam",
        "https://github.com/namernesto",
        "https://latinamericanleadershipacademy.org/interview-with-ernesto-nam-the-founder-of-englobar/"
    ],
    "short_description": "Ernesto Nam is a Computer Science student at Stanford University specializing in AI, currently building at 11x. With a multilingual background spanning Spanish, English, Korean, and Portuguese, he founded ENGLOBAR PY to address social issues in Latin America and was recognized as a 2020 Straubel Impact Leader. He serves as IFC Vice President of Membership at Stanford and previously gained professional experience at Amazon, Hashdex, and other tech companies during his two gap years.",
    "long_description": "Ernesto Nam is a Computer Science junior at Stanford University with a focus on Artificial Intelligence. Currently, he's building at 11x, an agentic AI company. His professional journey is marked by diverse experiences across technology and entrepreneurship in both Latin America and the United States.\n\nBefore starting his university education, Ernesto took two gap years to gain professional experience, working as a Software Engineering Intern at Amazon (Alexa team) and Hashdex, a cryptocurrency investment firm. His entrepreneurial spirit led him to found ENGLOBAR PY, a non-profit organization that seeks to relieve poverty by empowering youth volunteers to engage and contribute to communities in need. Englobar operates in Paraguay and Mexico with over 250 volunteers, offering lessons in math, environmental sciences, and leadership development.\n\nThe inspiration for Englobar came during a challenging period in Ernesto's life when his family faced economic difficulties. While volunteering with TECHO (a \"Habitat for Humanity\" type foundation), he led a housing construction project as the first teenager to lead a build primarily of college students. This experience gave him perspective on helping those less fortunate and became his \"true north\" for social impact work.\n\nErnesto's background is impressively international and multilingual, with fluency in Spanish (native), English, Korean, and Portuguese at professional levels. This multicultural perspective has informed his work across borders, including roles at Cloud Humans for business development, content creation at Tract, and consulting for IDB Lab.\n\nAt Stanford, Ernesto serves as the IFC Vice President of Membership and has worked on various projects including Blank (a social reading app), AI Deck (a presentation about generative AI for executives in Brazil), Jobi (LinkedIn for blue-collar workers in Latin America), and Edus (cohort-based courses as a new type of university).\n\nHis educational journey includes not only Stanford but also participation in Latitud's LF3 program and the Latin American Leadership Academy, where he was an Inaugural Academy Alum and Brazil Leadership Bootcamp participant. Ernesto has also demonstrated exceptional mathematical aptitude, winning multiple medals in National Math Olympiads, including two gold medals and being a nine-time Alto Parana Department Champion.\n\nIn 2020, Ernesto was recognized as a Straubel Impact Leader for his work with Englobar, joining a cohort of young leaders developing sustainable solutions to environmental and societal challenges. His diverse background spanning technology, entrepreneurship, education, and social impact positions him uniquely at the intersection of AI innovation and cross-cultural leadership."
}