{
    "id": "evanzwang",
    "name": "Evan Wang",
    "profile_pic": "https://media.licdn.com/dms/image/v2/D5603AQFVAxOQhtsY8Q/profile-displayphoto-shrink_200_200/profile-displayphoto-shrink_200_200/0/1684578215944?e=2147483647&v=beta&t=FPg4dCSz65Pg5idxvGWiOKRiH3YdItFmQnLcXw2gXH0",
    "links": [
        "https://arxiv.org/abs/2409.03733",
        "https://www.linkedin.com/in/evanzwang",
        "https://dblp.org/pid/263/0965"
    ],
    "short_description": "Evan Wang is a researcher at Scale AI and Caltech graduate specializing in AI, with notable contributions to natural language processing and federated learning. His research has been featured at prestigious conferences including ICLR and NeurIPS, and he has demonstrated exceptional skills in competitive programming and data science competitions.",
    "long_description": "Evan Wang is a talented AI researcher currently working at Scale AI after studying at Caltech. His research focuses on advanced AI techniques, particularly in natural language processing and distributed learning systems.\n\nHis publication record demonstrates his expertise in multiple AI domains. His recent work \"Planning In Natural Language Improves LLM Search For Code Generation\" was accepted as a Spotlight paper at ICLR 2025 and featured at the System 2 Reasoning workshop at NeurIPS 2024, showing his contributions to improving how language models generate code. He has also published significant work on federated learning with \"SWIFT: Rapid Decentralized Federated Learning via Wait-Free Model Communication\" (ICLR 2023 and NeurIPS FL Workshop 2022), and graph neural networks with \"Sketch-GNN: Scalable Graph Neural Networks with Sublinear Training Complexity\" (NeurIPS 2022).\n\nEvan's academic journey includes undergraduate studies at the University of Maryland, College Park (2021-2022) before transferring to the California Institute of Technology (2022-2025). During his time at Caltech, he was involved in campus activities, as evidenced by his candidacy in the ASCIT Winter Elections where another student named Evan Portnoi was also running for IHC Chair.\n\nEvan has demonstrated exceptional analytical and problem-solving abilities through his competitive achievements. He won 2nd place at the Citadel Global Data Open and 1st place at the Citadel West Coast Data Open, showcasing his data science skills. His programming prowess is evident from qualifying for the ICPC North America Championship representing Caltech and reaching the USA Computing Olympiad Platinum Division (top 300 high school students in the US). He also placed in the top 500 in the prestigious Putnam mathematics competition.\n\nIn addition to his research work, Evan gained practical industry experience as a Research Intern at Scale AI in 2024 before taking on a full-time role there. His profile on OpenReview confirms his academic affiliations and research interests in the AI community.\n\nHe is multilingual, with native proficiency in both English and Chinese, and limited working proficiency in Spanish, which enhances his ability to collaborate in diverse international research environments."
}