{
    "id": "evtran",
    "name": "Evelyn T.",
    "profile_pic": "https://media.licdn.com/dms/image/v2/D5603AQFQxO-eia1jmw/profile-displayphoto-shrink_200_200/profile-displayphoto-shrink_200_200/0/1686641156064?e=2147483647&v=beta&t=nh_9J8JbF96KaolrbHja2jC7irtVwy4jSEEEGo6rHmQ",
    "contacts": [
        "LinkedIn: evtran"
    ],
    "links": [
        "https://www.linkedin.com/in/evtran"
    ],
    "short_description": "Evelyn T. is a tech entrepreneur and ML researcher building AI for refund fraud prevention. She is a Regents' and Chancellor's Scholar at UC Berkeley studying Computer Science with a Material Science Engineering minor, and is part of Stanford StartX S24 cohort. She has founded multiple startups and works with prestigious venture capital firms.",
    "long_description": "Evelyn T. is a dynamic entrepreneur and machine learning researcher focused on building AI solutions for refund fraud prevention. As a Regents' and Chancellor's Scholar at UC Berkeley, she is pursuing a Bachelor of Science in Computer Science with a minor in Material Science Engineering, while also studying Business Administration at the Haas School of Business.\n\nHer professional journey includes multiple founder roles, including her current position as an ML Researcher at Lawrence Berkeley Labs and as a Founder in Residence at Foundation Capital. She is also a Garage Fellow at Pear VC, where she is part of a select community of top engineering students from prestigious universities building startups. Evelyn is currently focused on addressing the $35B in losses to retail fraud.\n\nEvelyn's entrepreneurial experience is extensive. She was accepted into Stanford's StartX accelerator program in 2024, receiving equity-free funding for her venture TouchStone. Previously, she co-founded WerkerBee Inc., a startup addressing challenges in the hospitality industry, and another stealth AI startup. Her venture Connexcities was backed by Intuit Ventures and acquired in June 2022.\n\nHer corporate experience includes a Technical Product Management internship at Intuit and roles in product management and go-to-market strategy at Mitipi - KEVIN and USA Launching Pad. Evelyn also demonstrated her entrepreneurial spirit by running Anchored Garage Gym, where she reached $15k MRR through online fitness programs and personal training.\n\nEvelyn is deeply committed to mental health advocacy, serving as a volunteer for multiple organizations including NAMI, Active Minds, Crisis Text Line, and MillionKids.org. She has received numerous awards, including the Aerospace Satellite Scholarship, Girl Scouts Take Action Award (Top 3 in California), and First Place in Intuit's Social Innovation Challenge.\n\nShe is fluent in Vietnamese with limited working proficiency in Spanish, and has completed the Certificate of Entrepreneurship & Technology at UC Berkeley College of Engineering twice before her sophomore year, focusing on AI, IoT, and Mobile technologies."
}