{
    "id": "evtran",
    "name": "Evelyn T.",
    "profile_pic": "https://media.licdn.com/dms/image/v2/D5603AQFQxO-eia1jmw/profile-displayphoto-shrink_200_200/profile-displayphoto-shrink_200_200/0/1686641156064?e=2147483647&v=beta&t=nh_9J8JbF96KaolrbHja2jC7irtVwy4jSEEEGo6rHmQ",
    "links": [
        "https://www.linkedin.com/in/evtran",
        "https://www.f6s.com/member/evelyn-tran"
    ],
    "short_description": "Evelyn is a multi-faceted entrepreneur and AI researcher focused on fraud prevention technology. As a UC Berkeley Computer Science and Business Administration student, she has founded multiple startups, including one acquired by Intuit Ventures, and is currently building AI solutions for the retail industry through various prestigious programs including Stanford StartX and Pear VC.",
    "long_description": "Evelyn T. is an accomplished entrepreneur and machine learning researcher with a strong focus on AI applications for fraud prevention. Currently pursuing dual degrees in Computer Science and Business Administration at UC Berkeley with a minor in Material Science Engineering, she has already established herself as a formidable presence in the startup ecosystem.\n\nHer entrepreneurial journey includes co-founding multiple ventures, most notably a startup that was acquired by Intuit Ventures in June 2022. She is currently building AI solutions targeting the $35B retail fraud industry as a Founder in Residence at Foundation Capital and a Garage Fellow at Pear VC, where she was selected as one of the top 20 engineering students across Stanford, Berkeley, and Harvard.\n\nEvelyn's technical expertise has earned her a position as an ML Researcher at Lawrence Berkeley Labs and UC Berkeley's FAVE Lab, and she has been accepted into prestigious programs including Stanford StartX's S24 cohort, which provides equity-free funding for her venture TouchStone. Her product management experience includes an internship at Intuit and consulting work with international companies entering the US market.\n\nDuring her time at UC Berkeley, Evelyn has been actively involved in entrepreneurial courses and projects. She was part of the WorkerBee team in the \"Connected Life: How Mobile/AI/Internet of Things Will Improve Our Lives\" course, developing a platform to connect skilled hospitality professionals with flexible on-demand work to address the severe worker shortage in the industry.\n\nBeyond her technical and business achievements, Evelyn demonstrates a deep commitment to mental health advocacy. As a Gold Award recipient in Girl Scouts (one of the top honors in California), she created a project to break the stigma surrounding mental health in the Asian American community. Drawing from her personal experience with trichotillomania (an obsessive hair-pulling disorder), she networked with experts and nonprofits like Active Minds and National Alliance on Mental Illness to create lasting change at her high school, including revamping student ID cards to optimize access to mental health resources.\n\nEvelyn brings a unique perspective to AI development with her diverse background, which includes running a successful fitness business that reached $15k MRR and working in retail management. She is bilingual in English and Vietnamese, with limited working proficiency in Spanish, further enhancing her ability to connect across cultures and markets. As a twin sister to Emily Tran (who attends Stanford), Evelyn has also co-hosted podcasts focusing on entrepreneurship and mental health awareness."
}