{
    "id": "harshil-avlani-b8b775323",
    "name": "Harshil Avlani",
    "profile_pic": "https://static.licdn.com/aero-v1/sc/h/9c8pery4andzj6ohjkjp54ma2",
    "links": [
        "https://doi.org/10.1016/j.dib.2023.109971",
        "https://github.com/HAvlani/QuantumSoftwareFinalProject",
        "https://www.societyforscience.org/regeneron-sts/2024-student-finalists/harshil_avlani/"
    ],
    "short_description": "Computer Science and Physics student at MIT with award-winning research in quantum computing. Former Research Intern at MIT's Quanta Group and Arizona State University's Quantum Mechanical Engineering Lab, focusing on quantum error characterization and quantum machine learning applications.",
    "long_description": "Harshil Avlani is a dual-major student in Computer Science and Physics at the Massachusetts Institute of Technology (MIT), with an exceptional research background in quantum computing and physics. His academic journey showcases a consistent focus on quantum technologies and computational physics.\n\nCurrently, Harshil serves as a Research Intern with the Quanta Group at MIT's Research Laboratory of Electronics, where he applies his interdisciplinary knowledge to cutting-edge quantum research. Prior to this, he gained valuable experience as a Research Intern at Arizona State University's Quantum Mechanical Engineering Lab under Dr. Houlong Zhuang for over a year, developing expertise in quantum mechanical applications and quantum machine learning.\n\nHarshil has achieved remarkable recognition for his research. His project \"Analyzing the Effect of Mid-Circuit Measurement (MCM) on Spectator Qubits\" earned him first place in the Systems Software category at the International Science Fair and qualified him as a finalist in the prestigious 2024 Regeneron Science Talent Search, where he received a $25,000 academic scholarship. This groundbreaking work identified a previously uncharacterized type of quantum error and revealed significant deficiencies in current quantum simulators.\n\nHis research portfolio includes collaborative work on the Quantum Approximate Optimization Algorithm (QAOA) for solving combinatorial optimization problems, documented in his GitHub repository. He has also worked with the Hauser Research Group at the University of Alabama, where he spent 9 months contributing to physics research projects, and gained experience in computer security at Arizona State University's SEFCOM Lab.\n\nIn 2022, Harshil participated in the MIT Beaver Works Summer Institute as a Quantum Software Student, further enhancing his skills in quantum computing applications. He has also co-founded the Quantum Beavers hackathon group, which tied for first place in the IBM Quantum Explorers Hackathon.\n\nHarshil has already begun contributing to scientific literature, with a publication in Data in Brief journal on \"Dataset on density functional theory investigation of ternary Heusler alloys\" in February 2024. More recently, he has been exploring the intersection of quantum computing and transformer models in machine learning, with applications in mitigating misinformation through quantum-enhanced GAN architectures.\n\nBeyond his academic pursuits, Harshil is an accomplished pianist and has a passion for aviation, being able to identify most major aircraft models by sight. His diverse research experiences across multiple institutions highlight his versatility and dedication to advancing the fields of quantum computing and physics through rigorous academic inquiry and practical applications."
}