{
    "id": "hirekevinfang",
    "name": "Kevin F.",
    "profile_pic": "https://static.licdn.com/aero-v1/sc/h/9c8pery4andzj6ohjkjp54ma2",
    "contacts": [
        "me@kevinfang.tech"
    ],
    "links": [
        "https://cmute.io",
        "https://www.linkedin.com/in/hirekevinfang/"
    ],
    "short_description": "Product at Replo (YC S21) and Community Lead at CMU Tech & Entrepreneurship. Previously worked on NASA rover missions and led teams for space proposals. Carnegie Mellon graduate with degrees in Computer Science and Business Administration.",
    "long_description": "Kevin F. is a product professional currently working at Replo (YC S21) in San Francisco. He graduated from Carnegie Mellon University with a Bachelor of Science in Computer Science and Business Administration with Honors in 2024.\n\nKevin has diverse professional experience across product, technology, and finance. Prior to Replo, he worked at PwC in Cloud & Digital, Expii in Product Growth, Paratus Capital as a Quantitative Analyst, Stayflexi as a Product Manager, and TruePlan.io as a Product Manager.\n\nHis involvement with space technology is notable, having worked on mission operations for Iris Lunar Rover at Carnegie Mellon University and MoonRanger. According to his profile, he led teams for NASA proposals and worked on what became the smallest and lightest rover to reach space.\n\nKevin is deeply involved in the tech and entrepreneurship community at Carnegie Mellon, serving as the Community Lead for CMU Tech & Entrepreneurship. He's also a Podcast Producer & Host for Product@CMU, where he hosts the Product Valley podcast.\n\nDuring his time at Carnegie Mellon, Kevin held leadership positions including Activities Board Finance Chair and President of The Triple Helix. His academic achievements include making the Dean's List twice and graduating with Honors. He's also bilingual, with native proficiency in both English and Mandarin Chinese.\n\nKevin has received several awards including being a National Merit Scholarship Award Finalist and an FBLA National Champion. His recommendation highlights his cross-functional skills, ability to pick up context quickly, and add value from day one in product and business contexts."
}