{
    "id": "hirekevinfang",
    "name": "Kevin F.",
    "profile_pic": "https://static.licdn.com/aero-v1/sc/h/9c8pery4andzj6ohjkjp54ma2",
    "links": [
        "https://kevinfang.tech",
        "https://cmute.io",
        "mailto:me@kevinfang.tech"
    ],
    "short_description": "Product professional at Replo (YC S21) with a unique background in space technology, having led teams for NASA proposals and worked on the smallest and lightest rover to reach space. Carnegie Mellon graduate with dual degrees in Computer Science and Business Administration, Kevin also hosts the Product Valley podcast and leads the CMU Tech & Entrepreneurship community.",
    "long_description": "Kevin F. is a multifaceted product professional currently working at Replo (YC S21), where he brings his technical and business expertise to the startup environment. A recent graduate from Carnegie Mellon University with dual degrees in Computer Science and Business Administration, Kevin has built an impressive portfolio spanning space technology, product management, and community leadership.\n\nHis space technology experience is particularly notable, having worked on mission operations for both the Iris Lunar Rover and MoonRanger projects at Carnegie Mellon. Kevin led teams for NASA proposals and contributed to building what he describes as \"the smallest and lightest rover to reach space\" - a significant achievement in aerospace engineering.\n\nKevin's professional journey includes product roles at several startups and companies. Before joining Replo, he worked in Cloud & Digital at PwC, managed Product Growth at Expii for over a year, served as a Quantitative Analyst at Paratus Capital, and held Product Manager positions at both Stayflexi and TruePlan.io. His recommendation from Daniel Green at TruePlan highlights his ability to \"pick up context quickly and add value from day one\" while helping rebuild their website, analyzing customer usage patterns, and supporting sales efforts.\n\nBeyond his professional work, Kevin is deeply involved in the tech and entrepreneurship community. He serves as the Community Lead for CMU Tech & Entrepreneurship (cmute.io) and produces and hosts the Product Valley podcast through Product@CMU. His leadership extends to his role as Activities Board Finance Chair at Carnegie Mellon and as President of The Triple Helix.\n\nKevin is bilingual in English and Mandarin Chinese, and his academic achievements include making the Dean's List, being a National Merit Scholarship Award Finalist, and winning the FBLA National Championship. This combination of technical knowledge, business acumen, and leadership experience positions Kevin as a versatile professional at the intersection of product development, technology, and entrepreneurship."
}