{
    "id": "jalen-xing",
    "name": "Jalen Xing",
    "profile_pic": "https://media.licdn.com/dms/image/v2/C4E03AQGDpoykXDyWrA/profile-displayphoto-shrink_200_200/profile-displayphoto-shrink_200_200/0/1647472809677?e=2147483647&v=beta&t=4kflAfC1jjeJ9ssyI2UVZXKZZipGkZDWkaIC1thHyeo",
    "links": [
        "mailto:xing.jalen@gmail.com",
        "mailto:jxing@gc-fellows.com"
    ],
    "short_description": "Venture Fellow at General Catalyst with a strong technical background in AI and software engineering. UC Berkeley EECS graduate with experience at Meta, Capital One, and AWS, specializing in semantic search, large language models, and machine learning image classification.",
    "long_description": "Jalen Xing is a Venture Fellow at General Catalyst, where he focuses on scouting and investing in promising student startups. With a solid foundation in Electrical Engineering and Computer Science from UC Berkeley, Jalen has built an impressive technical background through various software engineering roles at leading tech companies.\n\nHis professional experience includes working at Meta on Facebook Search's Vertical Ranking team, developing semantic search and large language model applications at Capital One, and implementing machine learning image classification and search solutions at Amazon Web Services (AWS). He also gained experience in compliance and equity technology during his time at Balyasny Asset Management.\n\nJalen's academic credentials include a Master's degree from UC Berkeley with an exceptional 3.95/4.00 GPA, where he was involved with Codebase and received the Fung Excellence Scholarship. Prior to Berkeley, he completed his Bachelor of Science at the University of Illinois Urbana-Champaign with a near-perfect 3.98/4.00 GPA, where he also worked as a Research Assistant under Professor Bao.\n\nHis unique combination of technical expertise in AI, particularly in semantic search and large language models, along with his current focus on venture capital, positions him at the intersection of cutting-edge technology and investment. Jalen actively seeks connections with student entrepreneurs and innovators, offering his expertise to help them build and grow their startups.\n\nNote: The scraped website information appears to reference different individuals with similar surnames (Xing Wu, Galen Xing, and Xin Xing) who are not related to Jalen Xing. These individuals have different academic and professional backgrounds, including positions at Berkeley in integrative biology, computational biology, and mathematics/quantum chemistry research."
}