{
    "id": "jalen-xing",
    "name": "Jalen Xing",
    "profile_pic": "https://media.licdn.com/dms/image/v2/C4E03AQGDpoykXDyWrA/profile-displayphoto-shrink_200_200/profile-displayphoto-shrink_200_200/0/1647472809677?e=2147483647&v=beta&t=4kflAfC1jjeJ9ssyI2UVZXKZZipGkZDWkaIC1thHyeo",
    "contacts": [
        "xing.jalen@gmail.com",
        "jxing@gc-fellows.com"
    ],
    "links": [
        "https://www.linkedin.com/in/jalen-xing"
    ],
    "short_description": "Venture Fellow at General Catalyst and EECS student at UC Berkeley with extensive software engineering experience at Meta, Capital One, AWS, and Balyasny Asset Management. Focused on scouting and investing in student startups.",
    "long_description": "Jalen Xing is a Venture Fellow at General Catalyst, where he scouts and invests in promising student startups. He is currently pursuing his education in Electrical Engineering and Computer Science (EECS) at UC Berkeley, maintaining an impressive 3.95/4.00 GPA.\n\nJalen has built a strong foundation in software engineering through multiple internships at leading tech companies. Most recently, he worked at Meta on Facebook Search's Vertical Ranking team. Prior to that, he spent 8 months at Capital One focusing on Semantic Search and Large Language Models. His experience also includes roles at Amazon Web Services (AWS), where he worked on Machine Learning Image Classification and Search, and Balyasny Asset Management, where he contributed to Compliance and Equity Technology.\n\nBefore transferring to UC Berkeley, Jalen studied at the University of Illinois Urbana-Champaign, where he earned a Bachelor of Science degree with a near-perfect 3.98/4.00 GPA. During his time there, he served as a Research Assistant under Professor Bao.\n\nJalen is actively involved in campus activities at Berkeley, participating in Codebase and IM Basketball. He is also a recipient of the Fung Excellence Scholarship. With his technical expertise and venture capital experience, Jalen is positioned at the intersection of technology and investment, helping to identify and support the next generation of innovative startups."
}