{
    "id": "janos-meny-b70761188",
    "name": "Janos Meny",
    "profile_pic": "https://media.licdn.com/dms/image/v2/C4D03AQECN9k-RzOulA/profile-displayphoto-shrink_200_200/profile-displayphoto-shrink_200_200/0/1640445228463?e=2147483647&v=beta&t=HxTkyRCCBK1zWvUouYL3FH-Umdl1OoREvmLzItj7FR8",
    "links": [
        "https://www.linkedin.com/company/roblox",
        "https://de.linkedin.com/school/rheinische-friedrich-wilhelms-universit%C3%A4t-bonn/",
        "https://github.com/janos95",
        "https://twitter.com/MenyJanos",
        "mailto:janos.meny@googlemail.com",
        "https://ntop.com"
    ],
    "short_description": "Janos Meny is a mathematician turned programmer specializing in geometry processing, optimization, and computer graphics. Currently working at Roblox on realtime solid modeling tools, he previously developed implicit modeling solutions at nTop for 3D printing applications.",
    "long_description": "Janos Meny is a mathematician who transitioned into programming, with expertise in geometry processing, optimization, and computer graphics. He completed his education at the University of Bonn, where he studied mathematics with a focus on algebraic geometry during his bachelor's degree and PDE-constrained optimization for his master's.\n\nCurrently, Janos works at Roblox where he develops realtime, fully networked solid modeling tools and geometry processing algorithms. Prior to joining Roblox, he was employed at nTop, where he worked on implicit modeling and latticing tools specifically designed for high-performance 3D printing applications.\n\nHis professional interests span multiple technical domains including computational geometry, computer graphics, numerical optimization, robotics, compilers, programming languages, and applied mathematics. This multidisciplinary approach is evident in his project portfolio, which includes:\n\n- Mantis: A high-performance, SIMD-accelerated implementation for computing distance to triangle mesh\n- Phasefield: A phasefield-based optimization framework for 3D surface segmentation\n\nJanos's background in computational fluid dynamics (CFD) and his engagement with GPU-native technologies demonstrates his expertise in high-performance computing applications. His consistent interest in additive manufacturing and 3D printing technologies is reflected in his professional work at nTop, where he developed solutions for advanced manufacturing processes.\n\nHis unique combination of mathematical theory and practical programming skills positions him at the intersection of theoretical computer science and applied engineering, allowing him to contribute to cutting-edge developments in real-time geometry processing and modeling tools."
}