{
    "id": "jeremyzhang1",
    "name": "Jeremy Zhang",
    "profile_pic": "https://static.licdn.com/aero-v1/sc/h/9c8pery4andzj6ohjkjp54ma2",
    "links": [
        "https://www.linkedin.com/in/jeremyzhang1",
        "https://www.forbes.com/profile/jeremy-zhang",
        "https://tryfinch.com"
    ],
    "short_description": "Jeremy Zhang is a professional at Ramp, a student at Harvard University, and a talented tennis player at the University of Illinois. He is also the co-founder of Finch, a startup connecting payroll, HR, and benefits systems that has raised $19 million in funding.",
    "long_description": "Jeremy Zhang currently works at Ramp, a fintech company known for its corporate card and expense management platform that helps businesses save time and money. Simultaneously, he is pursuing his education at Harvard University, one of the world's most prestigious academic institutions.\n\nIn addition to his professional and academic pursuits, Jeremy is an accomplished tennis player for the University of Illinois men's tennis team. As a sophomore in the 2024-25 season, he has compiled an impressive record of 25-21 in singles and 13-8 in doubles play. During his freshman year, he was named an ITA Scholar Athlete and went unbeaten in his final six matches of the season. Before college, Jeremy was ranked as the No. 1 Australian player in the Class of 2005 with a career-high ITF ranking of 104. He competed in the 2023 Junior Australian Open, reaching the Round of 16 in doubles.\n\nJeremy is also an accomplished entrepreneur, having co-founded Finch in 2020. The startup builds tools that connect payroll, HR, and benefits systems together, and has raised $19 million from investors including Menlo Ventures and Y Combinator. Finch serves hundreds of customers including Carta and Betterment. His entrepreneurial achievements earned him a place on the Forbes 30 Under 30 list for Enterprise Technology in 2023.\n\nPrior to founding Finch, Jeremy worked on robotics at Amazon and helped build Smartcar's software for automobiles. He holds a Bachelor's degree from Duke University.\n\nBorn on July 12, 2005, Jeremy stands 5'9\" and has built a substantial professional network with over 1,000 followers and 500+ connections on LinkedIn, demonstrating his ability to connect with professionals across various tech hubs including New York, San Francisco, and Boston."
}