{
    "id": "joe-li-08791120b",
    "name": "Joe Qiaoyun Li",
    "profile_pic": "https://media.licdn.com/dms/image/v2/D5603AQHbp8Q0BPPi-w/profile-displayphoto-shrink_200_200/profile-displayphoto-shrink_200_200/0/1720486204712?e=2147483647&v=beta&t=1nM4Zgb-Z7EyvE-vmUYhTyKK1ERqzdFRH69Je0GLfgQ",
    "links": [
        "https://ai.jmir.org/2024/1/e52171",
        "https://ieeexplore.ieee.org/document/10509194",
        "https://ieeexplore.ieee.org/document/10509142",
        "https://ieeexplore.ieee.org/abstract/document/10460202",
        "https://profiles.stanford.edu/joe-li"
    ],
    "short_description": "CS and EE student at Stanford University with a diverse research background spanning machine learning, power electronics, and biosignal processing. Currently a Machine Learning Researcher at Nous Research focusing on pre-training LLMs and reinforcement learning for reasoning models. Former USA IOI Training Camp participant with experience in compiler development at Moffett.AI.",
    "long_description": "Joe Qiaoyun Li is a Computer Science and Electrical Engineering student at Stanford University with an impressive research portfolio across multiple technical domains. Currently working as a Machine Learning Researcher at Nous Research, he focuses on pre-training large language models and developing reinforcement learning techniques for reasoning models.\n\nJoe's research experience is remarkably diverse for his age. At the Hawaii Digital Health Lab, he conducted groundbreaking work on biosignal-based emotion recognition using AI, resulting in a first-authored publication in JMIR AI. His research at Princeton Power Electronics Lab led to multiple publications in IEEE journals and conferences, including innovative work on magnetic core loss modeling using neural networks and multi-material power magnetics modeling with machine learning frameworks.\n\nHis technical versatility extends to his work as an ML Compiler at Moffett.AI, where he gained practical experience in compiler development. Earlier in his academic journey, Joe contributed to computer vision and autonomous planning research at Carnegie Mellon University's Search-based Planning Lab.\n\nBeyond his research accomplishments, Joe has demonstrated leadership as Co-President of TeamsCode and as Founder and President of ParagonX Academy. His academic excellence is highlighted by his selection as valedictorian at The Harker School, where he completed advanced coursework in mathematics, physics, and computer science.\n\nJoe's competitive achievements are equally impressive, having been selected for the USA IOI Training Camp as one of the top 25 students nationwide, earning a USA Physics Olympiad Gold Medal (top 40 nationally), and qualifying for the American Invitational Mathematics Examination (AIME) five times.\n\nHis publication record includes four peer-reviewed papers across different domains, showcasing his ability to apply machine learning techniques to solve complex problems in fields ranging from healthcare to power electronics. His first-authored paper in JMIR AI compared personalized and generalized approaches to emotion recognition using consumer wearable devices, while his IEEE publications focus on power magnetics modeling and characterization using advanced machine learning frameworks.\n\nAccording to Google Scholar, Joe's research has already garnered 22 citations, with his JMIR AI paper on emotion recognition receiving 14 citations and his work on DC-bias injection methods for power magnetics characterization receiving 7 citations. This early citation record demonstrates the impact and relevance of his research contributions.\n\nJoe also offers mentorship services to high school students, providing guidance on olympiad preparation, research opportunities, and college applications, drawing from his own experiences as a successful applicant to top universities like Stanford and MIT."
}