{
    "id": "joelgrayson",
    "name": "Joel Grayson",
    "profile_pic": "https://media.licdn.com/dms/image/v2/D4E03AQEK9VzNXESleg/profile-displayphoto-shrink_200_200/profile-displayphoto-shrink_200_200/0/1698342347676?e=2147483647&v=beta&t=8KMIieg5JmLvcQ8YIMYIaIm7Ityz7KcNk31XgCtFZvM",
    "contacts": [
        "joelgrayson.com"
    ],
    "links": [
        "https://joelgrayson.com"
    ],
    "short_description": "Joel Grayson is a student at Stanford University with a passion for software development, engineering, and climate solutions. He has created multiple successful applications including Buseroo.com, Homework Checker, and Focus for Google Docs, while also working on physical projects like a vending machine and solar installations.",
    "long_description": "Joel Grayson is a student at Stanford University (2024-2028) who previously attended Riverdale Country School (2017-2024) and earned a Professional Certificate in Quantum Computing from MIT xPRO in 2023.\n\nJoel is passionate about creating software, machines, and climate solutions. His software portfolio includes several successful projects: Buseroo.com (helps students find school bus routes), Homework Checker (used by 2,000 students), Focus for Google Docs (helps 1,000 people write without distractions), Edit Time (used by 4,000 people to manage file properties), and LirongArt.com (showcases his mother's artwork).\n\nHis engineering projects include building a vending machine for his school, a Jacob's ladder alarm clock, a wooden pinball machine, and a slayer exciter. Joel is also deeply committed to environmental causes, having helped implement a solar installation at Riverdale Country School that reduces emissions by 250 metric tons of CO₂ equivalent annually. He founded Students for Electric Buses to transition his school's bus provider to electric vehicles.\n\nJoel's professional experience includes serving as a Board Member for Manhattan Community Board 1 (May 2023-May 2024), where he was involved with the Environmental Protection Committee and Youth & Education Committee. He conducted research on organic solar cells at NYU's Lee Lab (July-August 2023) and interned at The Stone House Group (June 2023). He has also worked with the Mayor's Office of Climate and Environmental Justice and the Street Vendor Project to connect street vendors to the electrical grid instead of using gas generators.\n\nWith 260 followers and 259 connections on LinkedIn, Joel continues to develop innovative solutions at the intersection of technology and sustainability."
}