{
    "id": "joshua-vallabhaneni",
    "name": "Joshua Vallabhaneni",
    "profile_pic": "https://media.licdn.com/dms/image/v2/D4E03AQEa2ivLYbA_5A/profile-displayphoto-shrink_200_200/profile-displayphoto-shrink_200_200/0/1687056822895?e=2147483647&v=beta&t=Le_sGLeqxjmHLXMBhfqKj7Ws7JYjUd5-8ZNpLfcQDUA",
    "links": [
        "https://github.com/Joshua-Vallabhaneni",
        "https://joshua-vallabhaneni.github.io/my-portfolio/",
        "https://www.linkedin.com/in/joshua-vallabhaneni",
        "https://devpost.com/software/azalea"
    ],
    "short_description": "Computer Science student at University of Maryland and UMD Honors College with a focus on AI-enabled security solutions. Currently working as a Junior Software Engineer at AstraZeneca while developing innovative technologies for school safety through xFoundry@UMD and creating award-winning projects in AI and sustainability.",
    "long_description": "Joshua Vallabhaneni is a Computer Science student at the University of Maryland and part of the UMD Honors College, who balances full-time studies with professional software engineering work. He currently serves as a Junior Software Engineer at AstraZeneca's health-tech subsidiary Evinova, where he works 40 hours per week while maintaining his academic commitments.\n\nJoshua has demonstrated exceptional talent in technology innovation focused on safety and security applications. As a Product Innovation Engineer at xFoundry@UMD, he was selected as one of only 30 students for their inaugural cohort, where he's developing an AI-enabled detection, tracking, and notification system for identifying active shooter events in educational settings in real-time. This venture is backed by significant funding ranging from $250K to $2M.\n\nHis experience extends to human-computer interaction, where he worked as an intern at The Center for Applied Technologies for School Security, conducting user testing to enhance the OWL app's usability and applying UX design heuristics to support safer learning environments. Joshua also has experience in 3D animation and interactive media development from his three-year tenure at Siepser Eyecare.\n\nJoshua's technical background includes software engineering internships at PayPal (upcoming), AstraZeneca, and Proxzar, showcasing his versatility across different technology domains. His academic journey includes studies at the University of Maryland, a period at Imperial College London where he focused on Mathematics for Machine Learning, and a high school diploma from Unionville High School in Kennett Square, Pennsylvania.\n\nHe has an impressive record of achievements, including first place at the AI for Change Hackathon among 493 participants, first place at JPMorgan Chase's Code For Good Hackathon (selected from 15,000 applicants), and multiple awards at PennApps XXV Hackathon for his work on gesture-driven facial authentication for anti-spoofing and AI deepfake detection. Joshua also received the President's Scholarship from the University of Maryland for his academic and extracurricular excellence.\n\nHis portfolio of innovative projects continues to grow, with recent developments including Azalea (an eco-friendly AI model selector that optimizes environmental impact), FireSync (an AI-driven disaster relief coordination system), CypressMFA (gesture-driven facial authentication for anti-spoofing), and SaveAPlate (a predictive modeling system to reduce food waste in dining halls).\n\nJoshua's passion for innovation began at an early age. While still in high school, he invented the \"Baby Saver\" - a hot car alert device that sends automated alerts to parents and local authorities when the temperature inside a car crosses certain thresholds. This invention was inspired by his concern for child safety when his family was preparing for the birth of his younger brother. The device earned him first place in his grade category and the Safety Award at the 2020 Invention Convention Nationals, hosted by the Henry Ford Museum of American Innovation. His invention received national recognition for its potential to prevent tragic hot car deaths, which claim hundreds of children's lives annually. Joshua's early success with Baby Saver demonstrated his commitment to using technology to solve real-world problems and save lives."
}