{
    "id": "kailash-ranganathan-3bb3031b7",
    "name": "Kailash Ranganathan",
    "profile_pic": "https://static.licdn.com/aero-v1/sc/h/9c8pery4andzj6ohjkjp54ma2",
    "contacts": [
        "581 followers",
        "500+ connections"
    ],
    "links": [
        "https://www.linkedin.com/in/kailash-ranganathan-3bb3031b7"
    ],
    "short_description": "EECS student at UC Berkeley with research experience in ML systems, hardware acceleration, quantum computing, and reinforcement learning. Currently a GPU Architecture Intern at NVIDIA and undergraduate researcher at Berkeley Artificial Intelligence Research.",
    "long_description": "Kailash Ranganathan is an Electrical Engineering and Computer Science (EECS) student at UC Berkeley with a 4.0 GPA, expected to graduate in 2025. His interests span ML systems, hardware acceleration, statistical physics, quantum computing, and reinforcement learning.\n\nCurrently, Kailash serves as a GPU Architecture Intern at NVIDIA (since May 2024) and as an Undergraduate Researcher at Berkeley Artificial Intelligence Research (BAIR), focusing on generalizable methods in reinforcement learning at the RAIL lab. He's also an Undergraduate Researcher at UC Berkeley EECS, working on superconducting qubits, surface piezoelectricity, and microwave engineering at the Quantum Devices Group.\n\nHis previous experience includes a uModule Research Internship at Analog Devices, where he worked on increasing power efficiency for ML hardware accelerators, and research at Berkeley Lab on FPGA programming for laser cavity stabilization. He also worked as a Software Engineer at Beacon AI, focusing on aircraft performance modeling and route planning.\n\nKailash's academic background includes extensive coursework in computer science (CS61A/B/C, CS70, CS170, CS189, CS285), electrical engineering (EECS 16A/B, EECS126, EE143, EE198), physics (Physics 5A, 137A/B, 141A), and mathematics (Math 275 - quantum algorithms for scientific computing). Before Berkeley, he attended The Harker School (2018-2022) and participated in Stanford University's Reischauer Scholars Program (2021), where he wrote a final paper on the historiography of the rise of ultranationalism in pre-WW2 Japan.\n\nThroughout his academic journey, Kailash has demonstrated a commitment to both technical excellence and community service, having volunteered as a tutor with Peninsula Bridge and taught in a STEM program with YOKE Society in Tamil Nadu, India."
}