{
    "id": "kcui5",
    "name": "Kyle Cui",
    "profile_pic": "https://media.licdn.com/dms/image/v2/D4E03AQGytKzOEG_6dA/profile-displayphoto-shrink_200_200/profile-displayphoto-shrink_200_200/0/1718228863156?e=2147483647&v=beta&t=T0dxmH8eAXRVfUcarGQfXPiHskeY3d32_tQMZxibCaQ",
    "contacts": [
        "www.ctrlsheet.ai"
    ],
    "links": [
        "https://www.linkedin.com/in/kcui5"
    ],
    "short_description": "Kyle Cui is the Co-Founder & CEO of CTRL Sheet, a startup backed by Antler VC. He graduated from UC Berkeley with degrees in Computer Science (Honors) and Physics, and has experience in software engineering, research, and venture capital.",
    "long_description": "Kyle Cui is the Co-Founder and CEO of CTRL Sheet, an AI agent for spreadsheets that helps users build models and gather data from the internet. His startup is backed by Antler VC's F24 cohort. \n\nKyle graduated from the University of California, Berkeley with a Bachelor of Arts in Computer Science (Honors) and Physics, maintaining a 3.8/4.0 GPA. During his academic career, he also studied abroad at Uppsala University in Sweden through UCEAP.\n\nHis professional experience spans multiple domains. As a Software Engineer Intern at Metaphor3D, he deployed TypeScript applications with Azure, designed user data pipelines in Python, and optimized data processing with Rust. He also served as a Venture Capital Analyst at Steel Perlot.\n\nKyle has extensive research experience, working as a Student Researcher at the FHL Vive Center for Enhanced Reality where he designed algorithms for obstacle avoidance path planning, and as an Artificial Intelligence Virtual Reality Research Intern at UC Berkeley EECS where he developed adversarial AI agents in simulated scenarios. He also worked as a Research Assistant at The City University of New York, creating an Android app to assist the visually impaired.\n\nIn leadership roles, Kyle served as Executive Vice President at Extended Reality at Berkeley, managing club resources, partnerships, and events for over 50 members. He also worked as Course Staff for Discrete Math and Probability (CS70) and Structure and Interpretation of Computer Programs (CS61A) at UC Berkeley.\n\nKyle is multilingual, with native or bilingual proficiency in English and Chinese, and limited working proficiency in French and Spanish. He holds an Autodesk AutoCAD User Certification and has completed numerous courses in physics, computer science, and mathematics during his time at Berkeley."
}