{
    "id": "kcui5",
    "name": "Kyle Cui",
    "profile_pic": "https://media.licdn.com/dms/image/v2/D4E03AQGytKzOEG_6dA/profile-displayphoto-shrink_200_200/profile-displayphoto-shrink_200_200/0/1718228863156?e=2147483647&v=beta&t=T0dxmH8eAXRVfUcarGQfXPiHskeY3d32_tQMZxibCaQ",
    "links": [
        "https://www.ctrlsheet.ai"
    ],
    "short_description": "Kyle Cui is the Co-Founder & CEO of CTRL Sheet, a recent graduate from UC Berkeley with degrees in Computer Science (Honors) and Physics. His background spans virtual reality research, AI development, and entrepreneurship, with experience in both academic and industry settings.",
    "long_description": "Kyle Cui is an emerging tech entrepreneur who recently graduated from UC Berkeley with a dual degree in Computer Science (Honors) and Physics. He is currently the Co-Founder and CEO of CTRL Sheet, an AI agent for spreadsheets that helps users build models and gather data from the internet.\n\nKyle's technical expertise is particularly strong in the intersection of AI and virtual reality. During his time at Berkeley, he conducted significant research in this field, working with the ScenicVR Research Group under Professor Sanjit Seshia where he developed adversarial AI agents in simulated scenarios to boost rapid skill acquisition in VR environments. His research contributions are documented in academic publications, including \"A Principled Intelligent Occupational Training of Psychomotor Skills in Virtual Reality\" (2023) and \"Task Distribution Aware Psychomotor Skill Training with Probabilistic Programs and Bayesian Knowledge Tracing in Virtual Reality\" (2024), where he worked alongside researchers like Edward Kim, Zachary Pardos, and Björn Hartmann.\n\nIn these research projects, Kyle helped develop innovative approaches to VR training, including the use of Bayesian knowledge tracing (BKT) to predict psychomotor skill mastery, which proved more effective than traditional self-assessment methods. His work demonstrated how probabilistic programming and machine learning techniques could create more effective VR training systems with consistent learning outcomes.\n\nHis leadership experience includes serving as Executive Vice President at Extended Reality at Berkeley, where he led internal and external functions for over 50 club members, managing resources, partnerships, and events. Kyle also has teaching experience, having worked as Course Staff for Discrete Math and Probability (CS70) and Structure and Interpretation of Computer Programs (CS61A) at UC Berkeley.\n\nKyle's industry experience includes a Software Engineering internship at Metaphor3D, where he deployed TypeScript applications with Azure for cloud API endpoints, designed user data pipelines in Python, and optimized data processing with Rust. He also gained venture capital experience as an analyst at Steel Perlot.\n\nMultilingual and globally-minded, Kyle is fluent in English and Chinese, with working proficiency in French and Spanish. He also spent time studying abroad at Uppsala University in Sweden. His diverse skill set spans programming languages (including TypeScript, Python, Rust, and C#), AI/ML development, VR/AR technologies, and entrepreneurship, making him a versatile technologist at the forefront of emerging tech."
}