{
    "id": "krish-p",
    "name": "Krish Parikh",
    "profile_pic": "https://media.licdn.com/dms/image/v2/D5603AQFeVATp-0bVvA/profile-displayphoto-shrink_200_200/profile-displayphoto-shrink_200_200/0/1689658372784?e=2147483647&v=beta&t=sawnvNSBwlmY2EU000lh86Z0_gPRcLTApnSTVeaQGLQ",
    "links": [
        "https://www.linkedin.com/in/krish-p"
    ],
    "short_description": "Krish Parikh is a researcher at Stanford Artificial Intelligence Laboratory (SAIL) and a student at Stanford University. He recently led the first all-freshmen team to win first place at TreeHacks among 1,124 competitors, demonstrating exceptional talent in AI development early in his academic career.",
    "long_description": "Krish Parikh is an emerging talent in the field of artificial intelligence, currently affiliated with the Stanford Artificial Intelligence Laboratory (SAIL) and studying at Stanford University. Despite being early in his academic journey, Krish has already demonstrated remarkable achievement by leading the first all-freshmen team in TreeHacks history to win first place among 1,124 competitors in February 2024. His team also won the Reazon Holdings award, earning round-trip tickets to Tokyo.\n\nPrior to Stanford, Krish's academic excellence was recognized with several prestigious awards, including the Lam Research Scholarship ($10,000) awarded to only 11 students from 5,250 graduating seniors, and the National Merit Scholarship as a finalist in the 99th percentile of 1.5 million PSAT examinees.\n\nBeyond his academic pursuits, Krish has shown commitment to community service, working as a Computer Science Teacher for SEWA International USA from May 2020 to June 2023. His dedication to volunteering was acknowledged with the President's Volunteer Service Award from AmeriCorps in November 2021 for completing over 100 volunteer hours.\n\nKrish's early success in competitive AI hackathons, combined with his research position at one of the world's leading AI laboratories, positions him as a promising contributor to the field of artificial intelligence with a demonstrated ability to lead and innovate."
}