{
    "id": "leonhardn",
    "name": "Leo Nagel",
    "profile_pic": "https://static.licdn.com/aero-v1/sc/h/9c8pery4andzj6ohjkjp54ma2",
    "links": [
        "https://www.linkedin.com/in/leonhardn/",
        "https://github.com/leonagel",
        "https://x.com/leo_nagel_",
        "https://lnagel.net"
    ],
    "short_description": "Electrical Engineering & Computer Science student at UC Berkeley with expertise in GPU optimization, quantitative finance, and physics. Former Chief Executive at Global Society of Young Physicists and published researcher with a focus on computational efficiency and mathematical modeling.",
    "long_description": "Leo Nagel is an Electrical Engineering & Computer Science student at UC Berkeley who combines technical expertise with leadership experience to drive technological innovation. His academic focus spans GPU kernel optimization, quantitative finance, computing theory, mathematics, and physics.\n\nCurrently, Leo is deeply involved in several cutting-edge projects that showcase his technical abilities. He collaborated with Bradley Hsu to develop cuBogo, the fastest bogosort implementation ever run on a single device, optimizing custom CUDA (C++) kernels for the Nvidia H100. He's also working on cuDream, rewriting DreamCoder to leverage GPU optimizations, and cuPrimes, a custom kernel implementing the Fermat test of pseudo-primality using the Schönhage-Strassen algorithm and optimized Fast Fourier Transform with Nvidia H100 tensor cores.\n\nLeo's leadership capabilities are evident through his role as Chief Executive at the Global Society of Young Physicists (2022-2024), where he founded a physics nonprofit that organizes summer programs and publishes a journal. Prior to this, he served as a Curriculum Developer at Mad for Stem, creating interdisciplinary courses spanning economics, computer science, data science, and technology.\n\nHis academic achievements include placing first out of 130+ participants in the Berkeley Trading Invitational 2024, demonstrating his aptitude for quantitative finance. Leo has also published research, including a paper on \"Derivation of a Function for Velocity for Falling Objects with Non-Negligible Air Resistance,\" showcasing his mathematical modeling skills.\n\nLeo's educational background includes studies at UC Berkeley, a visiting undergraduate experience at The University of Hong Kong, and participation in specialized programs like the Quantum Cryptography School for Young Students at the University of Waterloo. He graduated from Dulwich College Shanghai Pudong with an International Baccalaureate score of 44/45.\n\nWith a multicultural background having lived in Germany (8 years), China (10 years), and the United States (2 years), Leo brings a global perspective to his work. He is multilingual, with native proficiency in English and German, and elementary proficiency in Chinese and Latin. Beyond academics, he enjoys chess and hiking in the Berkeley Hills, particularly at night.\n\nLeo's unique combination of technical expertise in GPU optimization, research experience, leadership skills, and interdisciplinary knowledge positions him as a promising innovator in the fields of computer science and electrical engineering."
}