{
    "id": "liu-rex",
    "name": "Rex Liu",
    "profile_pic": "https://media.licdn.com/dms/image/v2/D5603AQH9tNVsutSsQQ/profile-displayphoto-shrink_200_200/B56ZQ9ykNbHoAc-/0/1736203453942?e=2147483647&v=beta&t=Cva0tQQXIl6oIVERuZTpFEtol4Av2Wx3fHSOX1OZrXE",
    "links": [
        "https://github.com/rexpository",
        "https://www.researchgate.net/profile/Rex-Liu",
        "https://scholar.google.com/citations?user=RiDRCtIAAAAJ"
    ],
    "short_description": "Undergraduate at Caltech pursuing Computer Science and Biology with a focus on Bio-inspired AI and Drug Discovery. Research Fellow at Thomson Lab developing innovative AI systems including thalamus-inspired LLM routers and GNN-based spatial proteomics. Currently interning at NASA JPL for the Lunar Trailblazer Spacecraft mission and competing on Caltech's Water Polo team.",
    "long_description": "Rex Liu is an undergraduate student at Caltech studying Computer Science and Biology, with a particular focus on the intersection of these fields through Bio-inspired AI and Drug Discovery. As a Research Fellow at Caltech's Thomson Lab, Rex has developed several cutting-edge AI systems that demonstrate his innovative approach to machine learning.\n\nHis research portfolio includes a Thalamus-inspired LLM Router called \"Herd\" that creates scalable ensembles of small, open-source language models capable of outperforming larger proprietary models through Q-learning-based dynamic model selection. This work was presented at the NeurIPS Efficient Natural Language and Speech Processing Workshop. He's also worked on Hierarchical Chains with Multi-Level Abstention (HCMA), optimizing Black-box API deployments with uncertainty-based delegation and improved risk control, and published a paper on \"Cost-Saving LLM Cascades with Early Abstention.\"\n\nIn the biomedical space, Rex has applied Graph Neural Networks to spatial proteomics, using counterfactual learning to identify tumor perturbations that enhance T-cell infiltration, with validated combinatorial therapies in collaboration with Cedars-Sinai. He's also worked on \"Building Foundation Models to Characterize Cellular Interactions via Geometric Self-Supervised Learning on Spatial Genomics.\"\n\nHis most significant research contribution is on Functionally Invariant Path (FIP), a differential geometry-based framework that allows neural networks to adapt to secondary tasks without catastrophic forgetting. This groundbreaking work was published in Nature Machine Intelligence in 2024 and has already been cited by other researchers in the field. The FIP algorithm has wide-ranging applications from improving recommendations on online stores to fine-tuning self-driving cars.\n\nCurrently, Rex is interning at NASA's Jet Propulsion Laboratory, writing software for the Lunar Trailblazer Spacecraft as part of the Mission Operations and Ground Data Systems team. He is also a member of Caltech's Men's Water Polo team, competing as an Attacker.\n\nPrior to Caltech, Rex worked as a research assistant at National Taiwan University's Systems Biology Epithelia Lab, where he designed a lethal Zika virus-driven plasmid for transgenic mosquitoes, expressing a hybrid neurotoxin upon Zika infection. He also integrated a protein BLAST search engine to identify sequence alignments in the lab's online databases.\n\nBeyond his academic pursuits, Rex has extensive experience in cybersecurity, having worked as a Security Researcher at HackerOne and a Bug Bounty Hunter at Bugcrowd for over five years. He has also served as a Teaching Assistant at Taipei American School, instructing students in Mechanical Engineering (CAD, CNC, water jet cutting, TIG welding) and Modern Topics in Computer Science (logic gates, quantum mechanics, deep learning).\n\nRex's multidisciplinary background, spanning AI, biology, cybersecurity, and aerospace, positions him uniquely at the intersection of these rapidly evolving fields. He is fluent in Chinese and English, with working proficiency in Spanish and Japanese, further enhancing his ability to collaborate in global research environments. Outside of his academic and research work, Rex plays the violin and guitar."
}