{
    "id": "lockecai",
    "name": "Locke Cai",
    "profile_pic": "https://media.licdn.com/dms/image/v2/D4E03AQEbfLifK1nnwg/profile-displayphoto-shrink_200_200/profile-displayphoto-shrink_200_200/0/1698543672573?e=2147483647&v=beta&t=VPQ-gR50V2tJVlHg5IoZ_usA-WhEFFjKROc1Z-dFMig",
    "contacts": [
        "589 followers",
        "500+ connections"
    ],
    "links": [
        "https://www.linkedin.com/in/lockecai/",
        "https://arxiv.org/abs/2410.08394"
    ],
    "short_description": "CS & Math student at MIT with expertise in competitive programming and mathematics. Currently an Undergraduate Researcher at MIT focusing on Reinforcement Learning and Graph Neural Networks, and an incoming ML Research Intern at Together.AI. Former USACO Finalist and Mathematical Olympiad Program participant.",
    "long_description": "Locke Cai is a Computer Science and Mathematics student at MIT (2023-2026) with exceptional technical skills and research experience. He is currently an Undergraduate Researcher at MIT, where he leads research on Reinforcement Learning methods to transform Large Language Models into powerful sequential decision makers for complex reasoning tasks. He is also developing scalable RL algorithms to train specialized LLM agents for end-to-end software development.\n\nPreviously, Locke researched Graph Neural Networks (GNNs) at MIT, focusing on their capabilities for subgraph-level tasks and developing novel pre-training and transfer learning frameworks. He also worked as a Research Engineering Intern at Anysphere, where he designed and built a production-ready context retrieval system for LLM prompt generation that significantly enhanced code-generation capabilities.\n\nBefore MIT, Locke was a Research Analyst at Stony Brook University, where he redesigned and optimized Argus, an end-to-end framework that accelerates Convolutional Neural Networks on specialized hardware (FPGAs). His work on creating efficient circuit designs for neural networks deployed in the ATLAS particle detector is expected to be published in ICS 2024.\n\nLocke has an impressive competitive background, being a 2-time USA Computing Olympiad (USACO) Finalist (top 26 competitors nationally) in 2021 and 2022, and a participant in the Mathematical Olympiad Program (MOP) Blue Group in 2022 (top ~30 USA Math Olympiad competitors). He is also a Codeforces Grandmaster, ranking in the top 0.8% of over 100,000 active participants.\n\nHis academic journey includes MIT (2023-2026), with prior dual enrollment at Princeton University (2022-2023) where he maintained a 4.0 GPA, and West Windsor-Plainsboro High School South (2019-2023) where he achieved a perfect 4.0 unweighted GPA.\n\nLocke has published research on \"Identifying Money Laundering Subgraphs on the Blockchain\" at the International Conference on AI in Finance (ICAIF) 2024, demonstrating his ability to apply advanced computational techniques to real-world problems."
}