{
    "id": "luke-tchang",
    "name": "Luke Tchang",
    "profile_pic": "https://media.licdn.com/dms/image/v2/D5603AQHXXeSA4vmEEQ/profile-displayphoto-shrink_200_200/profile-displayphoto-shrink_200_200/0/1689993405705?e=2147483647&v=beta&t=zwwydkgDzd5GTNASGubjM1Nh51gEmu1VsfSCgQyJwLk",
    "contacts": [
        "1K followers",
        "500+ connections"
    ],
    "links": [
        "https://github.com/luketchang",
        "https://www.linkedin.com/company/nocturne-labs?trk=public_profile_topcard-current-company",
        "https://www.linkedin.com/school/stanford-university/?trk=public_profile_topcard-school"
    ],
    "short_description": "Luke Tchang is a professional associated with Nocturne Labs and Stanford University. He is a Neo Scholar with a strong interest in technology and software development, as evidenced by his GitHub presence and engagement with tech-related content on LinkedIn.",
    "long_description": "Luke Tchang is a technology professional currently affiliated with Nocturne Labs and has an educational background from Stanford University. His professional interests appear to be in software development and technology, as indicated by his GitHub profile (luketchang) and his LinkedIn activity. \n\nLuke has been recognized as a Neo Scholar, suggesting involvement in the Neo program which supports promising technologists and entrepreneurs. With over 1,000 followers and 500+ connections on LinkedIn, he has built a substantial professional network.\n\nHis LinkedIn activity shows engagement with content related to AI agents, startups, tech entrepreneurship, and software development. He frequently interacts with posts about company building, technological innovations, and professional growth in the tech industry. This suggests he stays current with emerging trends in technology, particularly in AI and startup ecosystems.\n\nWhile specific details about his role at Nocturne Labs or his educational focus at Stanford are not explicitly stated in the available information, his digital footprint indicates a professional with interests in cutting-edge technology and entrepreneurship."
}