{
    "id": "lunw1024",
    "name": "Alan Wu",
    "profile_pic": "https://media.licdn.com/dms/image/v2/D5603AQHF7vsjTn0g_g/profile-displayphoto-shrink_200_200/profile-displayphoto-shrink_200_200/0/1679813392061?e=2147483647&v=beta&t=Bt1gHG0OXieaUuMCpdwfiPBbxHkIvJlyAYqGF2Esdto",
    "links": [
        "https://alanwu.xyz",
        "https://www.linkedin.com/in/lunw1024/",
        "https://orcid.org/0009-0006-2454-4354"
    ],
    "short_description": "Alan Wu is a Caltech student and accomplished competitive programmer with a passion for AI research, particularly in large language models and autonomous driving. He has won multiple prestigious competitions including the Citadel Data Open Global Championship and has published research on LLM linearization and 3D semantic segmentation.",
    "long_description": "Alan Wu is a junior studying Computer Science at Caltech, having transferred from Harvey Mudd College where he studied Computer Science and Mathematics from 2021 to 2023. His academic interests span across programming, mathematics, and artificial intelligence, with a particular focus on large language models and computer vision for autonomous driving.\n\nAlan's research contributions include work on \"LoLCATs: On Low-Rank Linearizing of Large Language Models\" (ICLR 2025), which proposes a novel two-step approach to linearize LLMs while maintaining model quality, and \"DenseFuseNet: Improve 3D Semantic Segmentation in the Context of Autonomous Driving with Dense Correspondence\" (IEEE), which explores multi-modal perception systems for autonomous vehicles. His high school research on 3D semantic segmentation earned him the Bronze Prize (3rd place) in the prestigious S.-T Yau High School Science Award, competing against over 1000 global research projects.\n\nCurrently, Alan works with RSRG@Caltech on distributional robust reinforcement learning and uncertainty quantification. He has also conducted research on theoretical ML with Prof. George Montanez at the AMISTAD Lab, resulting in a paper published in ICAART 2024 titled \"From Targets to Rewards: Continuous Target Sets in the Algorithmic Search Framework.\"\n\nHis competitive achievements are remarkable, having won first place in the Citadel Data Open Global Championship ($100,000 prize), first place in the Data Open 2021 West Coast ($10,000 prize), and the IMC Prosperity 2 trading challenge ($25,000 prize) with his team. He also placed 4th in the Terminal Global Championship 2022 and was among the top performers in the Berkeley Trading Competition.\n\nAlan's professional experience includes internships at Jump Trading as a research intern (Summer 2024), Jane Street as a trading intern (Summer 2023), and Crabel Capital Management (part-time). He is also the founder and leader of the Caltech Quant Finance Club.\n\nIn 2021, Alan was selected for the prestigious NSF Graduate Research Fellowship, recognizing his potential to advance knowledge and benefit society. He describes himself as someone who \"loves to meet and compete with the brightest minds,\" reflecting his passion for intellectual challenges and collaborative innovation.\n\nIn his free time, Alan enjoys playing badminton and table tennis, balancing his intense academic and professional pursuits with recreational activities."
}