{
    "id": "ma06nicole",
    "name": "Nicole Ma",
    "profile_pic": "https://media.licdn.com/dms/image/v2/D5603AQERna6N0lKvzw/profile-displayphoto-shrink_200_200/profile-displayphoto-shrink_200_200/0/1705121223153?e=2147483647&v=beta&t=UfOGPL27vgJxlLYQ6R40uwn14_zJP357em02loWVLl8",
    "links": [
        "mailto:manicole@stanford.edu"
    ],
    "short_description": "Nicole Ma is a Computer Science and Mathematics student at Stanford University with a strong background in climate science research. She has published work on global surface temperature projections and has experience at NASA's Jet Propulsion Laboratory, where she developed machine learning models for offshore wind resource assessment and forecasting.",
    "long_description": "Nicole Ma is pursuing a Bachelor of Science in Computer Science and Mathematics at Stanford University (2024-2028). Her research interests span climate science, machine learning, and environmental engineering, with a particular focus on applying computational methods to address climate challenges.\n\nNicole has built an impressive research portfolio at a young age. As a Research Fellow at the Simons Summer Research Program at Stony Brook University, she has been working on novel stochastic process models to simulate the latitude of the North Atlantic Jet Stream. Previously, she interned at NASA's Jet Propulsion Laboratory for over two years, where she developed machine learning models to improve offshore wind resource assessment and forecasting.\n\nHer research has already gained recognition in the scientific community. She published a paper titled \"21st Century Global and Regional Surface Temperature Projections\" in Earth and Space Science, analyzing observed global surface temperature trends across different latitudinal regions. This work earned her the 2023 CESASC JHJ Prize for Fundamental Science in Physics, an award given to researchers under 26 who have published lead-authored papers in reputable international journals.\n\nNicole is also passionate about climate justice, serving as President of the Climate Justice Global Alliance. Her commitment to environmental causes is further demonstrated by her numerous awards in science fairs, particularly in environmental engineering and energy conversion/alternate energy categories.\n\nBeyond her environmental work, Nicole has excelled in mathematics and programming competitions. She is a National Merit Scholarship Finalist, American Invitational Mathematics Examination (AIME) Qualifier, and has won multiple hackathons and programming competitions, including 1st Place at the 2022 igniteCS Programming Expo and 2021 GameGala.\n\nNicole is bilingual, with native proficiency in both English and Mandarin. She will be participating in Jane Street's WiSE Program in July 2024, further expanding her experience in quantitative fields.\n\nAt Stanford, Nicole is registered as an undergraduate student in the Vice Provost for Undergraduate Education department, where she continues to pursue her academic interests while contributing to the university community."
}