{
    "id": "mavli",
    "name": "Mav L.",
    "profile_pic": "https://static.licdn.com/aero-v1/sc/h/9c8pery4andzj6ohjkjp54ma2",
    "links": [
        "https://drive.google.com/file/d/1kZ9EVdByV6XFoW3pnsuL6krvgb5UkvIy/view?usp=sharing"
    ],
    "short_description": "Harvard applied mathematics student with a diverse background spanning quantitative trading, angel investing, and chess mastery. A former researcher in the Arctic and at Harvard's School of Engineering, Mav holds both Candidate Master and Women's Candidate Master titles in chess and represented the US in international chess competitions.",
    "long_description": "Mav L. is a multifaceted individual currently studying Applied Mathematics at Harvard University while actively exploring opportunities in the tech and finance sectors. Their professional journey showcases remarkable versatility, having worked as a Quantitative Trader at prestigious firms like Jane Street and BlackEdge Capital, and as a Crypto Trader at Galaxy.\n\nBeyond traditional finance, Mav has established themselves as an Angel Investor in multiple startups including Haize Labs, Etched, XOUL, and nosu, demonstrating a keen eye for emerging technologies and business opportunities. Their academic pursuits have included undergraduate research at Harvard's School of Engineering and Applied Sciences, as well as participating in a unique student researcher program in the Arctic through the School for International Training in Iceland.\n\nMav has also shown leadership capabilities as a Program Lead for the Harvard Undergraduate Clean Energy Group and as a Principal at Harvard Undergraduate Capital Partners, indicating their interest in sustainable energy and investment strategies.\n\nA distinguished chess player, Mav holds both Candidate Master (CM) and Women's Candidate Master (WCM) titles. Their chess achievements include representing the United States at the World Youth Chess Championships, securing 3rd place at the National Girls Tournament of Champions, and winning the Illinois State Female Chess Championship three times.\n\nAdditionally, Mav has excelled in academic competitions, particularly in Earth Science, qualifying for a Gold Medal Score at the International Earth Science Olympiad (IESO) in South Korea, placing among the top 30 students globally. They were also among the top 8 students in the US to qualify for the International Earth Science Olympiad and among the top 36 in the US Earth Science Olympiad.\n\nMav is multilingual, with native or bilingual proficiency in both Chinese and English, and limited working proficiency in Spanish. They currently volunteer as an Alumni Interviewer for Harvard University and as an Alumni National Science Bowl Volunteer for the U.S. Department of Energy, giving back to educational communities that helped shape their path.\n\nMav is also passionate about diversity in computer science and technology. As evidenced by their involvement with organizations like Girls Who Code and Game Development Club, they advocate for greater representation of women and underrepresented groups in STEM fields. Mav has demonstrated leadership in creating inclusive spaces for learning computer science and game development, helping to address the gender gap in these fields."
}