{
    "id": "max-forsey",
    "name": "Max Forsey",
    "profile_pic": "https://media.licdn.com/dms/image/v2/D5603AQEsCTiNeqL98g/profile-displayphoto-shrink_200_200/profile-displayphoto-shrink_200_200/0/1726669369902?e=2147483647&v=beta&t=tkVY-kKR17R5Onw-DHMS40tTzCnLNzql3vaWf9LfmlI",
    "links": [
        "https://www.linkedin.com/company/perception-control-and-cognition-lab",
        "https://www.linkedin.com/company/justbuild-ing",
        "https://www.maxforsey.com",
        "https://github.com/max4c",
        "https://arxiv.org/abs/2411.10397"
    ],
    "short_description": "Max Forsey is an AI researcher at the Perception Control and Cognition Lab at Brigham Young University who explores the fundamental nature of intelligence. As a co-founder of justbuild.ing and former Vice President of BYU's Artificial Intelligence Association, he actively organizes AI hackathons and community events while developing practical tools to advance the field.",
    "long_description": "Max Forsey is a dedicated AI researcher affiliated with the Perception Control and Cognition Lab at Brigham Young University, where he explores the fundamental nature of intelligence through artificial intelligence systems. His research has led to publications like \"Gradient Sparse Autoencoders,\" which introduces novel approaches to extracting neural network features.\n\nMax has taken on leadership roles in the AI community, serving as the Vice President of the BYU Artificial Intelligence Association, where he helped organize events and foster a community of AI enthusiasts. In November 2024, he co-founded \"justbuild.ing,\" an initiative focused on building a community of AI developers and hosting collaborative events.\n\nHe is particularly active in organizing and participating in AI hackathons, recently working with Sameday through the justbuild community to host a 2-hour AI hackathon featuring Cerebras Systems. His involvement in these rapid development events demonstrates his commitment to practical AI application and innovation.\n\nBeyond his research, Max is passionate about creating practical AI tools. He developed FreshSesh AI, a developer tool that uses local LLMs to provide personalized context summaries of previous work sessions, helping developers quickly get back into flow. He's also reimplemented Andrej Karpathy's nanoGPT, showing his hands-on approach to understanding AI systems.\n\nMax maintains a personal website where he shares detailed resources for those looking to bridge the gap between using AI APIs and actually training models. His curated learning path includes visual resources, essential reading, and practical project suggestions for newcomers to the field. He emphasizes starting with fundamentals and learning through implementation, reflecting his own approach to AI development.\n\nOutside of his professional interests, Max maintains a holistic approach to life, with detailed attention to health and longevity practices. He values deep friendships and community connections, having written thoughtfully about the nature of friendship and human connection. His background combines theoretical AI research with practical application, demonstrating a commitment to both advancing the field and making AI more accessible to others."
}