{
    "id": "mikael-haji",
    "name": "Mikael Haji",
    "profile_pic": "https://media.licdn.com/dms/image/v2/C4E03AQGk0A7GaQeQ5Q/profile-displayphoto-shrink_200_200/profile-displayphoto-shrink_200_200/0/1651066544962?e=2147483647&v=beta&t=yj-bKioCzwf048DTNb9iFp30XkjLp2qFvZhs9fSii3E",
    "links": [
        "https://mikaelhaji.com",
        "https://github.com/mikaelhaji",
        "https://x.com/mikaelhaji",
        "https://www.linkedin.com/in/mikael-haji-a324b41b4/",
        "https://mikaelhaji.medium.com/"
    ],
    "short_description": "A pioneering 19-year-old electrical engineering student at University of Waterloo who leads the Waterloo Hacker Fab building a 10µm open-source DIY chip fabrication facility for under $10K. With extensive experience in neurotech, Mikael has worked with Prophetic on ultrasound technology, contributed to neuromorphic chip design at University of Toronto, and was the youngest intern at Blackrock Neurotech.",
    "long_description": "Mikael Haji is an innovative 19-year-old electrical engineering student at the University of Waterloo and recipient of the prestigious $120K Schulich Leaders Scholarship. He currently leads the Waterloo Hacker Fab team, where he's building a 10µm open-source DIY chip fabrication facility in Waterloo with the ambitious goal of creating a process for under $10K that can produce approximately 1,000 transistors.\n\nHis GitHub profile reveals his deep involvement in brain-computer interface (BCI) technology, with multiple repositories focused on EEG applications, including projects for motor imagery systems, P300 spellers, emotion classification, and artifact detection algorithms. He's currently working on burning a GPT-2 layer on silicon and has previously designed a TPU-like systolic array and a neuromorphic chip for neural implants, with a pending IEEE ISSCC paper.\n\nHis professional journey showcases remarkable depth in cutting-edge technology fields. At Prophetic, Mikael built an entire transcranial focused ultrasound infrastructure, deploying advanced optimization techniques and accelerating transducer prototyping while creating an $80K hydrophone for under $2K. Prior to this, he worked at the University of Toronto on the digital back-end of a novel neuromorphic chip design, integrating spiking neural networks for advanced neural implants with the Intelligent Sensory Microsystems Lab.\n\nAt just 15, Mikael joined WATOLINK as a system integration engineer, helping build a mind-controlled speech interface using SSVEP with GPT-3 integration, which won first place in the Neurotech X student competition. His early accomplishments include being hired as the youngest intern at Blackrock Neurotech, where he engineered custom circuitry enclosures and fabricated high-precision electrode arrays.\n\nMikael's expertise has earned him recognition beyond academia. He was flown to Dubai for the Global Citizen Forum Conference to discuss his neurotech work and was selected as a Villars Fellow to participate in the inaugural Villars Symposium in Geneva. His entrepreneurial potential was further validated by a $250K matching trust fund from Patrick Poirier at Dragon's Vault to fuel his work in the neurotech space.\n\nHis technical innovation began early, with the development of a novel Thermoelectric Generator using fluid technology that earned him the Worley Parsons Engineers of Tomorrow award in 2019. Mikael's unique combination of hardware expertise, neuromorphic computing knowledge, and entrepreneurial drive positions him at the forefront of emerging technologies in chip fabrication and neural interfaces.\n\nOne of his notable projects includes developing a highly efficient compression algorithm for Neuralink's N1 implant as part of their compression challenge, which has gained significant attention on GitHub. His diverse portfolio of projects demonstrates his commitment to advancing both hardware and software solutions in the field of neurotechnology and chip design."
}