{
    "id": "mikael-haji",
    "name": "Mikael Haji",
    "profile_pic": "https://media.licdn.com/dms/image/v2/C4E03AQGk0A7GaQeQ5Q/profile-displayphoto-shrink_200_200/profile-displayphoto-shrink_200_200/0/1651066544962?e=2147483647&v=beta&t=yj-bKioCzwf048DTNb9iFp30XkjLp2qFvZhs9fSii3E",
    "contacts": [
        "mikaelhaji.com"
    ],
    "links": [
        "https://mikaelhaji.com"
    ],
    "short_description": "Team Lead at Waterloo Hacker Fab building a 10µm open-source DIY chip fab. Electrical Engineering student at University of Waterloo and Schulich Leaders Scholarship recipient. Previously worked at Prophetic, University of Toronto, and Blackrock Neurotech in hardware and deep learning research.",
    "long_description": "Mikael Haji is an accomplished young professional in the field of electrical engineering and chip fabrication. Currently serving as Team Lead at Waterloo Hacker Fab, he is building a 10µm open-source DIY chip fabrication facility in Waterloo, Ontario. \n\nHis professional experience includes working as an R&D Intern in Ultrasound at Prophetic in New York, where he built an entire transcranial focused ultrasound infrastructure, deployed advanced optimization techniques, and accelerated transducer prototyping. Prior to that, he was a Deep Learning & Hardware Research Intern at the University of Toronto, working on the digital back-end of a novel neuromorphic chip design integrating spiking neural networks for advanced neural implants.\n\nMikael has an impressive early career trajectory, having been hired as the youngest intern at Blackrock Neurotech in Salt Lake City, where he engineered custom circuitry enclosures and fabricated high-precision electrode arrays. He was also a Core Member at WATOLINK, where he helped build a mind-controlled speech interface using SSVEP with GPT-3 integration, which won first place in the Neurotech X student competition.\n\nHis academic background includes studying Electrical Engineering at the University of Waterloo, where he received the prestigious $120K Schulich Leaders Scholarship. He has also been recognized with a $250K Matching Trust Fund from Patrick Poirier at Dragon's Vault to support his work in neurotech, and the Worley Parsons' Engineers of Tomorrow Award for building a novel Thermoelectric Generator using fluid technology.\n\nMikael has been invited as a speaker at various conferences, including being flown to Dubai for the Global Citizen Forum Conference to discuss his work in neurotech. He was also selected as a Villars Fellow and participated in the inaugural Villars Symposium in Geneva, Switzerland."
}