{
    "id": "min-xu-45b7315",
    "name": "Min Xu",
    "profile_pic": "https://media.licdn.com/dms/image/v2/C4E03AQEZ9lvVglalcw/profile-displayphoto-shrink_200_200/profile-displayphoto-shrink_200_200/0/1517755876406?e=2147483647&v=beta&t=JCgIlhX6htHUHn9CgPFkMkJPwxsMFcDVqou2shjlN7U",
    "contacts": [
        "min-xu-45b7315@linkedin.com"
    ],
    "links": [
        "https://xulabs.github.io"
    ],
    "short_description": "Min Xu is affiliated with the Department of Electrical and Computer Engineering at Carnegie Mellon University and has connections to the University of Southern California. He has 7K followers and over 500 connections on LinkedIn, and is open to research collaborations.",
    "long_description": "Min Xu is a professional affiliated with the Department of Electrical and Computer Engineering at Carnegie Mellon University, with previous connections to the University of Southern California. His LinkedIn profile shows a substantial following of 7,000 followers and more than 500 connections, indicating significant professional recognition in his field. \n\nMin appears to be involved in academic research, as evidenced by his lab website (XuLabs) and his openness to research collaborations. In his about section, he explicitly invites interested parties to email him regarding potential collaborations, directing them to his lab's website at xulabs.github.io.\n\nWhile specific details about his research focus, publications, or academic position are not explicitly mentioned in the provided data, his affiliations with prestigious engineering departments at Carnegie Mellon and USC suggest he is likely involved in electrical engineering, computer engineering, or related technical fields. The existence of a dedicated lab website further supports his active involvement in research activities.\n\nHis professional network includes connections to other academics and researchers across various institutions in the United States, including individuals from UNC Chapel Hill, Caltech, and other universities, suggesting he is well-integrated into the academic research community."
}