{
    "id": "min-xu-45b7315",
    "name": "Min Xu",
    "profile_pic": "https://media.licdn.com/dms/image/v2/C4E03AQEZ9lvVglalcw/profile-displayphoto-shrink_200_200/profile-displayphoto-shrink_200_200/0/1517755876406?e=2147483647&v=beta&t=JCgIlhX6htHUHn9CgPFkMkJPwxsMFcDVqou2shjlN7U",
    "links": [
        "https://xulabs.github.io",
        "https://www.cs.cmu.edu/~mxu1",
        "https://scholar.google.com/citations?user=Y3Cqt0cAAAAJ",
        "https://www.linkedin.com/in/min-xu-45b7315"
    ],
    "short_description": "Min Xu is an Associate Professor in the Computational Biology Department at Carnegie Mellon University, with courtesy appointments in the Robotics Institute and Department of Electrical and Computer Engineering. His research focuses on computer vision and machine learning methods for analyzing cellular systems using imaging and omics data.",
    "long_description": "Min Xu (徐旻) is an Associate Professor at the Computational Biology Department within the School of Computer Science at Carnegie Mellon University. He holds Courtesy Appointments at the Robotics Institute and Department of Electrical and Computer Engineering. He serves as training faculty at the Joint CMU-Pitt Ph.D. Program in Computational Biology and as co-director of the Master of Science in Computational Biology (MSCB) program. He is also a training faculty member at the Master of Science in Computer Vision (MSCV) program at CMU.\n\nDr. Xu is an investigator at the National Center for Multiscale Modeling of Biological Systems and is affiliated with the Computer Vision Department at the Mohamed bin Zayed University of Artificial Intelligence in UAE. His career has been dedicated to developing computer vision and machine learning methods for analyzing cellular systems using imaging and omics data.\n\nHis early work (2000-2009) focused on developing machine learning methods for analyzing functional genomics data. Since 2008, he has shifted his focus to developing computer vision methods for the analysis of Cellular Cryo-Electron Tomography (Cryo-ET) 3D image data. Dr. Xu and his team have designed novel structural pattern mining methods and were the first to demonstrate the feasibility of De Novo extraction of structures and spatial organizations of macromolecular complexes in single cells using Cryo-ET data. His current research focuses on Cryo-ET derived modeling of cellular organization at molecular resolution.\n\nDr. Xu has published extensively in top peer-reviewed journals and conferences, including PNAS, Structure, ISMB, CVPR, NeurIPS, and MICCAI. His work has been cited over 3,700 times according to Google Scholar. He serves as Principal Investigator on US NIH R01 and NSF awards and received an NSF CAREER award in 2023.\n\nDr. Xu received his B.E. in Computer Science from Beihang University, M.Sc. from the School of Computing at the National University of Singapore, M.A. in Applied Mathematics from the University of Southern California (USC), and Ph.D. in Computational Biology and Bioinformatics from USC. Before joining CMU, he was a postdoctoral researcher at USC.\n\nIn his own words, \"Dr. Xu researches for fun, and he enjoys working with highly talented and motivated students.\" He is open to research collaborations and can be contacted via email at mxu1@cs.cmu.edu."
}