{
    "id": "natnael-kahssay",
    "name": "Natnael Kahssay",
    "profile_pic": "https://media.licdn.com/dms/image/v2/D4E03AQEGGRGzzFxA_w/profile-displayphoto-shrink_200_200/B4EZU5.QVsHgAc-/0/1740434376570?e=2147483647&v=beta&t=FDWkCfk75GkQscw6bbgijPWQlRIcGCspChp9X4_DBqk",
    "links": [
        "https://github.com/natask",
        "https://fpga.mit.edu/6205/F24/syllabus"
    ],
    "short_description": "Computer Science and Engineering student at MIT with a unique blend of hardware expertise spanning RF systems, FPGA design, and nano-fabrication. Founder of Saverntronics technologies and researcher in bioelectronics, Natnael combines hands-on engineering with entrepreneurial vision.",
    "long_description": "Natnael Kahssay is a Computer Science and Engineering student at MIT with an impressive breadth of technical expertise across hardware domains. His background spans RF systems, FPGA design, nano-fabrication, and hardware design, with proficiency in programming languages including Bluespec, C, and Python, as well as industry tools like Cadence and Vivado.\n\nAs an undergraduate researcher in MIT's Bioelectronics Group, Natnael works on cutting-edge optogenetic-based waveguide and neural implants used to study stress in addiction susceptibility, demonstrating his ability to apply engineering principles to neuroscience research. His academic contributions extend to teaching roles, where he serves as a Laboratory Teaching Assistant for Digital System Laboratory I (6.205), helping students implement digital design projects on Sparta-7 FPGAs.\n\nNatnael's entrepreneurial spirit is evident in his founding of Saverntronics technologies, where he led the development of an autonomous barbing machine, handling both digital modeling and actuator response characterization. This venture showcases his ability to take technical concepts from ideation to implementation.\n\nHis project portfolio reflects his diverse interests, including work on an 802.11a Physical layer on RFSoC, Nano MEMS Mirrors, and various software projects. On GitHub, he maintains several open-source projects, including \"gestures\" (a fluid gestures system for Linux with 68 stars), and extensions for GNOME window management. His GitHub profile, where he goes by \"natask,\" emphasizes his philosophy that \"Productivity is key. Planning is essential.\"\n\nNatnael has also contributed to significant academic projects, including an HFT (High-Frequency Trading) Accelerator developed with his brother Endrias Kahssay and teammate Ziheng Wang as part of MIT's 6.111 (Digital Systems Laboratory) final project in Fall 2019. This project demonstrated his ability to work on complex, time-sensitive computational systems.\n\nCurrently, Natnael is set to join Etched, indicating his continued trajectory in the technology sector. His multidisciplinary background at the intersection of computer science, electrical engineering, and bioelectronics positions him uniquely in the field of hardware engineering and design."
}