{
    "id": "nikita-mounier",
    "name": "Nikita Mounier",
    "profile_pic": "https://media.licdn.com/dms/image/v2/D4D03AQFXtoGENVvo_Q/profile-displayphoto-shrink_200_200/profile-displayphoto-shrink_200_200/0/1723798308303?e=2147483647&v=beta&t=xr4ZDu_GadEOOd8tVfBKgQ_W7ciiR6RZA01WqzRvsJM",
    "contacts": [
        "711 followers",
        "500+ connections"
    ],
    "links": [
        "https://github.com/nikitamounier/tapit-app"
    ],
    "short_description": "Nikita Mounier is a student in the Jerome Fisher M&T Program at the University of Pennsylvania, pursuing a dual degree in Computer Science (Engineering) and Finance (Wharton). He has experience as an App Developer at Penn Labs, a Software Engineering Intern at Ramp, and has won multiple hackathons including PennApps XXIII and placed 2nd at TreeHacks 2025.",
    "long_description": "Nikita Mounier is a talented student in the prestigious Jerome Fisher Management & Technology Program at the University of Pennsylvania, where he is pursuing a dual degree with a Bachelor of Science in Engineering (Computer Science) and a Bachelor of Science in Economics (Finance) with a strong GPA of 3.91/4.00. \n\nHis professional experience includes working as an App Developer at Penn Labs since September 2023, where he contributes to developing applications for the Penn community. He also serves as a Teaching Assistant at the University of Pennsylvania for graduate-level Machine Learning (CIS 5200) and Programming Languages & Techniques (CIS 1200) courses. Nikita completed a Software Engineering Internship at Ramp in Summer 2024 and previously worked in Sourcing & Development at Appex in 2021.\n\nNikita has an impressive track record in hackathons and projects, winning 1st place at PennApps XXIII in September 2022 with \"Cointree,\" a platform on the blockchain that incentivizes sustainable living through carbon offsets. He also achieved 2nd place overall at TreeHacks 2025 with \"Supernova\" and has worked on other projects including \"Aria\" and \"Rally AI\" (which won 2nd place, Best Design, and the Wolfram Award at PennApps XXV). He developed \"Tap It,\" a personal project from 2020-2022.\n\nHe is multilingual, with native or bilingual proficiency in English, French, and Russian, as well as limited working proficiency in Spanish. Before Penn, he attended Lycée Français Charles de Gaulle de Londres, where he completed the French Baccalauréat in Computer Science, Maths & Physics stream with highest honors (19.33/20).\n\nNikita is also involved in Penn Undergraduate Capital Partners in a Sourcing role and has spoken at NSLondon in November 2022, demonstrating his diverse interests spanning technology, finance, and entrepreneurship."
}