{
    "id": "niya-ma",
    "name": "Niya Ma",
    "profile_pic": "https://media.licdn.com/dms/image/v2/D4E03AQEIdH4fEpYJoA/profile-displayphoto-shrink_200_200/profile-displayphoto-shrink_200_200/0/1670706041193?e=2147483647&v=beta&t=Oz-BXvFxQE0HDtBNt9YYFAUAgx800e-7MDwCIjJuNmk",
    "links": [
        "https://niya-ma.com",
        "https://www.linkedin.com/in/niya-ma",
        "https://github.com/niya-ma-1"
    ],
    "short_description": "Niya Ma is a Software Engineer at Oracle OCI with a strong background in hackathons, having won multiple awards and served as Director of Hack@Davidson. She graduated Magna Cum Laude from Davidson College with a double major in Computer Science and Mathematics, and has experience in machine learning, automation, and full-stack development.",
    "long_description": "Niya Ma is a Software Engineer at Oracle OCI who graduated Magna Cum Laude from Davidson College with a double major in Computer Science and Mathematics. Her technical journey showcases a diverse range of experiences across machine learning, software development, and leadership roles.\n\nAs the former Director of Hack@Davidson, Niya has deep roots in the hackathon community, both as an organizer and participant. Her impressive track record includes winning multiple hackathon awards, such as 2nd Place at the Twilio LLM Hackathon, Best project using Wolfram API at Stanford LLM x Law Hackathon, and awards for sustainability, security, and automation at various other competitions.\n\nNiya's professional experience includes software engineering internships at major tech companies. At Oracle, she pioneered a Python script that accelerated network traffic simulation by 250x and engineered MySQL database and Grafana dashboard integration. At Qualtrics, she worked on the Developer Experience team, creating efficient updating mechanisms for services and making substantial open-source contributions to the Backstage project.\n\nHer academic background includes coursework in Natural Language Processing, Concurrent & Parallel Computing, Deep Learning, Operating Systems, and Applied Cryptography. She also took CS229 - Machine Learning at Stanford University.\n\nAt Oracle, Niya has been working with OCI Landing Zones, contributing to enterprise cloud infrastructure deployment solutions. Her GitHub profile shows involvement with Oracle's cloud infrastructure projects, including forking and working with the oracle-enterprise-landingzone repository, which focuses on deploying typical architecture used by enterprise customers in Oracle Cloud Infrastructure.\n\nBeyond technical skills, Niya demonstrated leadership as President of the Association For Women In Mathematics at Davidson College and was involved in campus activities including Davidson Chorale and the Residence Life Office. She is bilingual in English and Mandarin, adding a multicultural dimension to her skill set.\n\nNiya's combination of technical expertise, leadership experience, and hackathon success positions her as a versatile software engineer with particular strengths in machine learning applications, cloud infrastructure, and automation."
}