{
    "id": "omshastri",
    "name": "Om Shastri",
    "profile_pic": "https://media.licdn.com/dms/image/v2/D5603AQEs6l8zB1YJyA/profile-displayphoto-shrink_200_200/profile-displayphoto-shrink_200_200/0/1686098198109?e=2147483647&v=beta&t=o_DhzT0AUjCf61d8ZFRtAJEPnJJ_ZqpK2xq02Qn57Go",
    "contacts": [
        "oshastri@wharton.upenn.edu"
    ],
    "links": [
        "https://www.omshastri.com"
    ],
    "short_description": "Student at The Wharton School and investor at Dorm Room Fund with a background in research and technology. Published researcher with experience in polarimetry and IoT systems, and recipient of the Congressional Gold Medal Award.",
    "long_description": "Om Shastri is a student at The Wharton School and an investor at Dorm Room Fund with over 7,000 followers on LinkedIn. He has a strong background in research and technology, with publications in prestigious journals including the Monthly Notices of the Royal Astronomical Society and MDPI Sensors. His research work includes \"PICSARR: high-precision polarimetry using CMOS image sensors\" and \"MOSQUITO EDGE: An Edge-Intelligent Real-Time Mosquito Threat Prediction Using an IoT-Enabled Hardware System.\"\n\nOm has been involved in various organizations including the Wharton Investment and Trading Group as a TMT Analyst, GRASP Lab as a Research Assistant, and served as Co-CEO of X Academy Hephaestus Robotics. He also worked as a Research Assistant at the Monterey Institute for Research and Astronomy.\n\nHis project portfolio includes collaborative work on \"A Hitchhiker's Guide to 𝑷,\" \"Rabbit-Hole,\" \"PlanForm,\" and \"MosquitoEdge.\" Om has participated in numerous hackathons including x.ai Hackathon, TreeHacks, HackMIT, HackHarvard, Microsoft Internal AI Hackathon, Entrepreneur First UPenn Hackathon, and PennApps.\n\nOm is a recipient of the Congressional Gold Medal Award from the United States Congress. He holds certifications in Business Analysis, Data Analysis, and Generative AI from Microsoft and LinkedIn. His interests appear to be focused on technology, AI, venture capital, and innovation, as evidenced by his LinkedIn activity showing engagement with content related to AI advancements, startups, and technology developments."
}