{
    "id": "omshastri",
    "name": "Om Shastri",
    "profile_pic": "https://media.licdn.com/dms/image/v2/D5603AQEs6l8zB1YJyA/profile-displayphoto-shrink_200_200/profile-displayphoto-shrink_200_200/0/1686098198109?e=2147483647&v=beta&t=o_DhzT0AUjCf61d8ZFRtAJEPnJJ_ZqpK2xq02Qn57Go",
    "links": [
        "https://www.omshastri.com",
        "mailto:oshastri@wharton.upenn.edu"
    ],
    "short_description": "Wharton student in the Management and Technology Program, former varsity wrestler, and Dorm Room Fund associate with a background in robotics research and astronomical instrumentation. Published researcher with experience in edge computing and polarimetry, balancing interests in technology, investment, and scientific research while serving as a student manager for Penn's wrestling team.",
    "long_description": "Om Shastri is a student in the prestigious Management and Technology Program at The Wharton School and The School of Engineering and Applied Sciences at the University of Pennsylvania, where he is pursuing a triple major in Computer Science, Finance, and Entrepreneurship. He currently works with Dorm Room Fund, helping identify and invest in promising student-led startups.\n\nHis research experience is particularly impressive, having published in prestigious journals like Monthly Notices of the Royal Astronomical Society on high-precision polarimetry using CMOS image sensors, and in MDPI Sensors on edge-intelligent IoT systems for mosquito threat prediction (MOSQUITO EDGE). This demonstrates his technical versatility across astronomy and edge computing applications.\n\nOm has been involved with several research institutions, including the GRASP Lab (likely focusing on robotics and automation) and the Monterey Institute for Research and Astronomy. His leadership experience includes serving as Co-CEO of X Academy Hephaestus Robotics and as a TMT Analyst for the Wharton Investment and Trading Group, showing his ability to bridge technical expertise with business acumen.\n\nBefore Penn, Om was a standout wrestler at Los Gatos High School in California, where he served as team captain and achieved impressive accomplishments including qualifying for the California State tournament, winning the CA World Challenge Championship, and earning titles as League and District champion. He was also recognized as the Bay Area Student Athlete of the Year and maintained high academic honors throughout his four years.\n\nCurrently, Om serves as a student manager for the University of Pennsylvania wrestling team after competing as a freshman during the 2023-24 season at 184/197 pounds. Though his competitive record was 0-6, he gained valuable experience participating in tournaments including the Keystone Classic, Patriot Open, and F&M Open.\n\nOm's professional experience includes internships at NASA, the US Army, CLA, and Ripple Ventures, providing him with diverse exposure across government, consulting, and venture capital sectors. He's an active participant in the AI hackathon circuit, having competed in prestigious events including x.ai Hackathon, TreeHacks, HackMIT, HackHarvard, Microsoft Internal AI Hackathon, and PennApps.\n\nHis achievements include receiving the Congressional Gold Medal Award from the United States Congress in September 2022, recognizing his exceptional service and achievement. He has also completed certifications in Business Analysis, Data Analysis, and Generative AI through Microsoft and LinkedIn, showing his commitment to staying current with emerging technologies.\n\nOm is the son of Medha and Parthesh Shastri, and his personal interests likely include following developments in AI, quantum computing, cybersecurity, and startup funding, particularly in the tech sector. This holistic profile presents Om as a multifaceted individual with strong technical foundations, research credentials, and business interests, positioned at the intersection of technology, finance, and scientific innovation."
}