{
    "id": "parsa-idehpour-8b0a8628a",
    "name": "Parsa Idehpour",
    "profile_pic": "https://media.licdn.com/dms/image/v2/D4E03AQEKIIQrvvsguA/profile-displayphoto-shrink_200_200/profile-displayphoto-shrink_200_200/0/1700958015122?e=2147483647&v=beta&t=K36o7k8PMVpyM46GSO-PG8mMKHRTZV11lzWdWdv2u7s",
    "links": [
        "https://www.linkedin.com/in/parsa-idehpour-8b0a8628a",
        "https://github.com/ParsaIdp",
        "https://devpost.com/ididea",
        "https://eent.seas.upenn.edu/fellows/"
    ],
    "short_description": "Parsa Idehpour is a Math and Computer Science student at the University of Pennsylvania pursuing an MSE in Robotics with AI and Machine Learning specialization. He conducts innovative research on neural network \"sloppiness\" patterns and applies mathematical modeling to evolutionary game theory while working as a Junior Analyst at Wharton Analytics Fellows.",
    "long_description": "Parsa Idehpour is a multidisciplinary researcher and student at the University of Pennsylvania, where he's pursuing both a Bachelor's degree in Math and Computer Science (with minors in Statistics and Engineering Entrepreneurship) and an MSE in Robotics with a specialization in AI and Machine Learning at the prestigious GRASP Lab.\n\nAs a Machine Learning Researcher at UPenn Engineering, Parsa is investigating how neural networks avoid overfitting through \"sloppiness\" - a pattern where models exhibit varying parameter sensitivities that effectively control generalization despite having extensive parameters. This cutting-edge graduate-level project, supervised by Dr. Pratik Chaudhari, aims to develop more streamlined and efficient AI development practices by uncovering common learning patterns across various deep learning models. The research has received support from major grants including the NSF CAREER award and partnerships with industry leaders like Amazon and Intel.\n\nSimultaneously, Parsa conducts research in Mathematical Economics, developing mathematical models to explore evolutionary game theory and switching costs under the supervision of Dr. Akcay and Dr. Plotkin. This independent graduate-level project demonstrates his ability to apply mathematical frameworks to complex economic systems.\n\nIn his role as a Junior Analyst at Wharton Analytics Fellows, Parsa builds and trains machine learning models to understand the root causes of worker absenteeism for Dallas Area Rapid Transit (DART), utilizing Python and SQL to analyze datasets and derive actionable insights.\n\nParsa is also actively involved in the LyRL research lab, where he has implemented PAC-Bayes bounds for neural networks and worked on capacity control in deep learning. His GitHub repository \"Parsa-summer-2024\" showcases his implementation of methods from academic papers, including work on PAC-Bayes bounds and K-FAC (Kronecker-Factored Approximate Curvature) for neural networks trained on the MNIST dataset.\n\nAdditionally, Parsa contributes to MLR@Penn, where he works on predicting biomolecular structures using diffusion models. He has also developed \"Augur,\" a swarm-based prediction tool showcased on Devpost.\n\nBeyond his academic pursuits, Parsa serves as the cultural chair of Penn Persian Club, organizing events that celebrate and support the Persian community. He was selected as a 2025 Sugi and Millie Widjaja Entrepreneurship Fellow at Penn, recognizing his entrepreneurial potential. In his free time, he enjoys playing Persian songs on the piano, voice acting, and rock climbing with Penn's Climbing Club.\n\nOriginally from Iran, Parsa brings a unique international perspective to his work, combining technical expertise with cultural awareness and entrepreneurial vision."
}