{
    "id": "pavan-jayasinha-6b06b71b6",
    "name": "Pavan Jayasinha",
    "profile_pic": "https://static.licdn.com/aero-v1/sc/h/9c8pery4andzj6ohjkjp54ma2",
    "contacts": [
        "2K followers",
        "500+ connections"
    ],
    "links": [
        "https://www.linkedin.com/in/pavan-jayasinha-6b06b71b6"
    ],
    "short_description": "AI GPU Engineering Intern at Modular and Computer Engineering student at University of Waterloo with experience in machine learning, quantum computing, and low-level kernel development. Previously worked at Extropic AI, Untether AI, and the Institute for Quantum Computing.",
    "long_description": "Pavan Jayasinha is a Computer Engineering student at the University of Waterloo with a strong background in machine learning, quantum computing, and low-level kernel development. He has maintained a 4.0 GPA (93/100) and received recognition as a Masason Scholar and President's Research Award recipient.\n\nHis professional experience includes working as an AI GPU Engineering Intern at Modular, where he developed GPU kernels in Mojo language, optimized end-to-end pipelines, and implemented multi-GPU tensor parallelism. At Extropic AI, he served as both a Software Contractor and Research Engineer, building high-performance JAX codebases for analog simulation of probabilistic ML models on hardware.\n\nPavan's quantum computing expertise is extensive, having worked as a Research Intern at the Institute for Quantum Computing, where he researched methods to realize the Bose-Hubbard Hamiltonian through Rydberg neutral atoms and built large-scale physics simulations. He also contributed to IBM's quantum computing initiatives as a Qiskit Advocate, authoring a chapter in the Qiskit Textbook QML course on Quantum Generative Adversarial Networks, and serving as a mentor at the Qiskit Global Summer School.\n\nHis technical skills span GPU optimization, kernel development, quantum computing, and machine learning, with certifications including IBM Certified Associate Developer for Quantum Computation using Qiskit. Pavan's diverse background also includes experience as a Lifeguard for the City of Toronto and even as a dedicated dog walker in his earlier years.\n\nPavan has a particular interest in generative modeling and low-level kernel development, as stated in his LinkedIn profile. His academic achievements include being on the Dean's Honours List at the University of Waterloo and receiving numerous course proficiency awards during his high school years at Silverthon CI, where he graduated with a 96.4/100 average."
}