{
    "id": "porvesh-balasubramanian",
    "name": "Porvesh Balasubramanian",
    "profile_pic": "https://media.licdn.com/dms/image/v2/D5603AQGi8Z-OXC7sBQ/profile-displayphoto-shrink_200_200/profile-displayphoto-shrink_200_200/0/1710792007259?e=2147483647&v=beta&t=-W6iHmvurMW952fsvoEcfmDnQhIv7IaxGPq1y_LGrlw",
    "contacts": [
        "porveshb@umich.edu"
    ],
    "links": [
        "https://porvesh.github.io/",
        "https://www.linkedin.com/in/porvesh-balasubramanian/"
    ],
    "short_description": "Founding Engineer at Bronco AI and fourth-year Computer Science student at the University of Michigan with a 3.8 GPA. Experienced in systems, robotics, and distributed computing with research experience at multiple labs including OrderLab and Real Time Computing Lab.",
    "long_description": "Porvesh Balasubramanian is a Founding Engineer at Bronco AI, where he is building AI agents for chip design and verification. He is currently pursuing a Bachelor of Engineering in Computer Science at the University of Michigan with an expected graduation in 2025, maintaining a strong 3.8/4.0 GPA.\n\nThroughout his academic career, Porvesh has gained extensive research experience across multiple domains. He has worked as a Robotics Research Assistant at the Real Time Computing Lab, where he built, controlled, and raced the F1Tenth autonomous vehicle. He also served as a Distributed Systems Research Assistant at OrderLab, working on OathKeeper, a tool for validating distributed systems to detect and enforce essential semantic rules at runtime.\n\nHis professional experience includes a role as a Mission System Software Intern at Northrop Grumman, where he automated Boot Image Generation, reducing the process time from 5 weeks to just 3 minutes. He also worked as a Software Intern at DealsPlus, where he revamped user experience by designing and implementing a Flask-based backend and making visual improvements using Quasar Framework.\n\nPorvesh has demonstrated leadership and teaching abilities through his roles as an Engineering Center Tutor for upper-level EECS classes, a Study Group Leader for EECS 280, and a Student Coach teaching Python to over 1,500 high school students worldwide. He has also contributed to research at UC Berkeley's Adept Lab, working on UCLID5, an integrated modeling, verification, and synthesis tool.\n\nHis coursework includes advanced topics such as Operating Systems, Computer Architecture, Embedded Systems, Algorithms, Computer Networks, Deep Learning, and Robot Learning, Planning & Controls. He is proficient in English and Tamil, and has earned recognition on the Dean's Honor List every semester for four years. Additionally, he holds a Black Belt in Wado-ryu Martial Arts.\n\nPorvesh has also been active in volunteering, serving as a Teaching Volunteer at Wisdom of Words, a Fundraising Volunteer at Sankara Eye Foundation, and a Volunteer at Namma Ooru Foundation."
}