{
    "id": "porvesh-balasubramanian",
    "name": "Porvesh Balasubramanian",
    "profile_pic": "https://media.licdn.com/dms/image/v2/D5603AQGi8Z-OXC7sBQ/profile-displayphoto-shrink_200_200/profile-displayphoto-shrink_200_200/0/1710792007259?e=2147483647&v=beta&t=-W6iHmvurMW952fsvoEcfmDnQhIv7IaxGPq1y_LGrlw",
    "links": [
        "https://porvesh.github.io/",
        "mailto:porveshb@umich.edu",
        "https://github.com/Porvesh"
    ],
    "short_description": "Porvesh is a fourth-year Computer Science student at the University of Michigan with a unique blend of expertise in systems engineering, robotics, and distributed computing. As a Founding Engineer at Bronco AI, he's developing AI agents for chip design and verification while simultaneously contributing to autonomous vehicle research and distributed systems validation.",
    "long_description": "Porvesh Balasubramanian is a fourth-year Computer Science student at the University of Michigan who has carved out a distinctive path at the intersection of systems engineering, robotics, and AI. Currently serving as a Founding Engineer at Bronco AI, he's building cutting-edge AI agents for chip design and verification.\n\nHis technical versatility is evident through his diverse research experiences. At Michigan's Real Time Computing Lab, Porvesh built and raced F1Tenth autonomous vehicles, demonstrating his hands-on skills in robotics. Simultaneously, he contributed to OrderLab's distributed systems research, working on OathKeeper—a tool that validates distributed systems by detecting and enforcing semantic rules at runtime.\n\nPorvesh's industry experience includes a role as a Mission System Software Intern at Northrop Grumman, where he automated boot image generation, reducing processing time from 5 weeks to just 3 minutes. He's also worked as a Software Intern at DealsPlus, implementing a Flask-based backend and enhancing user experience with the Quasar Framework.\n\nHis academic contributions extend beyond research. Porvesh serves as a grader for advanced courses like Embedded Systems and Advanced Data Structures, and works as an Engineering Center Tutor providing one-on-one assistance for upper-level EECS classes. Previously, he led study groups for introductory data structures and algorithms courses.\n\nPorvesh's technical foundation is complemented by a strong educational background, with coursework spanning algorithms, computer architecture, embedded systems, operating systems, robotics, and deep learning. He's consistently maintained a 3.8/4.0 GPA, earning a place on the Dean's Honor List every semester.\n\nBeyond his technical pursuits, Porvesh has demonstrated leadership through various roles, including as part of the \"Cyber Safety Team\" at the University of Michigan's Barger Leadership Institute, where he created a resource guide about cybersecurity for students. He's also an active developer with several GitHub repositories, including a personal game engine called \"EnfieldEngine\" written in C++ and contributions to real-time object detection for autonomous driving using deep learning.\n\nPorvesh is also an accomplished cricket player, representing the University of Michigan in various tournaments including CACTUS 2024 and playing for teams like Detroit Challengers CC and Chicago Panthers. As an all-rounder, he has demonstrated skills in both batting and bowling across multiple T20 matches.\n\nIn 2022, he was part of a team that developed \"Freshify,\" an application that uses artificial intelligence to track food expiration dates and provide tailored recipe recommendations, showcasing his interest in practical AI applications. His diverse interests and technical skills make him a versatile computer scientist with experience spanning from embedded systems to artificial intelligence."
}