{
    "id": "prady-saligram",
    "name": "Prady Saligram",
    "profile_pic": "https://media.licdn.com/dms/image/v2/C4E03AQEzkEEXkWvgjg/profile-displayphoto-shrink_200_200/profile-displayphoto-shrink_200_200/0/1649863888601?e=2147483647&v=beta&t=p5DtzARjiqeWK4jYSAiRFufyVpw6db2pSlQa1ossP3A",
    "contacts": [
        "saligram@stanford.edu"
    ],
    "links": [
        "https://www.linkedin.com/in/prady-saligram/"
    ],
    "short_description": "Quantitative Research Analyst at Stanford University's Department of Management Science & Engineering and CURIS Research Associate at Stanford Artificial Intelligence Laboratory (SAIL). Math & CS student at Stanford with a focus on deep learning research and entrepreneurship.",
    "long_description": "Prady Saligram is a Mathematics and Computer Science student at Stanford University with a strong academic record (4.14/4.0 GPA) and extensive research experience in artificial intelligence and quantitative methods. \n\nCurrently, he serves as a Quantitative Research Analyst at Stanford University's Department of Management Science & Engineering, where he's developing an end-to-end pipeline for a proprietary LLM using a hybrid dense-sparse RAG framework to process 10-K filings. His work includes constructing domain-specific datasets, creating evaluation benchmarks, and optimizing embedding retrieval for deductive reasoning.\n\nSimultaneously, Prady works as a CURIS Research Associate at the Stanford Artificial Intelligence Laboratory (SAIL), implementing RoBERTa in Jax and Haliax within Stanford's Levanter framework, and augmenting models trained on historical languages through novel PoS tagging fine-tuning methods.\n\nHis professional experience extends to the finance sector, with an upcoming Quant Invitational Wintern position at Citadel Securities and participation in Akuna Capital's Invitational Trading Competition, where he performed in the top 20% for PnL.\n\nPrady is actively involved in entrepreneurship as Vice President of Hackspace at the Business Association of Stanford Entrepreneurial Students (BASES), where he oversees weekly hacker hours, themed hackathons, faculty speaker series, and a culminating Demo Day. He was also admitted to the BASES Battalion Fellow Incubator Program with a highly competitive acceptance rate of less than 7%.\n\nPrior to Stanford, Prady co-founded Voice Maths, a platform enabling users to find answers to math-related questions, managed by accredited students skilled in tutoring fifth-grade to IB-level mathematics. He also interned at Al-Futtaim in Dubai as a System Engineering Intern and Finance Analyst & Communications Officer.\n\nAcademically, Prady excelled in the International Baccalaureate program, scoring 44/45, and achieved 9 A*s and 2 9s in his IGCSEs. He has participated in programs at Johns Hopkins Whiting School of Engineering and the Johns Hopkins Center For Talented Youth.\n\nPrady is proficient in English (native), Hindi and Spanish (professional working proficiency), and Kannada (limited working proficiency). His work has been featured in publications like Gulf News and TechOnShow for his innovative project addressing astronauts' sleep issues in space."
}