{
    "id": "ricardo-skewes-zorrilla-882084159",
    "name": "Ricardo Skewes Zorrilla",
    "profile_pic": "https://media.licdn.com/dms/image/v2/C4E03AQGdjg9dMgMgaw/profile-displayphoto-shrink_200_200/profile-displayphoto-shrink_200_200/0/1639253413496?e=2147483647&v=beta&t=JBICJ8qbTT0shdzjywSD1QQMy50sgNGWcRsRg7mIsEU",
    "links": [
        "https://ricardoskewes.github.io/CoviDetectives/index.html",
        "https://hongkunparklab.com/",
        "https://harvardquantum.com/"
    ],
    "short_description": "A multilingual Physics and Computer Science student at Harvard with exceptional achievements in quantum computing and international physics competitions. Ricardo combines technical expertise with diplomatic skills, having led international relations organizations and conducted research spanning solid-state physics, ESG consulting, and quantum algorithm development across multiple languages.",
    "long_description": "Ricardo Skewes Zorrilla is a Physics and Computer Science student at Harvard University with a remarkable blend of technical expertise and international perspective. His academic journey is distinguished by significant achievements in quantum computing, where he serves as Vice President of the Harvard Undergraduate Quantum Computing Association (HUQCA) and won 2nd place at MIT's Quantum Computing Hackathon 2024, developing theoretical error bounds for quantum algorithms.\n\nRicardo's technical prowess extends beyond quantum computing to solid-state physics research, where he worked with 2D transition metal dichalcogenides and Van der Waals heterostructures under Professor Hongkun Park. His computational skills have been recognized through multiple hackathon victories, including Microsoft's Student Hackathon 2021 and CdCMx 2020, where he developed mathematical models for COVID-19 comorbidity analysis.\n\nIn the quantum computing field, Ricardo has demonstrated exceptional talent, helping to grow HUQCA to over 300 members. At the MIT Interdisciplinary Quantum Hackathon (iQuHACK), his team created an \"experimental harness\" that allowed them to run quantum simulations at scale and efficiently collect data, earning them second place. As Ricardo noted, \"It's one thing to learn something in a classroom, and another to try to code one and see if it runs. That's different, and I think it adds an extra layer to fully mastering the concepts.\"\n\nWhat sets Ricardo apart is his exceptional international background and linguistic abilities. Fluent in six languages (Spanish, English, French, Chinese, Russian, and German), he has leveraged these skills in various leadership roles. As Co-President of Harvard International Relations on Campus and in his work with the Harvard International Relations Council, he has bridged cultural divides and facilitated international dialogue. His language proficiency earned him first place in Harvard's Chinese Poetry Recitation Contest and supported his research for a Radcliffe Fellow's project on underground economies in Greater China.\n\nRicardo's professional experience spans diverse sectors, from ESG consulting at PwC China, where he spearheaded sustainable design strategies for LEED-certified real estate projects, to his upcoming role as a Business Analyst at Alibaba Group. During his internship at PwC Shanghai through the Harvard China Fund Student Internship Program, he significantly improved his professional Chinese language skills while working on technical projects. As Ricardo reflected, \"My biggest achievement from this experience was the consolidation of my Chinese speaking, reading and writing skills at the professional level.\"\n\nHis commitment to diplomacy and international cooperation is evident in his work with the United Nations Information Center, where he led a conference commemorating the UN's 75th anniversary with 500+ Latin American students.\n\nHis academic excellence is further demonstrated by his impressive collection of medals from international physics competitions, including the International Physics Olympiad, European Physics Olympiad, and Mexican Physics Olympiad. Ricardo's multidisciplinary approach combines rigorous scientific training with global perspective, positioning him uniquely at the intersection of technology, diplomacy, and sustainable development."
}