{
    "id": "rishi-sadanandan",
    "name": "Rishi Sai Sadanandan",
    "profile_pic": "https://media.licdn.com/dms/image/v2/D5603AQHTBs3bDE7GJA/profile-displayphoto-shrink_200_200/profile-displayphoto-shrink_200_200/0/1701659909011?e=2147483647&v=beta&t=J1vo2OakSsrx6MuOgZqYadQtcDst6QZRPESnKixRzis",
    "contacts": [
        "rishi.sadanandan25@gmail.com"
    ],
    "links": [
        "https://www.linkedin.com/in/rishi-sadanandan/"
    ],
    "short_description": "CS(AI) + Math student at Stanford University with experience in venture capital, product design, and entrepreneurship. Currently a Pear VC Fellow and VC Analyst at Stanford Social Entrepreneurial Students' Association, with a passion for technology innovation and strategic business development.",
    "long_description": "Rishi Sai Sadanandan is a Computer Science (AI track) and Mathematics student at Stanford University (2023-2027) with a strong entrepreneurial mindset and diverse professional experience. He currently serves as a Pear VC Fellow, working closely with Khalil Fuller to identify and support high-potential early-stage founders, and leads Pear's Green Light program at Stanford. He's also a VC Analyst at Stanford Social Entrepreneurial Students' Association, where he works with a team to raise and manage a fund.\n\nRishi is the co-founder of PocketChangeDigital, a stealth startup, and serves as President of Rem and Company, where he leads a team of strategists providing data-driven solutions to small businesses. His entrepreneurial spirit is further demonstrated through his creation of Advanced AquaPods, an underwater ear pod system for which he holds two patents (Utility & Design).\n\nHis academic excellence is evident from his time at Berkeley Preparatory School (2019-2023), where he completed 10 AP classes and was recognized with numerous honors including AP Scholar with Distinction, Cum Laude Society, and membership in multiple national honor societies.\n\nRishi has gained valuable experience through various roles, including as a Finance Intern at L3Harris Technologies, a Growth Intern at Cyrano AGI, and a Data Implementation Intern at Repfabric. He's also worked as an SAT/ACT Test Preparation Specialist at Wyzant, demonstrating his ability to effectively communicate complex concepts.\n\nBeyond his professional and academic pursuits, Rishi has been involved in athletics, particularly tennis, where he served as Captain of the Varsity Tennis team and competed at state and national levels with the United States Tennis Association.\n\nRishi's skills span strategic planning, product lifecycle management, process improvement, requirements analysis, troubleshooting, and team collaboration. His combination of technical knowledge, business acumen, and leadership abilities positions him as a promising innovator in the intersection of technology, business, and design."
}