{
    "id": "ronakmalik",
    "name": "Ronak Malik",
    "profile_pic": "https://media.licdn.com/dms/image/v2/D5603AQH-KxSKBLRowA/profile-displayphoto-shrink_200_200/profile-displayphoto-shrink_200_200/0/1723689518420?e=2147483647&v=beta&t=o22-OQmaTSJBirwjQjg_W7AEq7mAn39VNdBtCayGF28",
    "links": [
        "https://github.com/BeyondPerception",
        "https://www.linkedin.com/in/ronak-malik/"
    ],
    "short_description": "Ronak Malik is a Computer Science student at Harvard University with impressive aerospace industry experience, including roles at SpaceX and NASA. He specializes in avionics software engineering and machine learning frameworks, having contributed to rocket engineering projects and remote inspection systems. He's also active in Harvard's Ultimate Frisbee community as a team captain.",
    "long_description": "Ronak Malik is a Computer Science student at Harvard University (2021-2025) with a remarkable trajectory in aerospace and software engineering. His professional experience spans prestigious organizations, beginning with his role as a HUNCH Developer at NASA (2018-2020), where he developed a remote inspection system for a 4-axis Sherline mill with an HD inspection camera that allowed engineers to conduct inspections without visiting manufacturing facilities.\n\nHis aerospace expertise expanded through his three-year tenure (2021-2024) as an Avionics Software Responsible Engineer at the Texas Rocket Engineering Lab, followed by a Starship Software Internship at SpaceX in Hawthorne, California (May-August 2023). This diverse experience in rocket engineering systems demonstrates his specialized skills in avionics software.\n\nRonak has also ventured into other technical domains, working as a Machine Learning Frameworks Intern at AMD in Austin (Summer 2022) and as a Software Engineering Intern at Houston Radar LLC (Summer 2021). Currently, he serves as a Software Engineer at Altitude (since June 2024).\n\nBeyond his professional endeavors, Ronak is deeply involved in Harvard's Ultimate Frisbee community, serving as a captain for both the Red Line and Bred Line teams. His leadership in this sport demonstrates his teamwork and organizational abilities outside of technical contexts.\n\nAs a software developer, Ronak maintains an active GitHub presence (BeyondPerception) where he showcases projects including a highly reliable relay server called BounceServer, a GPS simulator with Qt frontend, and various collaborative academic projects. His GitHub profile describes him as \"passionate about computers, operating systems, networking, food, and interesting things.\" He has earned several GitHub achievements including Pair Extraordinaire, Arctic Code Vault Contributor, and Pull Shark.\n\nRonak also participated in the inaugural Harvard Match Poker Championships, where his team placed third, highlighting his strategic thinking abilities in competitive environments.\n\nHis technical foundation is further strengthened by certifications in computer architecture, having completed both parts of the \"Build a Modern Computer from First Principles: Nand to Tetris\" course series through Coursera in 2018. This combination of aerospace software engineering experience, machine learning knowledge, and fundamental computer science education positions Ronak as a versatile technologist with particular strength in aerospace software systems."
}