{
    "id": "ryan-rong-313779229",
    "name": "Ryan Rong",
    "profile_pic": "https://media.licdn.com/dms/image/v2/D4E03AQF6MD7w2N2--A/profile-displayphoto-shrink_200_200/profile-displayphoto-shrink_200_200/0/1729071897582?e=2147483647&v=beta&t=u5KDG4CBF4_gJ6YILAazXV5TV9cWw53rGr-94s7muEQ",
    "contacts": [
        "ryanrong@stanford.edu"
    ],
    "links": [
        "https://github.com/Ryan-Rong-24",
        "https://peddiehacks.peddie.org"
    ],
    "short_description": "Stanford CS '28 student and machine learning researcher with experience at Stanford HAI, HealthRex lab, and UIUC. Passionate about applying AI to healthcare, climate, and financial markets. Microsoft Imagine Cup Finalist '23 and SIMR '23 participant with multiple research publications and awards.",
    "long_description": "Ryan Rong is a Computer Science and Mathematics student at Stanford University (Class of 2028) with extensive experience in machine learning research and software development. His research interests focus on applying artificial intelligence to impactful areas such as healthcare, climate science, and financial markets.\n\nCurrently, Ryan works as a Research Assistant at the Stanford Institute for Human-Centered Artificial Intelligence (HAI), where he's developing an AI writing assistant Chrome extension that generates social media comments based on threads and discussions. He's also building a Python server to collect user behaviors and preferences.\n\nRyan's professional experience includes roles as a Machine Learning Engineer at Kos, working on algorithms for bio signal processing, and as a Software Engineer at Skylow, where he developed website features with Next.js and Firebase. His research background is impressive, having interned at Stanford University School of Medicine's HealthRex lab, where he trained Random Forest and XGBoost models to predict Alzheimer's Disease onset across demographic groups using Electronic Health Records. At the University of Illinois Urbana-Champaign, he worked on developing deep learning networks for generating realistic Java bugs.\n\nHis achievements include winning the Stanford CS229 Machine Learning Course Best Project (top 3 out of 400+ students), placing 1st in the 2024 Cornell Trading Challenge Systematic Equities category, and being a Microsoft Imagine Cup Americas World Finals Winner in 2023. He also received the Jessica Lynn Saal Fellowship Award from the Stanford Institutes of Medicine Summer Research Program, given to the top 5% of researchers.\n\nRyan has worked on numerous projects including long-range weather forecasting with chunked-sequence diffusion, an American Sign Language translator, and various machine learning applications like spam email classifiers and handwritten digit recognition systems. He's proficient in multiple languages including Chinese and English (native), and Spanish (limited working proficiency).\n\nBeyond his technical pursuits, Ryan is involved in volunteering as an Outreach Director and Tutor at Academic Advancements and has participated in fundraising for The Leukemia & Lymphoma Society. He also performs in musicals, showcasing his well-rounded personality and diverse interests."
}