{
    "id": "spike-ocarroll",
    "name": "Spike O'Carroll",
    "profile_pic": "https://media.licdn.com/dms/image/v2/D5603AQGsjEOYcE2YvA/profile-displayphoto-shrink_200_200/B56ZPbObIrHoAg-/0/1734549812941?e=2147483647&v=beta&t=7v7hKutq7Sfk3KWW4gymu0wnjIg9sKLlPeToEbstD8s",
    "links": [
        "https://spike.codes",
        "https://github.com/spikecodes",
        "https://twitter.com/spikecodes",
        "https://www.linkedin.com/in/spike-ocarroll/",
        "https://devpost.com/spikecodes"
    ],
    "short_description": "CS student at UC Irvine specializing in Intelligent Systems with impressive entrepreneurial achievements. Creator of Libreddit (4M+ monthly users) and co-founder of Dispatch AI, an emergency response AI solution. Multiple hackathon winner with over $120k in total winnings and incoming SWE intern at Ramp.",
    "long_description": "Spike O'Carroll is a Computer Science student at UC Irvine specializing in Intelligent Systems (AI/ML) with a 3.95 GPA. He has established himself as both a talented software engineer and successful entrepreneur.\n\nAs the creator of Libreddit (now Redlib), Spike built a private and customizable Reddit client that grew to over 4 million monthly active users, garnered 5k+ GitHub stars, and is hosted on 20+ instances globally. He also developed Peacock Browser, which achieved 30,000 downloads.\n\nSpike's entrepreneurial ventures include co-founding Dispatch AI, an AI-powered 911 operator system that uses empathy-driven emergency response to transform how critical emergencies are triaged. This venture won the $50,000 Grand Prize at the 2024 UC Berkeley AI Hackathon and was accepted into Berkeley Skydeck's Pad-13 Program (1% acceptance rate). The project has received grants from OpenAI, Intel, Skydeck, and Mistral AI.\n\nHis hackathon success is remarkable, with multiple first-place finishes including UC Berkeley AI Hackathon (2024), LAHacks Google Company Challenge (2024), UCI Stella Zhang New Venture Competition (2024), UCI Butterworth Product Design Competition (2024), and UCI AI Innovation Challenge in Student Experience (2024). He also placed 2nd in the SoCal Super Pitch Competition (2024). These achievements have resulted in over $120,000 in total winnings.\n\nProfessionally, Spike has worked as a Software Engineer Intern at Portal, where he shipped 80+ features to an AI web browser serving 30,000 users monthly, built a high-performance vector database in Rust, and launched a conversational voice AI with web agent capabilities. He's also run his own freelance web development business (Spike Designs) since 2021, creating high-converting websites and branding for businesses.\n\nSpike is set to join Ramp as a Backend SWE Intern in Summer 2025, further expanding his experience in the tech industry. His diverse skill set spans software engineering, UI/UX design, and entrepreneurship, with technical proficiency in languages like Rust, Python, TypeScript, and React.\n\nHis GitHub profile (spikecodes) showcases his open-source contributions and personal projects, including Stotra (a stock trading simulator) and Peafox (a Firefox privacy configuration). Spike is passionate about building high-impact products and continues to explore new opportunities in technology and entrepreneurship."
}