{
    "id": "thobonato",
    "name": "Thomaz Felipe Bonato",
    "profile_pic": "https://media.licdn.com/dms/image/v2/D5603AQGAwfxl7o_QYg/profile-displayphoto-shrink_200_200/profile-displayphoto-shrink_200_200/0/1698446882804?e=2147483647&v=beta&t=LO0xP9xZTd6S98I5e34TIKKHDF9S82q1CKJeKWiyghs",
    "contacts": [
        "thomaz.bonato@usc.edu"
    ],
    "links": [
        "https://www.linkedin.com/in/thobonato"
    ],
    "short_description": "AI researcher and student at USC, where he is a Trustee Scholar pursuing a BS in Artificial Intelligence for Business. A passionate engineer and lifelong learner from Brazil, Thomaz has experience in data science, AI research, and entrepreneurship.",
    "long_description": "Thomaz Felipe Bonato is an AI researcher and student at the University of Southern California, where he is pursuing a Bachelor of Science in Artificial Intelligence for Business as a prestigious Trustee Scholar with a full-tuition scholarship. Originally from Brazil, Thomaz describes himself as a passionate engineer, researcher, and lifelong learner.\n\nHis professional experience spans multiple domains within AI and technology. Currently, he works as a Data Science Intern at Trudy and as a Growth Strategist at Mercor. Since December 2023, he has been an Artificial Intelligence Research Assistant at USC Marshall School of Business, where he initially explored AI in education and is now researching LLMs and cluster-based probing.\n\nThomaz has demonstrated entrepreneurial spirit as a Founder of a stealth startup focused on AI for law firms, and has held leadership positions including Director of Founder's Education at SEP at USC and Director of External Relations at USC Business Technology Group. He also gained experience as a Data Science Intern at Canaria and as an Apps Developer at HyIQ Basketball.\n\nHis academic achievements include being a National Merit Finalist and receiving multiple hackathon awards, including 1st Place at HackMIT 2024 and 2nd Place at PennApps 2024. Thomaz has contributed to several projects, including Cypress MFA, PalmLabs, and Azalea (an eco-friendly AI model selector that won 1st place).\n\nHe is multilingual, with native or bilingual proficiency in English and Portuguese, and professional working proficiency in Spanish. Thomaz is also a Management Leadership Tomorrow (MLT) Fellow and has completed certifications in Linear Algebra for Machine Learning, Neural Networks and Deep Learning, and Figma for UX Design. He has also contributed to \"A Blueprint for Greece's AI Transformation\" for the Special Secretariat for Foresight, Presidency of the Government, Hellenic Republic."
}