{
    "id": "timofey-obraztsov",
    "name": "Timofey Obraztsov",
    "profile_pic": "https://media.licdn.com/dms/image/v2/D5603AQFGFig-GZwtvg/profile-displayphoto-shrink_200_200/profile-displayphoto-shrink_200_200/0/1700889846712?e=2147483647&v=beta&t=Ys48tPtReJw1H9JmErPan0xCnjXru9jAa0Mmuwv9AL8",
    "links": [
        "https://www.linkedin.com/in/timofey-obraztsov/",
        "https://github.com/timobraz",
        "https://devpost.com/TimTimich6"
    ],
    "short_description": "Timofey Obraztsov is a Computer Science student at UC Irvine with a passion for entrepreneurship and AI. As CTO at Atoma Media and Co-Founder of a stealth startup in MIT's StartHouse cohort, he's an accomplished hackathon winner who has developed multiple award-winning projects including EasyPC, Mammo, and CleanASF while contributing to AI initiatives on campus.",
    "long_description": "Timofey Obraztsov's journey into computer science began with a C++ for Dummies book his mother encouraged him to read. Growing up in Moscow with a vision to explore computer science, he has since built expertise across software engineering, full-stack development, and data analytics.\n\nCurrently pursuing a Computer Science degree at UC Irvine (expected 2027), Timofey is deeply involved in the AI and entrepreneurship ecosystem. He serves as the CTO at Atoma Media (previously Aurora Media), where he functions as the technical architect behind the company's core systems, specializing in AI/ML systems and scalable infrastructure. Simultaneously, he's co-founding a stealth startup that's part of the MIT StartHouse 2024 cohort, focusing on redefining commercial real estate due diligence standards by creating an AI Copilot for real estate agents and investors.\n\nTimofey has established himself as a prolific hackathon participant and winner. His GitHub profile (timobraz) showcases numerous projects, including EasyPC (1st place at Calhacks 10.0), a state-of-the-art PC-building AI assistant; Mammo, an AI-driven healthcare application for women; and Geoflare, a collaborative wildfire response system. Other notable projects include Laila (web automation tool), Earthlytics (corporate sustainability platform), compatible.ai (AI-enabled personality matching), and CleanASF (an environmental initiative for San Francisco).\n\nOn campus, Timofey holds multiple leadership positions, including roles as an Executive at Artificial Intelligence at UCI and a Developer for the UCI ICS Student Council. He recently completed a Software Engineer Internship at Corent Technology and has worked as a Software Engineer Researcher at UC Irvine.\n\nHis technical versatility spans multiple languages and frameworks, with specializations in React, Express.js, MongoDB, Rust, Go, TypeScript, Python, Machine Learning, React Native, and Swift. This diverse skill set has enabled him to develop industry-standard software that increased loading speed by 30%, create efficient web crawling bots for social media metrics analysis, and work on various applications.\n\nBefore UC Irvine, Timofey attended Peninsula High School in Rolling Hills Estates, CA, where he was part of the Boys Varsity Football team, graduating in 2023. His multidisciplinary approach and entrepreneurial mindset position him as an emerging innovator at the intersection of AI, software development, and business, with a growing community of followers on GitHub and an impressive portfolio of award-winning projects."
}