{
    "id": "tony-wang-",
    "name": "Tony Wang",
    "profile_pic": "https://media.licdn.com/dms/image/v2/D5603AQHwc9Ro1K6fXg/profile-displayphoto-shrink_200_200/profile-displayphoto-shrink_200_200/0/1727927740738?e=2147483647&v=beta&t=cRBEyCnXKxtXW0tCjw9CR8DNb1uhyJd3YrK1a7-W2rc",
    "contacts": [
        "wangtony@stanford.edu"
    ],
    "links": [
        "https://www.linkedin.com/in/tony-wang-"
    ],
    "short_description": "Computer Science student at Stanford University specializing in AI with experience at Amazon. Active in venture capital as a Pear VC Garage Fellow and Soma Capital Scout. Former Freshman Council President with leadership roles in multiple fellowship programs.",
    "long_description": "Tony Wang is a Computer Science student at Stanford University focusing on Artificial Intelligence. His professional experience spans software engineering, venture capital, and research. Currently, he serves as a Garage Fellow at Pear VC, a Fellow at Paragon Policy Fellowship, and a Co-Founder of the Public Interest Technology Lab Fellowship at Stanford University.\n\nTony has worked as a Software Engineer Intern at Amazon in Sunnyvale, California, and has held various roles including Scout at Soma Capital, Contractor at Hypelist, and Consultant for Microsoft through the Stanford Marketing Group. His leadership experience includes serving as Freshman Council President at Stanford, where he led the student council representing all 23 freshman dorms and managed $35,500 for over 1,700 students.\n\nIn the research domain, Tony has worked as a Research Intern at the Stanford Artificial Intelligence Laboratory (SAIL), focusing on deep learning to predict transcription factor binding motifs. He also served as a Student Researcher at Harvard Medical School under the Dana-Farber Cancer Institute and Boston Children's Hospital.\n\nTony's educational background includes studying Computer Science with a focus on AI at Stanford University, where he's involved in various organizations including TreeHacks, ACM ProCo, SPBA, and AEPi. Before Stanford, he attended Amador Valley High School, where he was Salutatorian, a Coca-Cola Scholar, National Merit Scholar, and won two gold medals with Kungfu Team USA.\n\nHe has been recognized through several prestigious fellowships, including being a Rise Fellow at Schmidt Futures, a Founder Fellow at RippleX Fellowship (1 of 10 startups from North America), and has founded the Alameda County Science and Engineering Fair. Tony's diverse experience demonstrates his commitment to technology, entrepreneurship, and public service."
}