{
    "id": "tony-wang-",
    "name": "Tony Wang",
    "profile_pic": "https://media.licdn.com/dms/image/v2/D5603AQHwc9Ro1K6fXg/profile-displayphoto-shrink_200_200/profile-displayphoto-shrink_200_200/0/1727927740738?e=2147483647&v=beta&t=cRBEyCnXKxtXW0tCjw9CR8DNb1uhyJd3YrK1a7-W2rc",
    "links": [
        "mailto:wangtony@stanford.edu"
    ],
    "short_description": "Tony Wang is a Computer Science student at Stanford University specializing in AI, with a diverse portfolio spanning tech, venture capital, and public interest technology. He has research experience at Stanford AI Lab and Harvard Medical School, and has worked with companies like Amazon and Microsoft.",
    "long_description": "Tony Wang is a Computer Science student at Stanford University focusing on Artificial Intelligence. His professional experience spans multiple domains including venture capital, public interest technology, and software engineering.\n\nAt Stanford, Tony has taken on leadership roles as the Freshman Council President, where he managed $35,500 for over 1,700 students. He's also involved with TreeHacks as an Alumni Director and serves as the ACM ProCo Director.\n\nTony's venture capital experience includes positions as a Garage Fellow at Pear VC, a Scout at Soma Capital, and a Founder Fellow at RippleX Fellowship. His interest in public policy is evident through his work as a Fellow at Paragon Policy Fellowship and as a Co-Founder of the Public Interest Technology Lab at Stanford University, where he led the inaugural student govtech fellowship program.\n\nHis technical experience includes a software engineering internship at Amazon, contracting work for Swim England and Hypelist, and research at the Stanford Artificial Intelligence Laboratory (SAIL) where he worked on deep learning to predict transcription factor binding motifs. He also conducted research at Harvard Medical School under the Dana-Farber Cancer Institute and Boston Children's Hospital.\n\nTony has received several prestigious recognitions, including being a Rise Fellow at Schmidt Futures, where he completed a fully-funded summer intensive in London/Oxford and founded the Rise North America Union. During his high school years at Amador Valley High School, he was the Salutatorian, a Coca-Cola Scholar, a National Merit Scholar, won two gold medals with Kungfu Team USA, and was an ISEF Finalist.\n\nBeyond his academic and professional pursuits, Tony has demonstrated a commitment to community service as the Founder and President of the Alameda County Science and Engineering Fair and as a Teaching Facilitator for Non-Trivial."
}