{
    "id": "trishalaneeraj",
    "name": "Trishala Neeraj",
    "profile_pic": "https://media.licdn.com/dms/image/v2/C5603AQHH0b3sQewjQw/profile-displayphoto-shrink_200_200/profile-displayphoto-shrink_200_200/0/1525900725969?e=2147483647&v=beta&t=kyhSGHeCaXzb51IvUgXipIwWntEj5WDvpRspxhqp5H0",
    "links": [
        "https://trishalaneeraj.github.io/about/",
        "https://medium.com/@tn338",
        "https://twitter.com/trishalaneeraj",
        "https://www.linkedin.com/in/trishalaneeraj/",
        "https://scholar.google.com/citations?hl=en&user=X2lSWUQAAAAJ"
    ],
    "short_description": "Trishala Neeraj is a Machine Learning Researcher and Engineer at CyberCube with a strong academic background from Cornell University. She specializes in computer vision and natural language processing, bringing technical expertise to cybersecurity analytics and has contributed to several influential AI research papers.",
    "long_description": "Trishala Neeraj is a San Francisco-based Machine Learning Researcher and Engineer at CyberCube, where she applies her expertise to deliver cyber-risk analytics to the global cyber-insurance market. She works with terabyte-scale data to develop models using Deep Learning and Matrix Factorization techniques, with a particular focus on language data and models.\n\nHer academic foundation was built at Cornell University, where she graduated in 2018 after focusing on Machine Learning and Natural Language Processing during her graduate studies. She also holds a Bachelor of Engineering degree from BITS Pilani, India, and spent time as a visiting research scholar at the Predictive Technology Lab at the University of Virginia.\n\nTrishala has made significant contributions to the AI research community, co-authoring several highly influential papers including \"BLOOM: A 176B-Parameter Open-Access Multilingual Language Model\" (2022), \"Multitask Prompted Training Enables Zero-Shot Task Generalization\" (2021), and \"Beyond the Imitation Game: Quantifying and extrapolating the capabilities of language models\" (2022). Her work on \"BigBIO: A Framework for Data-Centric Biomedical Natural Language Processing\" (2022) has also gained recognition in the field.\n\nHer professional experience includes a summer internship at BuzzFeed in 2017, where she worked on a project using K-Means Clustering to tag over 14,000 BuzzFeed quizzes, which she documented in a blog post on the BuzzFeed Tech Blog. She has also published research on \"A Computational Approach to Perceived Trustworthiness of Airbnb Host Profiles\" (2017) and \"Longitudinal Analysis of Cyber-Related Articles\" (2020).\n\nBeyond her technical work, Trishala has been actively involved in the tech community. She represented the student body at the Cornell Tech Campus Dedication ceremony in August 2017 and moderated a conversation with Eric Schmidt in March 2018. She maintains a personal blog where she documents her research projects on topics like Weak Supervision, Feature-based Approaches with BERT, and Semantic Entailment.\n\nTrishala is bilingual, with native proficiency in both English and Hindi, which enhances her ability to work in diverse teams and global environments. Her involvement with organizations like Women in Machine Learning and Data Science (WiMLDS) demonstrates her commitment to the broader AI community and diversity in tech."
}