{
    "id": "ttrouwen",
    "name": "Tristan Trouwen",
    "profile_pic": "https://media.licdn.com/dms/image/v2/D4E03AQFRb9eXaQBzbg/profile-displayphoto-shrink_200_200/B4EZSaUNfOG0Ag-/0/1737755778056?e=2147483647&v=beta&t=-UHQsn88Z2ruw4734Nrpy6P4c0pKjEJZJ3aNG2Iu5Og",
    "links": [
        "https://github.com/trirpi",
        "https://www.linkedin.com/in/ttrouwen/",
        "https://www.fromscribbletoreadable.com"
    ],
    "short_description": "Tristan Trouwen is a researcher and software engineer affiliated with d-Matrix and Eindhoven University of Technology, with expertise in AI, algorithms, and compiler optimization. His research explores the interaction between automated systems and humans in software development environments, and he has been recognized with the ALSP Scholarship for academic excellence.",
    "long_description": "Tristan Trouwen is a promising researcher at the intersection of software engineering and artificial intelligence, currently affiliated with d-Matrix and Eindhoven University of Technology. His research interests are evidenced by his publication \"Between JIRA and GitHub: ASFBot and its Influence on Human Comments in Issue Trackers\" (IEEE, 2022), which explores how automated systems interact with and influence human behavior in software development environments.\n\nTristan's academic excellence has been recognized through the Amandus H. Lundqvist Scholarship Program (ALSP), a merit-based scholarship that includes a tuition waiver and monthly stipend. This prestigious award highlights his standing as a top student in his field.\n\nAs an AI Software Architecture Intern at d-Matrix, a series A deep tech startup recognized by Business Insider as one of the 13 most promising AI startups, Tristan worked on optimizing compilers. He applied his algorithmic knowledge from his master's studies to improve existing algorithms, making the platform faster and more power-efficient. This experience allowed him to deepen his understanding of chip architecture and compilers while working in a highly intercultural team environment.\n\nBeyond his technical work, Tristan has demonstrated entrepreneurial initiative through his project \"From Scribble To Readable,\" a book he co-created with fellow student Lourens Touwen to help people write mathematical symbols legibly. The project began when they noticed the difficulty in deciphering their professor's handwriting during an Analysis lecture. They designed practice pages for common mathematical symbols, created promotional videos, and launched a successful Kickstarter campaign to publish the book.\n\nTristan has also demonstrated leadership capabilities through his role as Board Treasurer for E.S.D.A. Chronos from May 2019 to May 2020. He is also a member of Nova (since November 2022), suggesting continued engagement with professional or academic organizations.\n\nHis background combines strong computational methods and software engineering expertise, with a particular interest in how automated systems and human users interact in technical environments - a crucial area for advancing AI systems that can effectively collaborate with human operators. Tristan is fluent in Dutch (native proficiency) and English (full professional proficiency), enabling him to collaborate effectively in international research and development environments."
}