{
    "id": "vaibhavi-jhawar",
    "name": "Vaibhavi J.",
    "profile_pic": "https://media.licdn.com/dms/image/v2/C5603AQGhP60WPnhEnw/profile-displayphoto-shrink_200_200/profile-displayphoto-shrink_200_200/0/1587419963265?e=2147483647&v=beta&t=PyeZNunHXrOgIEtTxMkfGe0itawxwRGR0VpkF8wQaJU",
    "contacts": [
        "716 followers",
        "500+ connections"
    ],
    "links": [
        "https://www.linkedin.com/in/vaibhavi-jhawar"
    ],
    "short_description": "Recent CS graduate with a Data Science minor from Cal Poly Pomona. Currently working as a Machine Learning and Product Management Intern at a Stealth Startup. Passionate about product innovation with experience in machine learning, data science, and frontend development.",
    "long_description": "Vaibhavi J. (pronounced vay-bh-vee) is a recent Computer Science graduate from California State Polytechnic University-Pomona with a minor in Data Science. She is currently working as a Machine Learning and Product Management Intern at a Stealth Startup in the San Francisco Bay Area.\n\nHer professional experience includes working as an Autonomy Intern at Monarch Tractor, where she contributed to autonomous tractor technology. She also served as a Data Science Intern at Assembled Brands, where she analyzed year-on-year revenue schemas of companies to identify potential investments and performed data wrangling using Big Query, Google Drive, Google Collab, and Python.\n\nVaibhavi has demonstrated her technical skills as a Frontend Developer for the Northrop Grumman Collaboration Project, where she constructed a GUI for the Ground Control Station using Vue.js, designed an intuitive user interface using Figma, and integrated with the back-end to ensure real-time data updates.\n\nDuring her academic career, she was actively involved in various organizations, including Alpha Kappa Psi (Chi Epsilon Chapter) where she served as VP of Professional Development and Director of Professional Advancement. She was also a founding member and held multiple leadership positions in Tamanna, including President, Treasurer, Team Captain, and Publicist.\n\nVaibhavi has volunteered at Tri City Food Bank and Thrift Store and as a tutor at Mission Valley Tutoring. She describes herself as curious about all things tech and enjoys photography, exploring different cuisines, and playing badminton in her free time. She is passionate about personal and professional development and values learning from others."
}