{
    "id": "vaibhavi-jhawar",
    "name": "Vaibhavi J.",
    "profile_pic": "https://media.licdn.com/dms/image/v2/C5603AQGhP60WPnhEnw/profile-displayphoto-shrink_200_200/profile-displayphoto-shrink_200_200/0/1587419963265?e=2147483647&v=beta&t=PyeZNunHXrOgIEtTxMkfGe0itawxwRGR0VpkF8wQaJU",
    "links": [
        "https://www.linkedin.com/in/vaibhavi-jhawar"
    ],
    "short_description": "Recent Computer Science graduate with a minor in Data Science from Cal Poly Pomona, currently working as a Machine Learning and Product Management Intern at a stealth startup. Vaibhavi combines technical expertise in ML, data science, and frontend development with product innovation skills, demonstrated through diverse internships at Monarch Tractor and Assembled Brands.",
    "long_description": "Vaibhavi is a recent Computer Science graduate from California State Polytechnic University-Pomona with a minor in Data Science. She describes herself as curious about all things tech and passionate about product innovation, currently working as a Machine Learning and Product Management Intern at a stealth startup in the San Francisco Bay Area.\n\nHer professional experience spans multiple domains within tech. At Monarch Tractor, she worked as an Autonomy Intern, contributing to autonomous agricultural technology. As a Data Science Intern at Assembled Brands, she performed prescriptive analysis of year-on-year revenue schemas to identify potential investments and conducted data wrangling using Big Query, Google Drive, Google Collab, and Python to prepare clean data for regression analysis.\n\nVaibhavi also has frontend development experience, having built a GUI for a Ground Control Station using Vue.js during her time with the Northrop Grumman Collaboration Project. There, she designed an intuitive user interface using Figma specifically optimized for emergency situations and integrated it with backend systems to ensure real-time data updates.\n\nBeyond her technical roles, Vaibhavi has demonstrated leadership as the VP of Professional Development for Alpha Kappa Psi and has held multiple leadership positions in Tamanna, including President, Treasurer, Team Captain, Publicist, and Founding Member. She also served as a Student Success Ambassador at Cal Poly Pomona, where she facilitated campus resources for over 1,500 students and increased student engagement on social media platforms.\n\nHer multifaceted background combines technical expertise in machine learning, data science, and frontend development with product innovation skills, making her well-suited for roles at the intersection of technology and product development. Outside of her professional pursuits, Vaibhavi enjoys photography, exploring different cuisines, and playing badminton."
}