{
    "id": "vijay-kumaravelrajan",
    "name": "Vijay Kumaravelrajan",
    "profile_pic": "https://media.licdn.com/dms/image/v2/D5603AQGOskBhJsGiCg/profile-displayphoto-shrink_200_200/profile-displayphoto-shrink_200_200/0/1664345545420?e=2147483647&v=beta&t=IH-HfyXAy2sCni8_6YGnXWvXM7zhM0clc6_neaa8B0s",
    "links": [
        "https://jaykr.dev",
        "https://www.jargonlearn.com/"
    ],
    "short_description": "Vijay is a junior at USC studying Math and Computer Science, where he serves as a Project Lead at USC's Center for AI in Society. His research spans inference-time compute scaling for LLM language translation, robotic manipulation, and 6G wireless technology. As a co-founder of Jargon, he's building an LLM-powered language learning Chrome extension.",
    "long_description": "Vijay Kumaravelrajan is a junior at the University of Southern California pursuing a Bachelor of Science in Mathematics and Computer Science. As a Trustee Scholar and Viterbi Fellow, he has established himself as a multifaceted researcher and entrepreneur in the AI space.\n\nAt USC's Center for AI in Society (CAIS++), Vijay currently leads a team of five researchers focused on inference-time compute scaling for LLM language translation, where they're achieving superior pass@k performance under tighter inference budgets compared to larger models. His work involves implementing and analyzing various inference-time scaling strategies including best-of-n approaches, tree search with PRMs, and Chain of Thought with reinforcement learning. Previously at CAIS++, he conducted research in robotic manipulation through collaboration with USC's SLURM lab, implementing environment simulations using MuJoCo and ManiSkill with Gymnasium for reinforcement learning training. He has also served as a Curriculum Lead, mentoring underclassmen through practical ML projects and teaching comprehensive curriculum covering neural networks, classical ML, NLP, computer vision, transformers, and generative modeling.\n\nBeyond his academic research, Vijay co-founded Jargon, a startup developing a Chrome extension that transforms everyday browsing into language learning opportunities powered by large language models. His entrepreneurial venture demonstrates his ability to apply AI technologies to practical educational tools.\n\nSince August 2022, Vijay has been a Directed Researcher at USC's WiDES Lab, where he collaborates with PhD leads and a team of graduate and undergraduate researchers. His work includes designing and optimizing ray tracers for 6G wireless installations and using convolutional neural networks alongside traditional algorithms to detect edges in point cloud data. He implements C++ libraries in Python and MATLAB, showcasing his versatility across programming languages.\n\nEarlier in his academic career, Vijay worked as a Research Assistant at Scholar Launch, conducting research on open star clusters under the guidance of a professor from UT Austin. He created generalizable algorithms for determining the age of any star cluster of interest using Python.\n\nVijay has demonstrated his programming skills in competitive settings, participating in the Fall 2024 USC Programming Contest where he successfully solved the \"5-Mile Hike\" problem using Python. He also contributed to the \"Gen-AI for Multi-Agent Deformable Object Manipulation\" project at CAIS++, working alongside other researchers to advance robotic manipulation of deformable objects like bread and clothing. This project integrated various robotic platforms including ALOHA and Baxter into the MuJoCo simulation environment using Robosuite, setting up bimanual configurations to explore different arm controllers.\n\nOutside of his AI and computer science pursuits, Vijay is involved with USC's Rocket Propulsion Lab as a General Member focusing on simulations. He achieved the rank of Eagle Scout with Boy Scout Troop 1776 and graduated with an IB Diploma, demonstrating his well-rounded capabilities and leadership potential.\n\nVijay's personal website (jaykr.dev) features his projects and writing, reflecting his passion for discovering and building new technologies at the intersection of mathematics, computer science, and artificial intelligence."
}