{
    "id": "vijay-kumaravelrajan",
    "name": "Vijay Kumaravelrajan",
    "profile_pic": "https://media.licdn.com/dms/image/v2/D5603AQGOskBhJsGiCg/profile-displayphoto-shrink_200_200/profile-displayphoto-shrink_200_200/0/1664345545420?e=2147483647&v=beta&t=IH-HfyXAy2sCni8_6YGnXWvXM7zhM0clc6_neaa8B0s",
    "contacts": [
        "vijay-kumaravelrajan@linkedin.com"
    ],
    "links": [
        "https://jaykr.dev",
        "https://www.jargonlearn.com/"
    ],
    "short_description": "Junior at USC studying Math and Computer Science. Trustee Scholar and Viterbi Fellow with experience in machine learning research, particularly at USC's Center for AI in Society. Co-founder of Jargon, a language learning Chrome extension powered by LLMs.",
    "long_description": "Vijay Kumaravelrajan is a junior at the University of Southern California pursuing a Bachelor of Science in Mathematics and Computer Science. As a Trustee Scholar and Viterbi Fellow, he has demonstrated exceptional academic achievement.\n\nVijay currently serves as a Project Lead at USC's Center for AI in Society's Student Branch (CAIS++), where he leads a team researching inference-time compute scaling for LLM language translation. He previously held roles as Curriculum Lead and Machine Learning Researcher within the same organization, mentoring underclassmen and conducting research in robotic manipulation.\n\nIn September 2023, Vijay co-founded Jargon, a Chrome extension that transforms browsing into language learning using LLMs. He has also worked as a Directed Researcher at USC's WiDES Lab since August 2022, collaborating with PhD leads on ray tracing for 6G wireless installations and implementing CNN-based edge detection in point cloud data.\n\nHis research experience extends to his time as a Research Assistant at Scholar Launch, where he conducted research on open star clusters and developed generalizable algorithms for determining star cluster age using Python.\n\nVijay is an accomplished student with numerous accolades, including being a National Merit Scholar, AP Scholar, and Eagle Scout. He graduated from The Quarry Lane School with an IB Diploma and a 4.86 GPA. His SAT score was an impressive 1590.\n\nBeyond his academic and professional pursuits, Vijay is passionate about discovering and building new things, as evidenced by his involvement with USC's Rocket Propulsion Lab as a General Member focusing on Simulations."
}