{
    "id": "vijay-sundarapandiyan",
    "name": "Vijaykaarti Sundarapandiyan",
    "profile_pic": "https://media.licdn.com/dms/image/v2/D4E03AQHlK5CxA501aA/profile-displayphoto-shrink_200_200/profile-displayphoto-shrink_200_200/0/1669788057709?e=2147483647&v=beta&t=EbQKYKYRWoQmKcfcCh3sHWDh3vwY-GmBiYijmSUabgs",
    "contacts": [
        "vsundar1@umd.edu"
    ],
    "links": [
        "https://www.linkedin.com/in/vijay-sundarapandiyan/"
    ],
    "short_description": "Computer Science and Mathematics student at the University of Maryland with experience in computer vision, machine learning, and high-performance computing. Currently working as a Technical Advisor Intern at Scale AI and conducting research on Large Language Models at UMD.",
    "long_description": "Vijaykaarti Sundarapandiyan is a Computer Science and Mathematics student at the University of Maryland with diverse technical experience across research, industry, and academic projects. His professional journey includes roles at Scale AI, where he works on code reasoning models for Olympiad-level competitive programming problems, and Uber, where he contributed to software networking infrastructure with Envoy proxy.\n\nHis research background is extensive, currently working with Dr. Tom Goldstein on Large Language Models at UMD, and previously researching computer vision with Dr. Jia-Bin Huang. He has also gained valuable experience as a Machine Learning Engineering Intern at Johns Hopkins University Applied Physics Laboratory and NonExomics, where he worked on deep learning models for cancer prediction.\n\nVijaykaarti has demonstrated leadership as the Lead Architect at Smith Investment Fund, developing automated trading platforms, and as a Software Engineer at Hack4Impact, creating web applications for nonprofit organizations. His academic achievements include being an ICPC Mid-Atlantic Regionals 7th place finisher, an ICLR 2023 Notable TinyPaper recipient, and publishing research on efficient pruning techniques for massive language models.\n\nHis educational background includes pursuing dual B.S. degrees in Computer Science and Mathematics at the University of Maryland, with an impressive high school record including a 1590/1600 SAT score and perfect scores on multiple AP exams. He is multilingual, with native proficiency in English and Tamil, and professional working proficiency in Spanish.\n\nVijaykaarti's interests span computer vision, concurrent and high-performance computing, networks, quantitative finance, and large model efficiency. His accomplishments also include being an Eagle Scout, Presidential Scholar Candidate, National Merit Finalist, and recipient of the UKG Global Scholarship."
}