{
    "id": "vijay-sundarapandiyan",
    "name": "Vijaykaarti Sundarapandiyan",
    "profile_pic": "https://media.licdn.com/dms/image/v2/D4E03AQHlK5CxA501aA/profile-displayphoto-shrink_200_200/profile-displayphoto-shrink_200_200/0/1669788057709?e=2147483647&v=beta&t=EbQKYKYRWoQmKcfcCh3sHWDh3vwY-GmBiYijmSUabgs",
    "links": [
        "vsundar1@umd.edu",
        "https://www.linkedin.com/in/vijay-sundarapandiyan/"
    ],
    "short_description": "Computer Science and Mathematics student at UMD with diverse expertise in computer vision, high-performance computing, and quantitative finance. Currently researching LLMs under Dr. Tom Goldstein while interning at Scale AI for code reasoning models. Published work on efficient pruning techniques for massive language models at ICLR 2023.",
    "long_description": "Vijaykaarti Sundarapandiyan is a Computer Science and Mathematics double major at the University of Maryland with a multifaceted background in AI research and software engineering. His technical interests span computer vision, concurrent and high-performance computing, networks, quantitative finance, and large model efficiency.\n\nCurrently, Vijaykaarti serves as a Technical Advisor Intern at Scale AI, where he works on code reasoning models for Olympiad-level competitive programming problems. Simultaneously, he conducts research on Large Language Models under Dr. Tom Goldstein at UMD. His research contributions include a notable paper on efficient pruning techniques for massive language models, recognized as a Notable TinyPaper at ICLR 2023, which has been cited 13 times since publication.\n\nVijaykaarti's professional experience is extensive for a student. He completed a software engineering internship at Uber, focusing on networking infrastructure with Envoy proxy. He also worked as a Machine Learning Engineering Intern at Johns Hopkins University Applied Physics Laboratory and at NonExomics, where he developed deep learning models for cancer prediction over a two-year period.\n\nWithin the UMD community, Vijaykaarti serves as Senior Quantitative Analyst and Lead Architect for the Smith Investment Fund's automated trading platform. He previously conducted computer vision research under Dr. Jia-Bin Huang. He has also contributed to social impact initiatives as a Software Engineer at Hack4Impact, developing web applications for nonprofit organizations.\n\nHis technical prowess is further evidenced by his competitive programming achievements, including participation in the ICPC NA South Division 2024 as part of the UMD GOATS team alongside Mazin Karjikar and Spencer Lutz. He has also competed at the ICPC Mid-Atlantic Regionals, where he previously placed 7th.\n\nBeyond technical skills, Vijaykaarti is multilingual, with native proficiency in English and Tamil, and professional working proficiency in Spanish. His academic excellence is reflected in his numerous accolades, including being a Presidential Scholar Candidate, National Merit Finalist, and recipient of the UKG Global Scholarship. His community engagement is demonstrated through his Eagle Scout achievement and multiple Silver President's Volunteer Service Awards for significant community service hours."
}