{
    "id": "vineeth-vajipey",
    "name": "Vineeth Vajipey",
    "profile_pic": "https://media.licdn.com/dms/image/v2/D4E03AQGO0QbpXlFIAQ/profile-displayphoto-shrink_200_200/profile-displayphoto-shrink_200_200/0/1704809517536?e=2147483647&v=beta&t=6GLD_KgEt8k_mdomaggkOB93V8_F0-NGuLgUUeL8igU",
    "links": [
        "https://arxiv.org/abs/2410.02052",
        "https://scholar.google.com/citations?user=xiKrcQgAAAAJ&hl=en&oi=ao",
        "https://github.com/vineethvajipey",
        "https://www.linkedin.com/in/vineeth-vajipey/",
        "https://devpost.com/VineethVajipey"
    ],
    "short_description": "Vineeth Vajipey is an NLP Researcher and MS CS student at Columbia University specializing in natural language processing and AI agents. With experience in autonomous vehicles and machine learning research, he has contributed to the field through his work on exploratory learning for AI agents and has won multiple hackathon awards including Overall 1st Place at PennApps.",
    "long_description": "Vineeth Vajipey is a Master of Science student in Computer Science at Columbia University, specializing in Natural Language Processing. Currently working as an NLP Researcher at Columbia's Speech and Dialog Lab, he is advised by Xiao Yu, Qingyang Wu, and Zhou Yu, focusing on research related to Large Language Models (LLMs) and AI agents.\n\nHis academic journey includes a Bachelor of Science degree from the University of Maryland, where he graduated with an impressive 3.98/4.0 GPA. During his undergraduate years, he was involved in various research initiatives including FIRE: Capital One Machine Learning, RAAS Lab, and Gomez Lab. He also contributed to education as a Teaching Assistant for ENEE205/101 and as an instructor for CMSC389F STIC.\n\nVineeth's professional experience spans across diverse organizations. He is currently interning as a Software Engineer at The D. E. Shaw Group (May 2024 - Aug 2024). Previously, he worked as a Software Engineer at Swingtech for nearly three years (Aug 2021 - May 2024). His research experience includes roles as an Autonomous Vehicles Researcher at Istanbul Technical University (Summer 2023) and as a Machine Learning Researcher at Maryland Robotics Center (Summer 2022). He also completed a Software Engineering internship at CB Insights in Summer 2021.\n\nHis research contributions include a significant publication titled \"Improving Autonomous AI Agents with Reflective Tree Search and Self-Learning\" (also known as \"ExACT: Teaching AI Agents to Explore with Reflective-MCTS and Exploratory Learning\"), which was accepted at the International Conference on Learning Representations (ICLR). This work, co-authored with researchers including Xiao Yu, Baolin Peng, Hao Cheng, Michel Galley, Jianfeng Gao, and Zhou Yu, introduces Reflective Monte Carlo Tree Search (R-MCTS), a novel algorithm designed to enhance AI agents' ability to explore decision spaces. The research has garnered attention in the field, with multiple citations since its publication.\n\nAnother notable publication is \"GATSBI: An online GTSP-based algorithm for targeted surface bridge inspection,\" which demonstrates his work in robotics and autonomous systems.\n\nVineeth has demonstrated exceptional skills in hackathons, winning Overall 1st Place and the Wolfram Research Award at PennApps Fall 2023 for a project called CharactAR, an augmented reality customizable chat companion. He also placed 4th Overall at PennApps Fall 2020 with Air Synth and won Best Hack for Resilience at PennApps Fall 2019 with Prophet Profit.\n\nDuring his undergraduate years at the University of Maryland, Vineeth was recognized for his creativity and innovation. He developed various projects including an app for a smart vending machine with facial recognition, a device that adjusts the brightness and color of lights based on hand gestures, and a game where musicians guess musical notes. He also contributed to developing a software platform for a waste management company in India, integrating thousands of informal recyclers into the supply chain to help cities manage waste more effectively.\n\nHis diverse experience across software engineering, research in NLP, autonomous vehicles, and machine learning, combined with his academic excellence and hackathon achievements, showcases his versatility and innovative approach to solving complex problems in the field of artificial intelligence."
}