{
    "id": "vineeth-vajipey",
    "name": "Vineeth Vajipey",
    "profile_pic": "https://media.licdn.com/dms/image/v2/D4E03AQGO0QbpXlFIAQ/profile-displayphoto-shrink_200_200/profile-displayphoto-shrink_200_200/0/1704809517536?e=2147483647&v=beta&t=6GLD_KgEt8k_mdomaggkOB93V8_F0-NGuLgUUeL8igU",
    "contacts": [
        "vineeth-vajipey@linkedin.com"
    ],
    "links": [
        "https://www.linkedin.com/in/vineeth-vajipey/"
    ],
    "short_description": "Vineeth Vajipey is a Master's student in Computer Science at Columbia University specializing in Natural Language Processing. He has experience as an NLP Researcher at Columbia and previously worked as a Software Engineer at Swingtech for nearly 3 years. He has also completed internships at The D. E. Shaw Group and has research experience in autonomous vehicles and machine learning.",
    "long_description": "Vineeth Vajipey is currently pursuing a Master of Science in Computer Science at Columbia University with a specialization in Natural Language Processing, maintaining a perfect 4.0 GPA. He is conducting research on LLMs and agents under the advisement of Xiao Yu, Qingyang Wu, and Zhou Yu at the Speech and Dialog Lab.\n\nHis professional experience includes working as an NLP Researcher at Columbia University since August 2023, and he recently completed a Software Engineering internship at The D. E. Shaw Group during Summer 2024. Prior to his graduate studies, Vineeth worked as a Software Engineer at Swingtech for nearly 3 years (August 2021 to May 2024) in Greenbelt, Maryland.\n\nVineeth has diverse research experience, having worked as an Autonomous Vehicles Researcher at Istanbul Technical University in Turkey (Summer 2023) and as a Machine Learning Researcher at the Maryland Robotics Center (Summer 2022). He also completed a Software Engineering internship at CB Insights in New York during Summer 2021.\n\nHis academic background includes a Bachelor of Science from the University of Maryland (2019-2023) where he graduated with an impressive 3.98/4.0 GPA. During his undergraduate studies, he was involved in various research initiatives including FIRE: Capital One Machine Learning, RAAS Lab, and Gomez Lab. He also served as a teaching assistant for ENEE205/101 and as an instructor for CMSC389F STIC.\n\nVineeth has demonstrated excellence in competitive environments, winning first place overall and the Wolfram Research Award at PennApps (Fall 2023) for his project CharactAR. He also placed 4th overall at PennApps (Fall 2020) for Air Synth and won the Best Hack for Resilience award at PennApps (Fall 2019) for Prophet Profit.\n\nHis research has been published in prestigious venues, with his paper \"ExACT: Teaching AI Agents to Explore with Reflective-MCTS and Exploratory Learning\" accepted at the International Conference on Learning Representations (ICLR) for January 2025."
}