{
    "id": "vishal-nandakumar-751715352",
    "name": "Vishal Nandakumar",
    "profile_pic": "https://static.licdn.com/aero-v1/sc/h/9c8pery4andzj6ohjkjp54ma2",
    "links": [
        "https://www.linkedin.com/in/vishal-nandakumar-751715352",
        "https://github.com/VishalNandakumar",
        "https://www.linkedin.com/in/n-vishal"
    ],
    "short_description": "Vishal Nandakumar is a freshman student at the Massachusetts Institute of Technology with research experience in quantum physics, specifically in hydrodynamic quantum field theory analogs. He graduated from Thomas Jefferson High School for Science and Technology, one of the nation's premier STEM-focused high schools.",
    "long_description": "Vishal Nandakumar is currently pursuing his undergraduate studies at the Massachusetts Institute of Technology (MIT), where he enrolled in 2024 and is expected to graduate in 2027. Prior to MIT, Vishal attended Thomas Jefferson High School for Science and Technology from 2020 to 2024, which is widely recognized as one of the top STEM-focused high schools in the United States.\n\nDuring his time at Thomas Jefferson, Vishal demonstrated exceptional aptitude in physics and quantum mechanics. He was involved in a significant research project at the Q Lab focused on \"Hydrodynamic Quantum Field Theory Analogs\" alongside collaborators Pranav Panicker and Kai Wang. This project explored hydrodynamic quantum field theory, a model of quantum dynamics inspired by Louis de Broglie's double-solution pilot wave theory. Their research involved physically modeling superwalking droplets and pilot wave theory in a silicone oil bath, and extending the two-dimensional form of the hydrodynamic pilot wave to three dimensions by exploring free particles, harmonic oscillators, and other quantum analogs. They also investigated the possible link between non-Markovian dynamics of physical pilot wave systems and nonlocality in quantum systems.\n\nAs a developer, Vishal maintains a GitHub presence where he has contributed to projects including \"konnecthru\" (a JavaScript project) and \"Formalin_Predictions_in_Fruits\" (a Python project). These repositories demonstrate his programming skills across different languages and domains.\n\nAt MIT, Vishal is continuing to build on his strong foundation in STEM fields, particularly in physics and quantum mechanics. His research experience and technical skills position him well for further exploration in quantum physics, computational modeling, and related fields that align with MIT's strengths in these areas."
}