{
    "id": "vivek-vajipey",
    "name": "Vivek Vajipey",
    "profile_pic": "https://media.licdn.com/dms/image/v2/D5603AQET6mgXE42DNw/profile-displayphoto-shrink_200_200/profile-displayphoto-shrink_200_200/0/1719107890138?e=2147483647&v=beta&t=oycbSSqTgvtWznKQ1MSh1Ut2y48zsfE21OMiOOk7uS4",
    "links": [
        "https://www.mdpi.com/2072-4292/15/17/4123",
        "https://arxiv.org/abs/2411.06590",
        "https://vivekvajipey.github.io/",
        "http://explainai.pro/",
        "https://devpost.com/software/worlddex-6diekg"
    ],
    "short_description": "Vivek Vajipey is a Computer Science student at Stanford University pursuing both Bachelor's and Master's degrees with a minor in Geophysics. His research at Stanford Artificial Intelligence Laboratory (SAIL) focuses on reasoning in large language models, while his previous work applied machine learning to agricultural remote sensing. He has developed innovative AI applications including ExplainAI, CriticAL, and WorldDex, winning awards at major hackathons like PennApps XXIV and Cal Hacks 10.0.",
    "long_description": "Vivek Vajipey is pursuing both a Bachelor's and Master's degree in Computer Science at Stanford University, with a minor in Geophysics. His academic journey reflects a deep interest in the intersection of artificial intelligence and practical applications.\n\nAt the Stanford Artificial Intelligence Laboratory (SAIL), Vivek researches reasoning capabilities in large language models through the Computation & Cognition Lab. His work in AI extends beyond theoretical research - he has recently co-authored \"CriticAL: Critic Automation with Language Models,\" demonstrating his contribution to advancing LLM technologies.\n\nVivek has developed several notable AI projects. ExplainAI, a conversational tool that helps users better understand what they're reading, showcases his interest in making AI more accessible and educational. His WorldDex project, described as \"a Pokédex for the real world,\" won the Best Web3 Hack award at Cal Hacks 10.0 by using computer vision and LLMs to identify and interact with real-world objects. He also won first place at PennApps XXIV for developing CharactAR, an interactive experience combining generative AI with augmented reality.\n\nPrior to his current research focus, Vivek worked at Stanford's Lobell Lab applying machine learning techniques to remote sensing data for agricultural applications. This work contributed to a significant publication titled \"Annual field-scale maps of tall and short crops at the global scale using GEDI and Sentinel-2,\" published in Remote Sensing in 2023. As a co-author alongside researchers Stefania Di Tommaso, Sherrie Wang, and others, Vivek helped develop a method that combines NASA's GEDI lidar data with Sentinel-2 satellite imagery to create global maps distinguishing between tall and short crops at 10m resolution. This research has been cited 11 times according to Google Scholar, highlighting its impact in the field of agricultural remote sensing.\n\nHis professional experience includes a fellowship at True Ventures and a software engineering role at Swingtech. Within the Stanford community, Vivek served as VP of Events for the Stanford Energy Club, further demonstrating his leadership capabilities and interest in energy-related challenges.\n\nVivek's academic excellence was evident early in his career when he earned a Silver Medal at the International Earth Science Olympiad, highlighting his aptitude for scientific problem-solving from a young age. His contact email is vvajipey@stanford.edu."
}