{
    "id": "yafework",
    "name": "Yeabsera Afework",
    "profile_pic": "https://static.licdn.com/aero-v1/sc/h/9c8pery4andzj6ohjkjp54ma2",
    "links": [
        "https://www.linkedin.com/in/yafework",
        "https://profiles.stanford.edu/yeabsera-afework"
    ],
    "short_description": "Computer Science and Mathematics student at Stanford University with extensive game development experience. Co-founder of 646 Studios and former Software Engineer at Microsoft, specializing in user authentication systems and facial recognition technology. First-generation college student from Ethiopia with a passion for technology and community service.",
    "long_description": "Yeabsera Afework is a Computer Science and Mathematics student at Stanford University with a diverse background spanning game development, software engineering, and entrepreneurship. As the co-founder of 646 Studios, Yeabsera has developed three successful video games that amassed over 200,000 community members and achieved 9,000+ concurrent players on release. This entrepreneurial venture led to contracts with major brands like Gen G and Crocs, where Yeabsera's work boosted concurrent players by 5,000+.\n\nAt Microsoft, Yeabsera worked as a Software Engineer designing the backend client for the company's first in-house user authentication system, leveraging facial recognition and AI-based liveness verification to enhance security protocols. The role also involved developing secure clients in C# and creating metric dashboards in KustoQL to help on-call engineers identify bugs and outages.\n\nYeabsera's game development expertise extends to RB Battles LLC, where they designed immersive 3D environments using Blender and Adobe Substance Painter, leading a team of 3D artists to create game elements that attracted over 100,000 concurrent players. Their implementation of efficient workflow strategies accelerated project completion by 20%.\n\nOriginally from Ethiopia, Yeabsera moved to Spokane, Washington at the age of 10 and attended All Saints Catholic School before graduating from Gonzaga Preparatory School. At Gonzaga Prep, Yeabsera was recognized as a Salutatorian, placing in the second-highest academic group in the graduating class. He was also a recipient of the Mike Shanks scholarship, which supported his education at Gonzaga Prep.\n\nYeabsera has been actively involved in community service through Gonzaga Prep's Knights of the Leash program, particularly providing after-school tutoring at his former elementary school, All Saints Catholic School. His AP calculus teacher, Stephen Manfred, described him as an outgoing student with a great personality who \"brings joy to the people around him\" and \"interacts with his peers really well.\"\n\nAs a first-generation university student, Yeabsera is involved with ColorStack, a tech nonprofit that creates academic and professional opportunities for Black and Latinx students entering STEM fields. At Stanford, he benefits from programs designed to support first-generation, low-income (FLI) students in their transition to college life.\n\nAcademically, Yeabsera has taken courses in Computer Systems, Design and Analysis of Algorithms, Infrastructure at Scale, Mathematical Foundations of Computer Science, Operating System Principles, Probability for Computer Scientists, and Programming Abstractions and Methodologies at Stanford.\n\nYeabsera has also participated in selective development programs, including the HeadStart Fellowship for diverse students with outstanding leadership potential, and Jane Street's UNBOXED Scholar program, where they gained experience in quantitative trading through probability, statistics, and game theory challenges.\n\nCurrently, Yeabsera is set to join LinkedIn as a Software Engineer for Summer 2025, continuing to build on their impressive technical foundation and entrepreneurial spirit with the long-term goal of establishing a career in the tech industry."
}