{
    "id": "yafework",
    "name": "Yeabsera Afework",
    "profile_pic": "https://static.licdn.com/aero-v1/sc/h/9c8pery4andzj6ohjkjp54ma2",
    "contacts": [
        "LinkedIn: https://www.linkedin.com/in/yafework"
    ],
    "links": [
        "https://www.linkedin.com/in/yafework"
    ],
    "short_description": "Computer Science and Mathematics student at Stanford University with a 4.0 GPA. Software Engineer at LinkedIn (Summer '25) and previously at Microsoft. Co-founder of 646 Studios, developing video games with over 200,000 community members. Passionate about software engineering, game development, and technology.",
    "long_description": "Yeabsera Afework is a Computer Science and Mathematics student at Stanford University (2023-2027) maintaining a perfect 4.0 GPA. He has secured a Software Engineering internship at LinkedIn for Summer 2025 and previously worked at Microsoft as a Software Engineer, where he designed the backend client for their first in-house user authentication system and leveraged facial recognition and AI-based liveness verification technologies.\n\nAs the Co-Founder and Game Developer at 646 Studios since September 2019, Yeabsera has developed three video games that amassed over 200,000 community members and 9,000+ concurrent players on release. He has also contracted with major brands like Gen G and Crocs to develop games, boosting their concurrent players by 5,000+. His implementation of user engagement and social media dashboards increased server activity by 30% and social traffic by 40%.\n\nYeabsera also worked as a Game Developer at RB Battles LLC, where he designed immersive 3D environments and assets using Blender and Adobe Substance Painter, led a team of 3D artists, and implemented efficient workflow strategies that accelerated project completion by 20%.\n\nHis educational background includes coursework in Computer Systems, Design and Analysis of Algorithms, Infrastructure at Scale, Mathematical Foundations of Computer Science, Operating System Principles, Probability for Computer Scientists, and Programming Abstractions and Methodologies. He graduated from Gonzaga Preparatory School with a High School Diploma (2019-2023) before attending Stanford.\n\nYeabsera has participated in selective programs including the HeadStart Fellowship Technology Fellow program and Jane Street's UNBOXED Scholar program, where he immersed himself in quantitative trading through probability, statistics, and game theory challenges, and acquired SQLite expertise in workshops led by the Head of Engineering.\n\nWith a strong technical foundation, leadership experience, and creative problem-solving abilities, Yeabsera is positioned to make significant contributions in software engineering and game development."
}