{
    "id": "yuwei-qin-7654bb74",
    "name": "Yuwei Qin",
    "profile_pic": "https://media.licdn.com/dms/image/v2/C5603AQGNj7wJGzPTfA/profile-displayphoto-shrink_200_200/profile-displayphoto-shrink_200_200/0/1524618540253?e=2147483647&v=beta&t=Vz3WbczKstX4HNWaaVNw-pyTQPzy0qEoDcCTB52uZOY",
    "links": [
        "https://ieeexplore.ieee.org/abstract/document/8954691/",
        "https://aip.scitation.org/doi/full/10.1063/1.5130455",
        "https://scholar.google.com/citations?user=0Hiq7AYAAAAJ",
        "https://www.researchgate.net/profile/Yuwei-Qin-4"
    ],
    "short_description": "A results-driven AI hardware specialist currently at d-Matrix with a strong background in computational electromagnetics and machine learning. Yuwei holds a PhD from Carnegie Mellon University and has extensive research experience in applying deep neural networks to data detection and electromagnetic analysis.",
    "long_description": "Yuwei Qin is a technical professional specializing in AI hardware optimization, currently working at d-Matrix, a company focused on AI compute platforms for inference. With a PhD from Carnegie Mellon University's Department of Electrical and Computer Engineering, Yuwei has developed expertise at the intersection of hardware engineering and machine learning.\n\nYuwei's research contributions are particularly notable in the fields of computational electromagnetics, machine learning applications for hardware, and magnetic recording technologies. His publication record includes over 20 papers with more than 150 citations, demonstrating significant impact in his field. His most cited work includes \"Machine learning based method of moments (ML-MoM)\" (46 citations) and \"Deep Neural Network: Data Detection Channel for Hard Disk Drives by Learning\" (22 citations).\n\nHis research has focused on applying deep neural networks and machine learning to improve data detection in storage systems, particularly for hard disk drives. Notable achievements include developing a CNN-based read channel for hard disk drives that achieved a 30% error rate reduction and 200Mbits/s throughput in 28nm CMOS technology. This work represents a significant advancement in storage system performance through the application of machine learning techniques.\n\nYuwei has also made contributions to computational electromagnetics, developing machine learning-based approaches for electromagnetic compatibility analysis and parasitic capacitance extractions. His work on electrically tunable polarizers based on graphene-loaded plasmonic cross antennas demonstrates his expertise in applied physics and device modeling.\n\nIn the field of heat-assisted magnetic recording (HAMR), Yuwei has conducted research on improving recording performance through micromagnetic modeling and analysis of thermal profiles, contributing to advancements in storage technology.\n\nThroughout his career, Yuwei has collaborated with researchers from institutions including the University of Hong Kong, Western Digital, and Zhejiang University, building a strong professional network in the field of AI hardware and computational electromagnetics.\n\nHis technical expertise spans computer engineering, deep learning, storage systems, device modeling, semiconductor device physics, and applied physics, making him a versatile professional at the cutting edge of AI hardware optimization and machine learning applications for hardware systems."
}