{
    "id": "zarif-azher-260b401bb",
    "name": "Zarif Azher",
    "profile_pic": "https://media.licdn.com/dms/image/v2/D4E03AQG44C5dyaf9Cg/profile-displayphoto-shrink_200_200/profile-displayphoto-shrink_200_200/0/1715574913480?e=2147483647&v=beta&t=WCNjDeqJ3vqTvZtzztqvHBpdTXmZs4kZmeZ2In_R-8o",
    "contacts": [
        "zarif-azher-260b401bb@linkedin.com"
    ],
    "links": [
        "https://github.com/zarif101",
        "https://scholar.google.com/citations?user=RuRyHyYAAAAJ&hl=en"
    ],
    "short_description": "Undergraduate student at Caltech studying Bioengineering and Computer Science. Experienced innovator and researcher with 10+ peer-reviewed publications in leading journals and conferences. Passionate about applying technology to biomedical problems to expand global healthcare access.",
    "long_description": "Zarif Azher is an undergraduate student at Caltech pursuing a Bachelor of Science in Bioengineering and Computer Science (2024-2028). He is a passionate innovator and researcher with extensive experience applying computational methods to biomedical challenges. Zarif has published over 10 peer-reviewed papers in leading journals and conferences, with research focusing on computational pathology, spatial transcriptomics, and AI applications in healthcare.\n\nHis professional experience includes working as a Medical Technology Innovator at the National Institute of Cardiovascular Diseases (May 2022-Dec 2024), AI Engineer at Caire Health (Jun 2024-Oct 2024), and Director of the Government Accountability Project at Dhaka North City Corporation (Jan 2023-Sep 2024). He has also held research positions at Case Western Reserve University as a Computational Pathology Researcher (May 2022-Aug 2023) and internships at The World Bank (May-Aug 2023), University of Maryland (Jun 2021-Dec 2022), and Bangladesh University (Apr 2020-Sep 2024).\n\nZarif's research publications span diverse areas including spatial omics, cancer pathology analysis, molecular assessments of skin photoaging, and environmental justice. His work demonstrates a strong interdisciplinary approach combining bioinformatics, artificial intelligence, and pathology. He is committed to leveraging powerful technology to solve biomedical problems with the goal of expanding global healthcare access."
}