{
    "id": "zarif-azher-260b401bb",
    "name": "Zarif Azher",
    "profile_pic": "https://media.licdn.com/dms/image/v2/D4E03AQG44C5dyaf9Cg/profile-displayphoto-shrink_200_200/profile-displayphoto-shrink_200_200/0/1715574913480?e=2147483647&v=beta&t=WCNjDeqJ3vqTvZtzztqvHBpdTXmZs4kZmeZ2In_R-8o",
    "links": [
        "https://scholar.google.com/citations?user=RuRyHyYAAAAJ&hl=en",
        "https://github.com/zarif101",
        "https://zarifazher.com"
    ],
    "short_description": "Bioengineering and Computer Science undergraduate at Caltech with extensive research experience in computational pathology and medical technology innovation. Published 10+ peer-reviewed papers in leading journals, focusing on applying AI and spatial transcriptomics to biomedical problems with the goal of expanding global healthcare access.",
    "long_description": "Zarif Azher is an undergraduate student at Caltech pursuing a Bachelor of Science in Bioengineering and Computer Science (2024-2028). He is a passionate innovator and researcher at the intersection of AI and healthcare, with a particular focus on computational pathology, spatial transcriptomics, and medical technology development.\n\nZarif has an impressive research portfolio with over 10 peer-reviewed publications in prestigious journals and conferences, including the Pacific Symposium on Biocomputing, BioData Mining, and the Journal of Pathology Informatics. His research spans innovative applications of AI in healthcare, such as inferring spatial transcriptomics from histological patterns, developing multimodal deep learning models for cancer prognostication, and creating interpretable AI systems for biomedical analysis.\n\nHis work has been cited over 60 times by researchers in the field, demonstrating the impact of his contributions to computational biology and medical AI. His recent projects include mapping three-dimensional tumor heterogeneity through deep learning inference of spatial transcriptomics from routine histopathology, and developing LLM-driven agent approaches to modeling legislative behavior.\n\nBeyond his technical research, Zarif is committed to making healthcare more accessible globally. On his personal website, he states: \"I want to use powerful technology to improve healthcare access and quality worldwide.\" He describes himself as a leader who organizes \"people and things to accomplish ambitious goals\" and a researcher developing \"novel solutions to real-world issues – science for action, not observation.\"\n\nZarif's professional experience includes working in the Gao Research Group at Caltech and collaborating with researchers from institutions like Case Western Reserve University, Dana-Farber Cancer Institute, and Dartmouth College. He has also been involved in projects to fight government corruption in Bangladesh, advocate for environmental justice in the USA, and deploy novel assistive technology for medical practitioners in underserved regions.\n\nHis interdisciplinary approach combines expertise in machine learning, bioinformatics, multimodal deep learning, cancer research, and pathology, positioning him as an emerging leader in the application of AI to solve complex healthcare challenges."
}