{
    "id": "zeyneb-kaya",
    "name": "Zeyneb Nahide Kaya",
    "profile_pic": "https://media.licdn.com/dms/image/v2/D5603AQEi8fKQahmGtg/profile-displayphoto-shrink_200_200/profile-displayphoto-shrink_200_200/0/1690337858570?e=2147483647&v=beta&t=BTSlMq9TxiLQWJvcQ_FTX7rWmsDAroNBU8k_LBxsRiQ",
    "links": [
        "https://www.zeynebnk.com/",
        "https://scholar.google.com/citations?user=xHFzGFcAAAAJ",
        "https://profiles.stanford.edu/zeyneb-kaya"
    ],
    "short_description": "Zeyneb Nahide Kaya is a CS student at Stanford University and accomplished NLP researcher focusing on data efficiency and interpretability in AI algorithms. As a Regeneron Science Talent Search Top 5 Winner and Coca-Cola Scholar, she has published multiple papers on low-resource languages, multilingual data augmentation, and language model understanding of morphology. She is also the founder of Romeyka Everlasting, a nonprofit dedicated to preserving the endangered Greek dialect.",
    "long_description": "Zeyneb Nahide Kaya is a Computer Science student at Stanford University with a distinguished research background in Natural Language Processing. Her research interests focus on understanding and advancing NLP algorithms, particularly in areas of data efficiency and interpretability to enhance the robust reasoning capabilities of algorithms beyond shallow pattern memorization.\n\nZeyneb has achieved remarkable recognition in the scientific community at a young age. She placed 5th in the prestigious Regeneron Science Talent Search, winning a $90,000 award, and was selected as a Coca-Cola Scholar from over 103,000 applicants. Her academic excellence is further highlighted by being named a NCWIT Aspirations in Computing National Winner in 2023 and a U.S. Presidential Scholar Semifinalist in 2024.\n\nHer research portfolio is impressive and diverse, with publications spanning multiple areas of computational linguistics. Her work includes studies on \"Full Scope Word Embedding Variability for Low-Resource Languages\" (IEEE MIT URTC), \"Measuring the Impact of Data Augmentation Methods for Extremely Low-Resource NMT\" (LoResMT @ EACL, cited 5 times), and \"MADLIBS: A Novel Multilingual Data Augmentation Algorithm for Low-Resource Neural Machine Translation.\" She has also explored the intersection of linguistics and computer science in works like \"The Pervasiveness of Language Contact: Evidence from Negative Existentials in Romeyka/Turkish Code-Switching\" (Proceedings of the Linguistic Society of America) and \"Language Models' Understanding of Agglutinative Morphology.\" Her recent work includes \"Decoding Large-Language Models: A Systematic Overview of Socio-Technical Impacts, Constraints, and Emerging Questions\" (arXiv, 2024).\n\nZeyneb is the founder and president of Romeyka Everlasting, a nonprofit organization dedicated to preserving Romeyka, an endangered Greek dialect spoken in regions of Turkey near the Black Sea. Through this initiative, she works towards developing computational methods for the documentation and analysis of the dialect, helping to preserve its linguistic heritage and cultural traditions.\n\nBeyond her research, Zeyneb serves as an Ambassador for Women in Data Science (WiDS) Worldwide and has co-authored a book titled \"Breaking Barriers: Celebrating Women and Diversity in Data Science\" which became an Amazon #1 New Release in STEM Education. She has also authored \"Everlasting Connection: Language, Time, Society, and Technology.\"\n\nHer academic achievements include extensive coursework in NLP, including Natural Language Processing with Deep Learning, AI & Language, Programming Abstractions, Computer Organization & Systems, Probability for Computer Scientists, and Mathematical Foundations of Computing at Stanford. Prior to Stanford, she maintained a perfect 4.0 GPA at Saratoga High School (2020-2024) where she served as AI Club Co-President and Linguistics Club Founder & President.\n\nZeyneb's technical expertise is complemented by her linguistic abilities, being fluent in English and Turkish with working proficiency in Chinese. Her achievements in linguistics competitions include 10th place globally (1st in USA) in the Online Linguistics Olympiad and qualifying for the Invitational Round of the North American Computational Linguistics Olympiad.\n\nAt hackathons, she continues to excel, winning the Scrapybara Sponsored Award at TreeHacks 2025. Her combination of technical depth, research acumen, and linguistic knowledge positions her as a rising star in the field of AI and computational linguistics."
}