{
    "id": "zhangalv",
    "name": "Alvin Zhang",
    "profile_pic": "https://media.licdn.com/dms/image/v2/D5603AQGR-LGMvC8sow/profile-displayphoto-shrink_200_200/profile-displayphoto-shrink_200_200/0/1730348155423?e=2147483647&v=beta&t=aPQpdFhMYP1H44PDEEeFUWC6TCbkolyD_6S20QikdAI",
    "links": [
        "https://www.linkedin.com/in/zhangalv",
        "mailto:zhangalv@neweraventures.com",
        "https://github.com/alvinzz"
    ],
    "short_description": "Alvin Zhang is an Electrical Engineering and Computer Science student at Caltech with diverse research interests spanning machine learning, statistical mechanics, and avionics. He balances academic pursuits with venture capital experience at New Era Ventures and leadership roles in Caltech's hackathon community while excelling as a competitive swimmer on Caltech's swim team.",
    "long_description": "Alvin Zhang is pursuing a BS in Electrical Engineering and Computer Science at Caltech, where he has quickly established himself across multiple technical domains. His research portfolio demonstrates versatility and depth, currently working as a Machine Learning Researcher focused on enhancing LLM agents while simultaneously conducting research on long-range statistical mechanics models and simulations under Prof. Tom Hutchcroft's mentorship.\n\nBeyond pure research, Alvin applies his technical skills in practical settings as an Avionics Engineer with PARSEC - Caltech Rocketry, where he develops hardware and software implementing rocket communication protocols. His interest in AI extends to his participation in the Caltech AI Alignment Machine Learning Fellowship, where he collaborates on novel AI research.\n\nAlvin has also ventured into the entrepreneurial ecosystem as a Venture Fellow at New Era Ventures, where he focuses on early-stage investing. His community leadership is evident in his role as an Event Organizer for Hacktech, Caltech's annual hackathon, where he handles logistics and sponsorship sourcing.\n\nAs a student-athlete, Alvin is a valuable member of Caltech's Men's Swimming and Diving team, specializing in butterfly and breaststroke events. During the 2025 SCIAC Championships, he qualified for the championship final in the 100-yard butterfly, finishing in 7th place with a time of 49.90 seconds. His athletic achievements complement his academic pursuits, demonstrating his ability to excel in multiple demanding areas.\n\nPrior to Caltech, Alvin attended Lakeside School (2020-2024) where he co-founded and served as Co-President of the Computer Science Club, organizing and directing club events. He was also a varsity swimmer, earning recognition as a 2022-23 NISCA Swimming and Diving All American and a member of the USA Swimming 2022-2023 Scholastic All-America Team. During his high school swimming career, he was a two-time Washington State Champion, winning the 50-yard freestyle and 100-yard butterfly events at the 2024 WIAA Boys 3A State Championship.\n\nHis other achievements include receiving the President's Volunteer Service Award (Silver) from AmeriCorps, qualifying for the American Invitational Mathematics Examination (AIME) with Distinction four times, and being named a National Merit Scholarship Finalist. Alvin also demonstrated community service leadership as the Founder and Club President of an American Red Cross chapter from 2021 to 2024."
}