{
    "id": "zhizhuo",
    "name": "Zhizhuo Z. Zhou",
    "profile_pic": "https://media.licdn.com/dms/image/v2/D5603AQF8DAZ1Qchfdw/profile-displayphoto-shrink_200_200/profile-displayphoto-shrink_200_200/0/1714108407121?e=2147483647&v=beta&t=Kc0rOuzuerIPfS6sliUj2aoN4QrzI4C3aAT_x9aDFP0",
    "links": [
        "https://www.zhiz.dev/",
        "https://www.linkedin.com/in/zhizhuo",
        "https://scholar.google.com/citations?user=WjZyzbYAAAAJ",
        "https://github.com/zhizdev"
    ],
    "short_description": "Zhizhuo is a PhD student at Stanford University working at the intersection of Generative AI and 3D computer vision. Previously affiliated with IBM and Carnegie Mellon University, they have also contributed to AI education as a Lead TA for AI4ALL at CMU.",
    "long_description": "Zhizhuo Z. Zhou is a PhD student in Computer Science at Stanford University, working in the Gradient Spaces Lab under the advisorship of Professor Iro Armeni. His research focuses on 3D generative AI, particularly understanding and generating 3D scenes from casual videos, images, and text.\n\nPrior to Stanford, Zhizhuo was an MSR (Master of Science in Robotics) student at Carnegie Mellon University, where he worked with Professor Shubham Tulsiani. He completed his undergraduate studies at the University of Michigan, where he had the opportunity to work with Professor David Fouhey.\n\nZhizhuo's research contributions include several significant publications in top computer vision conferences. His recent work \"MVD-Fusion: Single-view 3D via Depth-consistent Multi-view Generation\" was accepted at CVPR 2024, proposing a novel depth-aware 3D attention mechanism for generating multi-view consistent RGB-D images from a single RGB image. Another notable publication, \"SparseFusion: Distilling View-conditioned Diffusion for 3D Reconstruction\" (CVPR 2023), introduced a 3D neural mode-seeking formulation that combines probabilistic generation of unseen regions with faithful reprojection of seen regions in a consistent 3D representation.\n\nHis earlier work includes \"Quantifying Bird Skeletons\" presented at the CV4Animals Workshop in conjunction with CVPR 2021, which demonstrated how deep learning can be used to measure bird skeleton specimens with extraordinary accuracy and speed, potentially unlocking datasets at unprecedented scales.\n\nZhizhuo has been recognized with several awards, including the NSF Graduate Research Fellowship Program (GRFP) from 2021-2024. He also won the Meta-AI CO3D Challenge few-view reconstruction track at the ECCV 2022 NGR-CO3D workshop and received the Best Paper Award at the ProjectX 2020 ML for Climate Change Competition.\n\nBeyond his research, Zhizhuo has demonstrated a commitment to AI education, serving as the Lead Teaching Assistant for AI4ALL at Carnegie Mellon University in 2022 and as a Project Mentor for AI4ALL at the University of Michigan in 2021. These experiences highlight his dedication to nurturing the next generation of AI talent through mentorship and education.\n\nHis publications have garnered significant attention in the field, with his work cited hundreds of times according to Google Scholar. Zhizhuo's unique specialization in combining generative AI with 3D technologies positions him at the forefront of creating more immersive and interactive AI-powered experiences."
}