{
    "id": "zifei-xu-687b79157",
    "name": "Zifei Xu",
    "profile_pic": "https://media.licdn.com/dms/image/v2/D5603AQHYIqcy-QFTVQ/profile-displayphoto-shrink_200_200/profile-displayphoto-shrink_200_200/0/1728060493593?e=2147483647&v=beta&t=l740sk04vxYbv2Gv5UWoHt19oTCsCqld8-T8NH3VYx0",
    "links": [
        "https://www.credly.com/badges/16150e84-a3ea-4e58-95ca-de7ab8f194db/linked_in_profile",
        "https://digitalcredential.stanford.edu/check/835B4B9BA32042213CD1728DF1ADB854ADF41EC41CC7E3C718025A66073F2E2COTBoUDlHYnZHeVdMN21LVklFTjBUMFZ0VGtKRGpIaS9GV2NqalFXTjBZWFRCVm5C",
        "https://www.researchgate.net/profile/Zifei-Xu-3",
        "https://scholar.google.com/citations?user=wXEcojgAAAAJ"
    ],
    "short_description": "Zifei Xu is a Senior Machine Learning Research Engineer at d-Matrix, specializing in AI inference acceleration. With a PhD in Fluid and Machinery Engineering, a Master's in Computational and Mathematical Engineering from Stanford, and experience as a Marie Curie Research Fellow at the University of Liverpool, she combines strong technical expertise in machine learning with practical engineering skills. Her research spans LLM quantization, intelligent fault diagnostics, and offshore wind turbine technologies.",
    "long_description": "Zifei Xu is a Senior Machine Learning Research Engineer at d-Matrix, where she focuses on developing cutting-edge solutions for AI inference acceleration. Her work contributes to d-Matrix's mission of making generative AI more efficient and accessible through specialized hardware and software optimizations, with particular expertise in post-training quantization of large language models.\n\nWith a diverse educational background, Zifei holds a PhD in Fluid and Machinery Engineering from the University of Shanghai for Science and Technology (2016-2022), a Master's degree in Computational and Mathematical Engineering with a Data Science track from Stanford University (2021-2023), and a Bachelor of Engineering with Highest Distinction from the National University of Singapore (2016-2020), where she also minored in Computer Science.\n\nZifei's professional journey spans both industry and academia. Before joining d-Matrix as a Senior ML Research Engineer in July 2023, she completed an internship with the same company, demonstrating her value to the organization. Prior to that, she worked as an IT Engineer specializing in Front End Automation at Micron Technology in Singapore for over a year. Her early career also includes a machinery internship at ExxonMobil, where she worked on machine monitoring and data analysis.\n\nIn academia, Zifei has served as a Marie Curie Research Fellow at the University of Liverpool and Liverpool John Moores University (2022-2023), where she conducted research on diagnostics, prognostics, and health management technologies for mechanical systems of floating offshore wind turbines. Her research has been prolific, with over 30 peer-reviewed publications focusing on structural health monitoring, machine learning-based intelligent fault diagnostics, remaining useful life prediction, and mechanical system dynamic modeling.\n\nHer recent research contributions include work on post-training quantization of large language models, self-selected attention span for accelerating LLM inference, and scaling laws for quantized LLMs. She has also applied interpretable machine learning to healthcare domains, including predicting maternal and fetal outcomes.\n\nZifei's technical credentials include being a speaker at the PyTorch Conference 2024, certification as a Code in Place 2023 Section Leader at Stanford, and completing courses in Neural Networks and Deep Learning, JavaScript web programming, and debugging techniques. She also holds a Solid Edge ST10 Certified Professional credential from Siemens.\n\nMultilingual and with cross-cultural experience, Zifei is proficient in Chinese (Mandarin) and English. Her unique combination of deep technical knowledge in machine learning, practical engineering experience, and interdisciplinary research makes her a valuable contributor to the fields of AI hardware optimization, inference acceleration, and applied machine learning."
}