{
    "id": "zifei-xu-687b79157",
    "name": "Zifei Xu",
    "profile_pic": "https://media.licdn.com/dms/image/v2/D5603AQHYIqcy-QFTVQ/profile-displayphoto-shrink_200_200/profile-displayphoto-shrink_200_200/0/1728060493593?e=2147483647&v=beta&t=l740sk04vxYbv2Gv5UWoHt19oTCsCqld8-T8NH3VYx0",
    "contacts": [
        "We are hiring! Please contact me if you would like a referral :)"
    ],
    "links": [
        "https://www.linkedin.com/in/zifei-xu-687b79157"
    ],
    "short_description": "Zifei Xu is a Senior Machine Learning Research Engineer at d-Matrix with expertise in AI inference acceleration. She holds a Master's degree in Computational and Mathematical Engineering from Stanford University and a Bachelor's degree with Highest Distinction from the National University of Singapore. Zifei has experience in machine learning, automation, and data analysis across various industries.",
    "long_description": "Zifei Xu is a Senior Machine Learning Research Engineer at d-Matrix, where she focuses on AI inference acceleration technologies. She joined d-Matrix as a Machine Learning Research Intern in 2022 before transitioning to a full-time role in 2023. Her work likely involves optimizing machine learning models for efficient inference on specialized hardware.\n\nZifei has a strong educational background, holding a Master's degree in Computational and Mathematical Engineering with a Data Science track from Stanford University (2021-2023). She also earned a Bachelor of Engineering with Highest Distinction (4.91/5.0) from the National University of Singapore (2016-2020), where she minored in Computer Science. During her undergraduate studies, she participated in an exchange program at the University of Sydney in 2018.\n\nPrior to her current role, Zifei worked as an IT Engineer specializing in Automation at Micron Technology in Singapore for over a year. She also gained experience as a Machinery Intern at ExxonMobil, where she worked on machine monitoring, data analysis, and collaborated with international teams on machine inspection and maintenance. Earlier in her career, she served as a Translator for a Chinese educational technology company, helping to introduce Khan Academy to China's education market.\n\nZifei has received several recognitions, including being named a Speaker at the PyTorch Conference 2024 and serving as a Section Leader for Stanford's Code in Place 2023. She was consistently on the Engineering Dean's List at NUS and received the Science and Technology Undergraduate Scholarship from Singapore's Ministry of Education. She also passed the CFA Level I exam in 2021.\n\nShe is proficient in both Chinese (native) and English (professional), and has completed various certifications in neural networks, deep learning, JavaScript programming, and troubleshooting techniques. Zifei also has volunteer experience as a Quality Education Volunteer with AIESEC."
}