{
    "id": "~catherine",
    "name": "Catherine Lee",
    "profile_pic": "https://static.licdn.com/aero-v1/sc/h/9c8pery4andzj6ohjkjp54ma2",
    "links": [
        "https://catherinelee274.github.io",
        "https://github.com/catherinelee274",
        "https://www.linkedin.com/in/catherineleeux/"
    ],
    "short_description": "Catherine Lee is a machine learning professional currently working at Lamini. She has developed expertise in LSTM networks and boosting algorithms, with award-winning projects focused on data usability and practical applications of AI, particularly in transportation safety and fraud detection. She is also an accomplished UX designer with experience optimizing user experiences for startups and enterprise clients.",
    "long_description": "Catherine Lee is a machine learning professional currently working at Lamini, an AI company. She has demonstrated a strong foundation in machine learning, having completed the Machine Learning Specialization from DeepLearning.AI and Stanford University in January 2024.\n\nCatherine has authored research publications including \"Predicting the Number of Accidents in Different Weather Conditions in Barcelona Using Long Short Term Memory\" (2019) and \"Adtracking Fraud Detection Using Boosting Algorithms and Neural Networks\" (2019), showing her expertise in applying advanced ML techniques to real-world problems.\n\nHer project portfolio showcases diverse applications of AI and technology. Notable projects include \"Bikeable,\" which won the Best Data Usability Hack at PennApps 2019 for using machine learning to generate safer bicycle routes based on accident data. She also worked on \"PictRNNary,\" which earned the Best Use of Microsoft Azure Hack at Cal Hacks 5.0 in 2018, and \"Place It,\" which won Best Under Construction Hack at LA Hacks 2020.\n\nCatherine is also an accomplished UX designer with experience working with both startups and enterprise clients. Her design portfolio includes work for companies like Thoughtful, J.P. Morgan, Northwestern Mutual, and Masse, where she focused on optimizing user experiences and operational efficiency. Her design approach is methodical, using both data and qualitative user research to inform her designs. According to Elizabeth Cordry Shaffer, Co-Founder & CEO at Thoughtful, \"She produces incredibly thoughtful work quickly, and handles feedback very well from team members. Communication and presentation of her ideas is a core strength of hers.\"\n\nCatherine has participated in prestigious tech programs including the Google CodeU Program and JP Morgan Code for Good, demonstrating her commitment to applying technology for positive impact. Her recent project \"Ayna\" (November 2023) indicates her continued involvement in innovative tech development.\n\nShe is multilingual, with native proficiency in English and Cantonese, and elementary proficiency in French, which enhances her ability to work in diverse environments. Catherine's consistent recognition through hackathon awards highlights her technical skills and ability to develop practical, impactful solutions using AI, machine learning, and user-centered design."
}