{
    "id": "~catherine",
    "name": "Catherine Lee",
    "profile_pic": "https://static.licdn.com/aero-v1/sc/h/9c8pery4andzj6ohjkjp54ma2",
    "contacts": [
        "1K followers",
        "500+ connections"
    ],
    "links": [
        "https://www.linkedin.com/company/lamini-ai",
        "https://github.com/DevinMui/pictionary",
        "https://github.com/Delaware2018/team-7",
        "http://catherinelee274.github.io",
        "https://devpost.com/software/bikeable",
        "https://devpost.com/software/place-it-n9tq5b"
    ],
    "short_description": "Catherine Lee is associated with Lamini and has recently earned a Machine Learning Specialization from DeepLearning.AI and Stanford University. She has worked on several projects including Ayna, Bikeable, and participated in the Google CodeU Program.",
    "long_description": "Catherine Lee is a professional associated with Lamini, who recently earned a Machine Learning Specialization certification from DeepLearning.AI and Stanford University in January 2024. She is multilingual, with native proficiency in English and Cantonese, and elementary proficiency in French.\n\nCatherine has worked on numerous technical projects, including Ayna (November 2023), Bikeable (September-November 2019), Google CodeU Program (June-September 2019), PictRNNary (November 2018), and JP Morgan Code for Good (September 2018). She also maintains a personal website at catherinelee274.github.io.\n\nHer academic work includes publications on \"Predicting the Number of Accidents in Different Weather Conditions in Barcelona Using Long Short Term Memory\" (June 2019) and \"Adtracking Fraud Detection Using Boosting Algorithms and Neural Networks\" (February 2019).\n\nCatherine has received several awards for her technical projects, including Best Under Construction Hack at LA Hacks 2020 for \"Place It\", Best Data Usability Hack at PennApps 2019 for Bikeable (a Boston directions app for bicyclists using machine learning based on prior bike accidents), and Best Use of Microsoft Azure Hack at Cal Hacks 5.0 in November 2018 for PictRNNary.\n\nHer work demonstrates expertise in machine learning, data analysis, and software development, with a particular focus on practical applications that address real-world problems."
}